<?xml version='1.0' encoding='utf-8'?>
<resources>
  <string name="action_cancel">منسوخ کریں</string>
  <string name="action_ok">ٹھیک ہے</string>
  <string name="urlbar_hint">پتہ تلاش یا داخل کریں</string>
  <string name="teaser">خود کار نجی براؤزنگ۔ برائوز کریں ۔ٹائیں، دہرائیں۔</string>
  <string name="feedback_erase">آپ کے برائوزنگ سابقات مٹا دیئے گئے ہیں۔</string>
  <string name="search_hint">۔%1$s کے لئے تلاش کریں</string>
  <string name="menu_share">شیئر کریں…</string>
  <string name="menu_open_with_default_browser">۔%1$s کے ساتھ کھولِں</string>
  <string name="menu_open_with_a_browser">کے ساتھ کھولیں…</string>
  <string name="menu_settings">سیٹنگیں</string>
  <string name="menu_about">کے بارے میں</string>
  <string name="menu_help">مدد</string>
  <string name="menu_rights">آپ کے حقوق</string>
  <string name="about_content"><![CDATA[<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"%1$s &#1570;&#1662; &#1705;&#1608; &#1705;&#1606;&#1657;&#1585;&#1608;&#1604; &#1583;&#1740;&#1578;&#1740; &#1729;&#1746; "</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">" &#1575;&#1587;&#1705;&#1608; &#1606;&#1580;&#1740; &#1576;&#1585;&#1575;&#1574;&#1608;&#1586;&#1585; &#1705;&#1740; &#1591;&#1585;&#1581; &#1575;&#1587;&#1578;&#1593;&#1605;&#1575;&#1604; &#1705;&#1585;&#1740;&#1722;:\n  "<ul>" \n    "<li>" &#1575;&#1662;&#1604;&#1740; &#1705;&#1740;&#1588;&#1606; &#1605;&#1740;&#1722; &#1729;&#1740; &#1578;&#1604;&#1575;&#1588; &#1575;&#1608;&#1585; &#1576;&#1585;&#1575;&#1572;&#1586; &#1705;&#1585;&#1740;&#1722; "</li>"\n    "<li>"&#1657;&#1585;&#1740;&#1705;&#1585;&#1585;&#1648; &#1705;&#1608; &#1576;&#1604;&#1575;&#1705; &#1705;&#1585;&#1740;&#1722; (&#1740;&#1575; &#1587;&#1657;&#1740;&#1606;&#1711;&#1608;&#1722; &#1705;&#1740; &#1578;&#1575;&#1586;&#1729; &#1705;&#1575;&#1585;&#1740; &#1705;&#1585; &#1705;&#1746; &#1657;&#1585;&#1740;&#1705;&#1585;&#1585;&#1648; &#1705;&#1608; &#1575;&#1580;&#1575;&#1586;&#1578; &#1583;&#1740;&#1722;)&#1748; "</li>"\n    "<li>" &#1705;&#1608;&#1705;&#1740;&#1586; &#1705;&#1746; &#1587;&#1575;&#1578;&#1726; &#1578;&#1604;&#1575;&#1588; &#1575;&#1608;&#1585; &#1576;&#1585;&#1575;&#1572;&#1586;&#1606;&#1711; &#1587;&#1575;&#1576;&#1602;&#1575;&#1578; &#1705;&#1608; &#1576;&#1726;&#1740; &#1581;&#1584;&#1601; &#1705;&#1585;&#1606;&#1746; &#1705;&#1740;&#1604;&#1740;&#1746; &#1605;&#1657;&#1575;&#1574;&#1740;&#1722; "</li>"\n  "</ul>\n</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">%1$s &#1705;&#1740; &#1662;&#1740;&#1583;&#1575;&#1608;&#1575;&#1585; &#1729;&#1746;&#1748; &#1726;&#1605;&#1575;&#1585;&#1740; &#1605;&#1729;&#1605; &#1575;&#1740;&#1705; &#1589;&#1581;&#1578; &#1605;&#1606;&#1583; &#1705;&#1726;&#1604;&#1746; &#1575;&#1606;&#1657;&#1585;&#1606;&#1740;&#1657; &#1705;&#1608; &#1601;&#1585;&#1608;&#1593;&#1648; &#1583;&#1740;&#1606;&#1575; &#1729;&#1746;&#1748; Mozilla<br/>\n<a href="%2$s">" &#1605;&#1586;&#1740;&#1583; &#1587;&#1740;&#1705;&#1726;&#1740;&#1722; "</a></p>]]></string>
  <string name="preference_category_search">تلاش</string>
  <string name="preference_search_engine_default">طے شدہ</string>
  <string name="preference_dialog_title_search_engine">طے شدہ تلاش</string>
  <string name="preference_category_privacy">رازداری</string>
  <string name="preference_privacy_block_ads">اشتھار ٹریکرز کو بلاک کریں</string>
  <string name="preference_privacy_block_analytics">تجزیاتی ٹریکرز کو بلاک کریں</string>
  <string name="preference_privacy_block_social">سماجی ٹریکرز بلاک کریں</string>
  <string name="preference_privacy_block_content">دیگر مواد کے ٹڑیکرز بلاک کریں</string>
  <string name="preference_privacy_block_content_summary">شاید کچھ وڈیوز اور ویب صفحات کو توڑ دے</string>
  <string name="preference_category_performance">کارکردگی</string>
  <string name="preference_performance_block_webfonts">ویب فونٹس بلاک کریں</string>
  <string name="preference_performance_block_images">نقوش بلاک کریں</string>
  <string name="preference_default_browser">طےشدہ براؤزر بنائیں</string>
  <string name="preference_category_mozilla">Mozilla</string>
  <string name="preference_mozilla_telemetry">گمنام استعمال شدہ کوائف ارسال کریں</string>
  <string name="preference_mozilla_telemetry_summary">مزید سیکھیں</string>
  <string name="preference_about">کے بارے میں%1$s</string>
  <string name="content_description_clear_input">ان پٹ صاف کریں</string>
  <string name="content_description_dismiss_input">برخاست کریں</string>
  <string name="content_description_erase">برائوزنگ سابقات مٹائیں</string>
  <string name="content_description_lock">قابل بھروسا کنکشن</string>
  <string name="accessibility_announcement_loading">لوڈ ہو رہا ہے</string>
  <string name="accessibility_announcement_loading_finished">ویبسائٹ لوڈ ہو گئی ہے</string>
  <string name="content_description_menu">مزید اختیارات</string>
  <string name="content_description_forward">آگے کی جانب گشت کريں</string>
  <string name="content_description_reload">ویب سائٹ دوبارہ لوڈ کریں</string>
  <string name="firstrun_title">اس طرح براؤز کریں جیسے کوئی نہیں دیکھ رہا۔</string>
  <string name="firstrun_description">براوز کرنے وقت آنلائن سراغ راہ خودکار طور پر بلاک کریں۔ پھر دورہ شدہ صفحات، تلاش، کوکیاں اور پاسورڈ کو تھپتھپا کر اپنے آلہ سے مٹائیں۔</string>
  <string name="firstrun_button">ٹھیک ہے مجھے سمجھ آگئی ہے!\n</string>
  <string name="firstrun_footer">واضح رہے، سائٹس اور خدمات جو آپ استعمال کرتے رہے اب بھی جانتے ہیں جہاں آپ جا چکے ہیں۔</string>
  <string name="your_rights">آپ کے حقوق</string>
  <string name="external_app_prompt_title">کسی دوسری اپلیکیشن میں ربط کھولیں</string>
  <string name="external_app_prompt">اس ربط کو %2$s میں کھولنے کے لیےآپ %1$s چھوڑ سکتے ہیں۔</string>
  <string name="external_app_prompt_no_app_title">ایک ایپیلیکیشن تلاش کریں جو ربط کو کھول سکے</string>
  <string name="external_app_prompt_no_app">آپ کے آلہ پر کوئی بھی ایپلیکیثن اس ربط کو کھولنے کی اھل نہِں۔ آپ %1$s کو چھوڑ کر %2$s کو تلاش کریں ایک ایسی اپلی کیشن جو یہ کر سکتی ہو۔</string>
  <string name="external_multiple_apps_matched_exit">نجی براؤزنگ سے خروج کریں؟</string>
  <string name="errorpage_title">صفحہ لوڈ کرنے میں مسلہ ہے</string>
  <string name="errorpage_refresh">دوبارہ کوشش کریں</string>
  <string name="error_connectionfailure_title">جڑنے میں ناکام رہا</string>
  <string name="error_connectionfailure_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li>&#1608;&#1740;&#1576; &#1587;&#1575;&#1574;&#1657; &#1593;&#1575;&#1585;&#1590;&#1740; &#1591;&#1608;&#1585; &#1662;&#1585; &#1593;&#1583;&#1605; &#1583;&#1587;&#1578;&#1740;&#1575;&#1576; &#1740;&#1575; &#1576;&#1729;&#1578; &#1605;&#1589;&#1585;&#1608;&#1601; &#1729;&#1608; &#1587;&#1705;&#1578;&#1740; &#1729;&#1746; &#1748; &#1670;&#1606;&#1583; &#1604;&#1605;&#1581;&#1608;&#1722; &#1605;&#1740;&#1722; &#1583;&#1608;&#1576;&#1575;&#1585;&#1729; &#1705;&#1608;&#1588;&#1588; &#1705;&#1585;&#1740;&#1722; &#1748;</li>"\n        "<li>&#1575;&#1711;&#1585; &#1570;&#1662; &#1705;&#1608;&#1574;&#1740; &#1576;&#1726;&#1740; &#1589;&#1601;&#1581;&#1575;&#1578; &#1604;&#1608;&#1672; &#1606;&#1606;&#1729;&#1740;&#1722; &#1705;&#1585; &#1587;&#1705; &#1585;&#1729;&#1746;, &#1575;&#1662;&#1606;&#1746; &#1605;&#1608;&#1576;&#1575;&#1574;&#1604; &#1570;&#1604;&#1729; &#1705;&#1575; &#1672;&#1740;&#1657;&#1575; &#1740;&#1575; &#1608;&#1575;&#1574;&#1740; &#1601;&#1575;&#1574;&#1740; &#1705;&#1606;&#1705;&#1588;&#1606; &#1705;&#1740; &#1662;&#1681;&#1578;&#1575;&#1604; &#1705;&#1585;&#1740;&#1722; &#1748;</li>"\n      "</ul>]]></string>
  <string name="error_timeout_title">کنکشن تعطل وقت</string>
  <string name="error_hostLookup_title">پیش کار نہیں ملا</string>
  <string name="error_hostLookup_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li>" &#1662;&#1578;&#1729; &#1705;&#1746; &#1606;&#1602;&#1575;&#1574;&#1589; &#1705;&#1740; &#1662;&#1681;&#1578;&#1575;&#1604; &#1705;&#1585;&#1740;&#1722; &#1580;&#1740;&#1587;&#1575; &#1705;&#1729;\n          "<strong>ww</strong>".example.com &#1705;&#1740; &#1580;&#1711;&#1729;\n          "<strong>www</strong>.example.com</li>"\n        "<li>" &#1575;&#1711;&#1585; &#1570;&#1662; &#1705;&#1587;&#1740; &#1576;&#1726;&#1740; &#1589;&#1601;&#1581;&#1729; &#1705;&#1608; &#1604;&#1608;&#1672; &#1606;&#1729;&#1740;&#1722; &#1705;&#1585; &#1662;&#1575; &#1585;&#1729;&#1746; &#1578;&#1608; &#1575;&#1662;&#1606;&#1575; &#1570;&#1604;&#1729; &#1705;&#1746; &#1672;&#1740;&#1657;&#1575; &#1740;&#1575; &#1608;&#1575;&#1574;&#1740;-&#1601;&#1575;&#1574;&#1740; &#1705;&#1740; &#1662;&#1681;&#1578;&#1575;&#1604; &#1705;&#1585;&#1740;&#1722;&#1748;"</li>"\n      "</ul>]]></string>
  <string name="error_malformedURI_title">پتہ جائز نہیں ہے</string>
  <string name="error_malformedURI_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>" &#1608;&#1740;&#1576; &#1705;&#1746; &#1662;&#1578;&#1746; &#1593;&#1605;&#1608;&#1605;&#1740; &#1591;&#1608;&#1585; &#1662;&#1585; &#1575;&#1740;&#1587;&#1746; &#1604;&#1726;&#1705;&#1746; &#1580;&#1575;&#1578;&#1746; &#1729;&#1740;&#1722; "<strong>http://www.example.com/</strong></li>"\n  "<li>" .("<strong>/</strong>"&#1575;&#1587; &#1576;&#1575;&#1578; &#1705;&#1608; &#1740;&#1602;&#1740;&#1606;&#1740; &#1576;&#1606;&#1575;&#1574;&#1740;&#1722; &#1705;&#1746; &#1570;&#1662; &#1587;&#1740;&#1583;&#1726;&#1575; &#1587;&#1604;&#1740;&#1588; &#1575;&#1587;&#1578;&#1593;&#1605;&#1575;&#1604; &#1705;&#1585; &#1585;&#1729;&#1746; &#1729;&#1740;&#1722; (&#1580;&#1740;&#1587;&#1575; &#1705;&#1746; "</li>\n</ul>]]></string>
  <string name="error_redirectLoop_title">پہ صفحہ صجہج طرج سے دوسری سمت نہیں جا رہا</string>
  <string name="error_redirectLoop_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#1740;&#1729; &#1605;&#1587;&#1574;&#1604;&#1729; &#1705;&#1576;&#1726;&#1740; &#1705;&#1576;&#1726;&#1740; &#1606;&#1575;&#1575;&#1729;&#1604; &#1576;&#1606;&#1575; &#1585;&#1729;&#1575; &#1729;&#1746; &#1740;&#1575; &#1705;&#1608;&#1705;&#1740;&#1586; &#1705;&#1608; &#1602;&#1576;&#1608;&#1604; &#1705;&#1585;&#1606;&#1746; &#1587;&#1746; &#1575;&#1606;&#1705;&#1575;&#1585; &#1705;&#1740; &#1608;&#1580;&#1729; &#1587;&#1746; &#1570;&#1587;&#1705;&#1578;&#1575; &#1729;&#1746;&#1748;</li>\n</ul>]]></string>
  <string name="error_unsupportedprotocol_title">سائٹ کا پتہ سمجھ نہیں آیا</string>
  <string name="error_unsupportedprotocol_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#1570;&#1662; &#1575;&#1587; &#1662;&#1578;&#1729; &#1705;&#1608; &#1705;&#1726;&#1608;&#1604;&#1606;&#1746; &#1705;&#1746; &#1604;&#1574;&#1746; &#1583;&#1740;&#1711;&#1585; &#1587;&#1575;&#1601;&#1657; &#1608;&#1740;&#1574;&#1585; &#1578;&#1606;&#1589;&#1740;&#1576; &#1705;&#1585;&#1606;&#1746; &#1705;&#1740; &#1590;&#1585;&#1608;&#1585;&#1578; &#1662;&#1681; &#1587;&#1705;&#1578;&#1740; &#1729;&#1746; &#1748;</li>\n</ul>]]></string>
  <string name="error_sslhandshake_title">قابل بھروسا کنکشن ناکام رہا</string>
  <string name="error_sslhandshake_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>"  &#1740;&#1729; &#1605;&#1587;&#1574;&#1604;&#1729; &#1662;&#1740;&#1588; &#1705;&#1575;&#1585; &#1705;&#1740; &#1578;&#1588;&#1705;&#1740;&#1604; &#1605;&#1740;&#1722; &#1576;&#1726;&#1740; &#1729;&#1608; &#1587;&#1705;&#1578;&#1575; &#1729;&#1746; &#1740;&#1575; &#1705;&#1608;&#1574;&#1740; &#1662;&#1740;&#1588;&#1705;&#1575;&#1585; &#1705;&#1740; &#1606;&#1602;&#1575;&#1604;&#1740; &#1705;&#1740; &#1705;&#1608;&#1588;&#1588; &#1705;&#1585;&#1585;&#1729;&#1575; &#1729;&#1746;"</li>"\n  "<li>" &#1575;&#1711;&#1585; &#1570;&#1662; &#1605;&#1575;&#1590;&#1740; &#1605;&#1740;&#1722; &#1575;&#1587; &#1662;&#1740;&#1588; &#1705;&#1575;&#1585; &#1662;&#1585; &#1705;&#1575;&#1605;&#1740;&#1575;&#1576;&#1740; &#1587;&#1746; &#1580;&#1681;&#1670;&#1705;&#1746; &#1729;&#1740;&#1722;&#1548; &#1578;&#1608; &#1606;&#1602;&#1589; &#1593;&#1575;&#1585;&#1590;&#1740; &#1576;&#1726;&#1740; &#1729;&#1608; &#1587;&#1705;&#1578;&#1575; &#1729;&#1746;&#1548; &#1575;&#1608;&#1585; &#1570;&#1662; &#1578;&#1726;&#1608;&#1681;&#1740; &#1583;&#1740;&#1585; &#1576;&#1593;&#1583;&#1583;&#1608;&#1576;&#1575;&#1585;&#1729; &#1705;&#1608;&#1588;&#1588; &#1576;&#1726;&#1740; &#1705;&#1585;&#1587;&#1705;&#1578;&#1746; &#1729;&#1740;&#1722;&#1748; "</li>\n</ul>]]></string>
  <string name="error_generic_title">اف</string>
  <string name="error_generic_message">ہم کچھ وجوہات کی بنا پر یہ صفحہ لوڈ نہیں کر سکتے۔</string>
</resources>
