# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#
IncorrectKey_TryAgain? = Senha mestre incorreta. Deseja tentar novamente?
WantToCaptureForm? = Deseja lembrar os valores que preencheu?
WantToSavePasswordObscured? = O Gerenciador de Senhas pode lembrar esse logon e digit\u00e1-lo automaticamente na pr\u00f3xima vez em que retornar a este site da Web.##Deseja que o Gerenciador de Senhas se lembre deste logon?
WantToSavePasswordEncrypted? = O Gerenciador de Senhas pode lembrar esse logon e digit\u00e1-lo automaticamente na pr\u00f3xima vez em que retornar a este site da Web.##Deseja que o Gerenciador de Senhas se lembre deste logon?
xWantToSavePasswordObscured? = Deseja lembrar seu nome de usu\u00e1rio e sua senha?##Os valores armazenados n\u00e3o s\u00e3o protegidos por senha.
xWantToSavePasswordEncrypted? = Deseja lembrar seu nome de usu\u00e1rio e sua senha?##Os valores armazenados s\u00e3o protegidos por senha.
#translator's note: # in following line will be converted to linefeed by program
firstPassword = Uma senha mestre ser\u00e1 utilizada para proteger as informa\u00e7\u00f5es confidenciais de logon \u00fanico em seu disco r\u00edgido.  Vers\u00f5es futuras ir\u00e3o criptografar estes dados de maneira mais complexa para obter uma prote\u00e7\u00e3o m\u00e1xima.##Selecione uma senha mestre.#(Deixe os campos em branco se n\u00e3o desejar utiliz\u00e1-la).#
password = Digite sua senha mestre.
#translator's note: # in following line will be converted to linefeed by program
newPassword = Selecione uma nova senha mestre.#(Deixe os campos em branco se n\u00e3o desejar utiliz\u00e1-la).#
enterPassword = Digite uma senha mestre
confirmPassword = Digite a senha mestre novamente
confirmFailed_TryAgain? = As duas senhas mestres n\u00e3o s\u00e3o id\u00eanticas. Digite a mesma senha mestre em ambos os campos.
SelectUser = Selecione um nome de usu\u00e1rio para digitar neste formul\u00e1rio.
SelectUserWhosePasswordIsBeingChanged = Selecione o usu\u00e1rio cuja senha est\u00e1 sendo alterada.
PasswordNotification = Para sua conveni\u00eancia, o navegador pode lembrar-se de seus nomes de usu\u00e1rio e suas senhas, para que n\u00e3o seja necess\u00e1rio digit\u00e1-los novamente no futuro.  Suas senhas ser\u00e3o criptografadas antes de serem salvas no disco r\u00edgido. Deseja ativar este recurso?
WalletNotification = Voc\u00ea pode salvar as informa\u00e7\u00f5es que digitar em formul\u00e1rios e mais tarde pr\u00e9-preencher automaticamente outros formul\u00e1rios com essas informa\u00e7\u00f5es.  Para salvar essas informa\u00e7\u00f5es, selecione Editar/Salvar Informa\u00e7\u00f5es de Formul\u00e1rio no menu enquanto estiver visualizando o formul\u00e1rio.
noPrefills = N\u00e3o existem campos que possam ser pr\u00e9-preenchidos.
Never = Nunca para este site
Confirm = Confirmar
PromptForPassword = Senha
PromptForData = Solicitar
SaveTheseValuesObscured = Utilizar o Gerenciador de Senhas para lembrar-se destes valores.
SaveTheseValuesEncrypted = Utilizar o Gerenciador de Senhas para lembrar-se destes valores.
SaveThisValueObscured = Utilizar o Gerenciador de Senhas para lembrar-se deste valor.
SaveThisValueEncrypted = Utilizar o Gerenciador de Senhas para lembrar-se deste valor.
SaveThisPasswordObscured= Utilizar o Gerenciador de Senhas para lembrar-se desta senha.
SaveThisPasswordEncrypted = Utilizar o Gerenciador de Senhas para lembrar-se desta senha.
xSaveTheseValuesObscured = Lembrar estes valores. Os valores armazenados n\u00e3o s\u00e3o protegidos por senha.
xSaveTheseValuesEncrypted = Lembrar estes valores. Os valores armazenados s\u00e3o protegidos por senha.
xSaveThisValueObscured = Lembrar este valor. Os valores armazenados n\u00e3o s\u00e3o protegidos por senha.
xSaveThisValueEncrypted = Lembrar este valor. Os valores armazenados s\u00e3o protegidos por senha.
UserName = Nome de Usu\u00e1rio
Password = Senha
SelectUserTitleLine = Selecionar Usu\u00e1rio
NoPasswordsEverSaved = Nenhuma senha foi salva.
Captured = Os dados foram capturados.
NotCaptured = N\u00e3o h\u00e1 nada a ser capturado.
UnableToCapture = N\u00e3o foi poss\u00edvel capturar dados.
Converted = Os dados armazenados foram convertidos.
AllDataWillBeCleared = Todos os dados armazenados ser\u00e3o apagados.
NotConverted = N\u00e3o foi poss\u00edvel converter os dados armazenados.
PasswordNotChanged = N\u00e3o foi poss\u00edvel alterar a senha que protege as informa\u00e7\u00f5es confidenciais.
PasswordExpired = Suas informa\u00e7\u00f5es confidenciais foram bloqueadas.
PasswordNotExpired = N\u00e3o foi poss\u00edvel bloquear as informa\u00e7\u00f5es confidenciais.
Caveat = As op\u00e7\u00f5es Salvar Senhas e Outras Informa\u00e7\u00f5es Confidenciais##Gerenciador de Senhas e Gerenciador de Formul\u00e1rios salvam senhas, nomes de usu\u00e1rio e outras informa\u00e7\u00f5es confidenciais, e as inserem automaticamente quando necess\u00e1rio.#As informa\u00e7\u00f5es confidenciais s\u00e3o armazenadas no seu computador em um arquivo cujo acesso para leitura \u00e9 dif\u00edcil, por\u00e9m n\u00e3o imposs\u00edvel.#Se outras pessoas tiverem acesso a seu computador, voc\u00ea pode proteger as informa\u00e7\u00f5es confidenciais armazenadas com uma senha ao escolher a op\u00e7\u00e3o Senha Mestre.#Se voc\u00ea optar por proteger as informa\u00e7\u00f5es confidenciais com senha, o programa solicitar\u00e1 periodicamente que voc\u00ea forne\u00e7a sua Senha Mestre.  Essa abordagem propicia mais seguran\u00e7a, mas pode ser um pouco inconveniente.
CaveatTitle = Alerta
