# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):

malformedURI=L'adresse URL n'est pas valide et ne peut pas \u00eatre charg\u00e9e.
fileNotFound=Le fichier %s est introuvable. V\u00e9rifiez l'emplacement et r\u00e9essayez.
dnsNotFound=%s introuvable. V\u00e9rifiez le nom et recommencez.
protocolNotFound=%S n'est pas un protocole enregistr\u00e9.
connectionFailure=La connexion a \u00e9t\u00e9 refus\u00e9e lors de la tentative de contact avec %s.
netTimeout=D\u00e9lai \u00e9coul\u00e9 lors de la tentative de contact %s.
redirectLoop=La limite de redirection pour cette adresse URL a \u00e9t\u00e9 d\u00e9pass\u00e9e.  Impossible de charger la page demand\u00e9e.
repost=La page que vous essayez d'afficher contient des donn\u00e9es POSTDATA qui ont expir\u00e9 du cache. Si vous renvoyez les donn\u00e9es, toute action ex\u00e9cut\u00e9e par le formulaire (comme une recherche ou un achat en ligne) sera r\u00e9p\u00e9t\u00e9e. Si vous souhaitez renvoyer les donn\u00e9es, cliquez sur OK. Dans le cas contraire, cliquez sur Annuler.
repostConfirm=La page que vous essayez d'afficher contient des donn\u00e9es POSTDATA. Si vous renvoyez les donn\u00e9es, toute action ex\u00e9cut\u00e9e par le formulaire (comme une recherche ou un achat en ligne) sera r\u00e9p\u00e9t\u00e9e. Si vous souhaitez renvoyer les donn\u00e9es, cliquez sur OK. Dans le cas contraire, cliquez sur Annuler.
unknownSocketType=Ce document ne peut pas \u00eatre affich\u00e9 si Personal Security Manager (PSM) n'est pas install\u00e9. T\u00e9l\u00e9chargez et installez PSM et r\u00e9essayez ou contactez votre administrateur syst\u00e8me.
netReset=Le document ne contient aucune donn\u00e9e.
