#
# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
# Sean Cotter <cotter@netscape.com>
#
# Note: Hash characters in the strings will be replaced by
# newlines. These are used to lay out the dialog.

Title=Aviso de Seguran\u00e7a
MixedContentMessage=Voc\u00ea solicitou uma p\u00e1gina criptografada que cont\u00e9m algumas informa\u00e7\u00f5es n\u00e3o criptografadas. Informa\u00e7\u00f5es que voc\u00ea exibir ou digitar nesta p\u00e1gina poder\u00e3o ser lidas facilmente por terceiros.
LeaveSecureMessage=Voc\u00ea est\u00e1 prestes a deixar um p\u00e1gina criptografada. As informa\u00e7\u00f5es enviadas ou recebidas de agora em diante poder\u00e3o ser lidas facilmente por terceiros.
EnterSecureMessage=Voc\u00ea solicitou uma p\u00e1gina criptografada. O site da web identificou-se corretamente e as informa\u00e7\u00f5es exibidas ou digitadas nesta p\u00e1gina n\u00e3o podem ser lidas facilmente por terceiros.
WeakSecureMessage=Voc\u00ea solicitou uma p\u00e1gina que utiliza criptografia de baixo n\u00edvel. O site da Web identificou-se corretamente, mas as informa\u00e7\u00f5es exibidas ou digitadas nesta p\u00e1gina poder\u00e3o ser lidas por terceiros.
PostToInsecureFromSecureMessage=Embora esta p\u00e1gina seja criptografada, as informa\u00e7\u00f5es digitadas ser\u00e3o enviadas atrav\u00e9s de uma conex\u00e3o n\u00e3o criptografada, e poder\u00e3o ser lidas facilmente por terceiros.##Tem certeza de que deseja prosseguir com o envio destas informa\u00e7\u00f5es?##
PostToInsecureFromInsecureMessage=As informa\u00e7\u00f5es digitadas ser\u00e3o enviadas atrav\u00e9s de uma conex\u00e3o n\u00e3o criptografada e poder\u00e3o ser lidas facilmente por terceiros.##Tem certeza de que deseja prosseguir com o envio destas informa\u00e7\u00f5es?##
MixedContentShowAgain=Avise-me sempre que estiver prestes a exibir uma p\u00e1gina criptografada que contenha alguma informa\u00e7\u00e3o n\u00e3o criptografada.
LeaveSecureShowAgain=Avise-me sempre que eu sair de uma p\u00e1gina criptografada para uma p\u00e1gina n\u00e3o criptografada.
EnterSecureShowAgain=Avise-me sempre que estiver prestes a exibir uma p\u00e1gina criptografada.
WeakSecureShowAgain=Avise-me sempre que estiver prestes a exibir uma p\u00e1gina que utilize criptografia de baixo n\u00edvel.
PostToInsecureFromInsecureShowAgain=Avise-me sempre que eu enviar informa\u00e7\u00f5es que n\u00e3o sejam criptografadas.
SecurityButtonTooltipText=Exibir informa\u00e7\u00f5es de seguran\u00e7a sobre a p\u00e1gina atual.
Continue=Continuar
