{
    "app": {
        "status": {
            "installing": "Instalando em segundo plano...",
            "installComplete": "Instalação concluída"
        },
        "installer": {
            "title": "Instalador do Floorp",
            "description": "Instale o navegador Floorp e comece uma experiência de navegação focada na privacidade, rápida e personalizável.",
            "adminRights": "Instalar com permissões de administrador",
            "adminRightsEnabled": "Instalar para todos os usuários com permissões de administrador.",
            "adminRightsDisabled": "Instalar apenas para o usuário atual.",
            "customPathRequired": "O caminho de instalação personalizado requer permissões de administrador.",
            "installLocation": "Local de instalação",
            "change": "Alterar",
            "installButton": "Iniciar a instalação",
            "retryButton": "Repetir"
        },
        "progress": {
            "installing": "Instalando...",
            "slideCounter": "Etapa {{current}}/{{total}}"
        },
        "modal": {
            "selectLocation": "Selecione o local de instalação",
            "installPath": "Caminho de instalação",
            "browse": "Explorar",
            "resetDefault": "Redefinir para o padrão",
            "cancel": "Cancelar",
            "save": "Salvar configurações",
            "close": "Fechar"
        },
        "exitConfirmation": {
            "title": "Cancelar instalação?",
            "message": "Cancelar o processo de instalação evita que o Floorp seja instalado.",
            "cancelButton": "Cancelar",
            "confirmButton": "Cancelar instalação"
        },
        "complete": {
            "success": "Instalação concluída",
            "error": "Falha na instalação",
            "launchCheckbox": "Iniciar o navegador Floorp após a instalação",
            "closeButton": "Fechar instalador",
            "countdownMessage": "O instalador será fechado em {{count}} segundos",
            "legacyDownloadMessage": "Você também pode experimentar a versão clássica do instalador.",
            "legacyDownloadButton": "Fazer download"
        }
    },
    "slides": {
        "slide1": {
            "title": "Bem-vindo(a) ao Floorp",
            "description": "Bem-vindo(a) à versão mais recente do Floorp, um navegador da web desenvolvido no Japão com foco em desenvolvimento e pesquisa. O conteúdo apresentado a seguir é apenas uma parte do projeto."
        },
        "slide2": {
            "title": "Atualizações frequentes",
            "description": "O Floorp é mantido e atualizado continuamente, mesmo sendo um projeto comunitário. Oferecemos uma navegação segura alinhada com o princípio de que a web deve ser livremente acessível a todos."
        },
        "slide3": {
            "title": "Recursos mais recentes",
            "description": "A versão mais recente do Floorp aproveita os recursos de ponta da Web desenvolvidos pelo Firefox, da Mozilla. Ela também foi redesenhada para tornar as ferramentas que todos desejam facilmente acessíveis."
        },
        "slide4": {
            "title": "Personalização avançada",
            "description": "Equipado com várias opções de personalização para manter a privacidade melhor do que seu navegador padrão. O Floorp permite que você defina sua configuração preferida."
        },
        "slide5": {
            "title": "Lutando por você",
            "description": "Floorp bloqueia o rastreamento nocivo. Nós equilibramos o bom funcionamento dos sites com os direitos do usuário, trabalhando para melhorar a web, tanto na funcionalidade quanto na privacidade."
        }
    },
    "rust": {
        "success": {
            "downloaded_dev_mode": "Download do instalador do Floorp (modo em desenvolvimento) feito",
            "installation_complete": "Instalação do Floorp concluída com sucesso."
        },
        "errors": {
            "installer_not_found": "Falha ao recuperar o instalador do Floorp.",
            "download_failed": "Um erro ocorreu durante o download: {{0}}",
            "signature_verification_failed": "Falha na verificação da assinatura do instalador. A execução foi interrompida por motivos de segurança.",
            "signature_verification_error": "Ocorreu um erro durante a verificação da assinatura: {{0}}",
            "installer_exit_code": "O instalador foi encerrado com o código {{0}}.",
            "installer_execution": "Um erro ocorreu durante a execução do instalador: {{0}}",
            "browser_not_found": "O navegador Floorp não foi encontrado. A instalação foi bem-sucedida, mas não foi possível encontrar o arquivo executável do navegador.",
            "browser_launch_failed": "Falha ao iniciar o navegador: {{0}}",
            "file_not_found": "Arquivo não encontrado: {{0}}",
            "not_a_file": "O caminho não é um arquivo: {{0}}",
            "admin_rights_denied": "As permissões de administrador foram negadas. Você selecionou o modo administrador, mas a permissão foi negada.",
            "exit_code_not_found": "Não foi possível obter o código de saída do instalador. As permissões de administrador podem ter sido negadas.",
            "powershell_script_creation": "Falha ao criar o script do PowerShell: {{0}}",
            "powershell_process": "Falha ao iniciar o processo do PowerShell: {{0}}",
            "admin_install_failed": "Falha na instalação com permissões de administrador. Código de saída: {{0}}",
            "user_installer_launch": "Falha ao iniciar o processo de instalação com permissões de usuário: {{0}}",
            "user_installer_execution": "Ocorreu um problema ao executar o instalador com permissões de usuário: {{0}}",
            "cpu_not_supported": "A CPU deste dispositivo não é compatível com SSE4.1. O Floorp requer um processador com suporte a SSE4.1.",
            "cpu_check_failed": "Falha ao verificar os requisitos da CPU. Verifique os requisitos do sistema."
        }
    }
}