#
# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
# Sean Cotter <cotter@netscape.com>
#
# Note: Hash characters in the strings will be replaced by
# newlines. These are used to lay out the dialog.

Title=Sicherheitswarnung
MixedContentMessage=Sie haben eine verschl\u00fcsselte Seite angefordert, die einige unverschl\u00fcsselte Informationen enth\u00e4lt. Informationen, die Sie auf dieser Seite einsehen oder eingeben, k\u00f6nnen von Dritten gelesen werden.
LeaveSecureMessage=Sie sind im Begriff, eine verschl\u00fcsselte Seite zu verlassen. Informationen, die Sie ab jetzt senden oder empfangen k\u00f6nnen von Dritten gelesen werden.
EnterSecureMessage=Sie haben eine verschl\u00fcsselte Seite angefordert. Die Web-Site hat sich korrekt identifiziert und die Informationen, die Sie auf dieser Seite einsehen oder eingeben, k\u00f6nnen nicht ohne Weiteres von Dritten gelesen werden.
WeakSecureMessage=Sie haben eine Seite angefordert, die einen niedrigen Verschl\u00fcsselungsgrad benutzt. Die Web-Site hat sich korrekt identifiziert, doch die Informationen, die Sie auf dieser Seite einsehen oder eingeben, k\u00f6nnen m\u00f6glicherweise von Dritten gelesen werden.
PostToInsecureFromSecureMessage=Diese Seite ist zwar verschl\u00fcsselt, die eingegebenen Informationen werden jedoch \u00fcber eine unverschl\u00fcsselte Verbindung gesendet und k\u00f6nnen von Dritten gelesen werden.##M\u00f6chten Sie diese Informationen wirklich senden?##
PostToInsecureFromInsecureMessage=Die von Ihnen eingegebenen Informationen werden \u00fcber eine unverschl\u00fcsselte Verbindung gesendet und k\u00f6nnen von Dritten gelesen werden.##M\u00f6chten Sie die Informationen wirklich senden?##
MixedContentShowAgain=Benachrichtigen, wenn ich eine verschl\u00fcsselte Seite aufrufe, die einige unverschl\u00fcsselte Informationen enth\u00e4lt.
LeaveSecureShowAgain=Benachrichtigen, wenn ich eine verschl\u00fcsselte Seite verlasse, um eine Unverschl\u00fcsselte aufzurufen.
EnterSecureShowAgain=Benachrichtigen, wenn ich eine verschl\u00fcsselte Seite aufrufe.
WeakSecureShowAgain=Benachrichtigen, wenn ich eine Seite mit niedrigem Verschl\u00fcsselungsgrad aufrufe.
PostToInsecureFromInsecureShowAgain=Benachrichtigen, wenn ich Informationen sende, die nicht verschl\u00fcsselt werden.
SecurityButtonTooltipText=Zeigt Sicherheitsinformationen \u00fcber die aktuelle Seite an.
Continue=Weiter
