#
# The contents of this file are subject to the Mozilla Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#

SignedBy=Assinado por %S
CertPassPrompt=Digite a Senha de Seguran\u00e7a Pessoal para o dispositivo de seguran\u00e7a PSM Private Keys.

#These are for dialogs
#Download Cert dialog
newCAMessage1=Deseja confiar em "%S" com os objetivos a seguir?
unnamedCA=Autoridade de Certifica\u00e7\u00e3o (n\u00e3o nomeada)

#For editing cert trust
editTrustWindowTitle=Editar confian\u00e7a do certificado
editTrustCA=O certificado "%S" representa uma Autoridade de Certifica\u00e7\u00e3o.
editTrustSSL=O certificado "%S" foi emitido por:
issuerNotTrusted=Como voc\u00ea n\u00e3o confia na autoridade de certifica\u00e7\u00e3o que emitiu este certificado, voc\u00ea n\u00e3o confia na autenticidade deste certificado a n\u00e3o ser que indicado o contr\u00e1rio aqui.
issuerTrusted=Como voc\u00ea confia a autoridade de certifica\u00e7\u00e3o que emitiu este certificado, voc\u00ea confia na autenticidade deste certificado, a n\u00e3o ser que indicado o contr\u00e1rio aqui.
issuerNotKnown=Como voc\u00ea n\u00e3o conhece a autoridade de certifica\u00e7\u00e3o que emitiu este certificado, voc\u00ea n\u00e3o confia na autenticidade deste certificado a n\u00e3o ser que indicado o contr\u00e1rio aqui.
issuerCertNotFound=O certificado desta autoridade de certifica\u00e7\u00e3o n\u00e3o foi encontrado

#For Deleting Certificates
deleteSslCertFlag=deleteSslFlag
deleteSslCertConfirm=Tem certeza que deseja excluir este certificados de site da web?
deleteSslCertImpact=Se voc\u00ea excluir um certificado de site da Web, ser\u00e1 solicitado que voc\u00ea o aceite novamente da pr\u00f3xima vez que visitar este site da Web.
deleteSslCertTitle=Excluir Certificados de Site da Web

deleteUserCertFlag=deleteUserFlag
deleteUserCertConfirm=Tem certeza que deseja excluir estes certificados?
deleteUserCertImpact=Se voc\u00ea excluir um de seus pr\u00f3prios certificados, voc\u00ea n\u00e3o poder\u00e1 mais utiliz\u00e1-lo para se identificar.
deleteUserCertTitle=Excluir Seus Certificados

deleteCaCertFlag=deleteCaFlag
deleteCaCertConfirm=Tem certeza que deseja excluir esses certificados de CA?
deleteCaCertImpact=Se voc\u00ea excluir seu certificado de CA (autoridade de certifica\u00e7\u00e3o), seu navegador n\u00e3o ir\u00e1 mais confiar em certificados emitidos por essa CA.
deleteCaCertTitle=Excluir Certificados de CA

deleteEmailCertFlag=deleteEmailFlag
deleteEmailCertConfirm=Tem certeza de que deseja excluir os certificados de e-mail dessas pessoas?
deleteEmailCertImpact=Se voc\u00ea excluir um certificado de e-mail, n\u00e3o poder\u00e1 mais enviar e-mail criptografado para essas pessoas.
deleteEmailCertTitle=Excluir Certificados de E-mail


#PKCS#12 file dialogs
chooseP12RestoreFileDialog=Nome do Arquivo a Ser Restaurado
chooseP12BackupFileDialog=Nome do Arquivo para Backup

#Mismatch Domain Dialg
mismatchDomainMsg1=Voc\u00ea tentou estabelecer uma conex\u00e3o com "%S". Entretanto, o certificado de seguran\u00e7a apresentado pertence a "%S".  \u00c9 poss\u00edvel, apesar de improv\u00e1vel, que algu\u00e9m possa tentar interceptar sua comunica\u00e7\u00e3o com este site da Web.
mismatchDomainMsg2=Se achar que o certificado mostrado n\u00e3o pertence a "%S", cancele a conex\u00e3o e notifique o administrador do site.

#Server Cert expired
serverCertExpiredMsg1="%S" \u00e9 um site que utiliza um certificado de seguran\u00e7a para criptografar dados durante a transmiss\u00e3o, mas seu certificado expirou em %S.
serverCertExpiredTitle=O Certificado do Servidor Expirou
serverCertNotYetValedMsg1="%S" \u00e9 um site que utiliza um certificado de seguran\u00e7a para criptografar dados durante a transmiss\u00e3o, mas seu certificado n\u00e3o estar\u00e1 v\u00e1lido at\u00e9 %S.
serverCertNotYetValidTitle=Certificado do Servidor ainda n\u00e3o \u00e9 v\u00e1lido
serverCertExpiredMsg2=Certifique-se de que a hora do computador (atualmente definida como %S) esteja correta.

#Preferences
resetPreferences=Utilize este bot\u00e3o para redefinir as prefer\u00eancias de seguran\u00e7a de %S com as defini\u00e7\u00f5es de f\u00e1brica.

#Cert verification
certVerified=Este certificado foi verificado para as seguintes utiliza\u00e7\u00f5es:
certNotVerified_CertRevoked=N\u00e3o foi poss\u00edvel verificar este certificado porque ele foi revogado.
certNotVerified_CertExpired=N\u00e3o foi poss\u00edvel verificar este certificado porque ele expirou.
certNotVerified_CertNotTrusted=N\u00e3o foi poss\u00edvel verificar este certificado porque ele n\u00e3o \u00e9 confi\u00e1vel.
certNotVerified_IssuerNotTrusted=N\u00e3o foi poss\u00edvel verificar este certificado porque o remetente n\u00e3o \u00e9 confi\u00e1vel.
certNotVerified_IssuerUnknown=N\u00e3o foi poss\u00edvel verificar este certificado porque o remetente \u00e9 desconhecido.
certNotVerified_CAInvalid=N\u00e3o foi poss\u00edvel verificar este certificado porque o certificado de CA \u00e9 inv\u00e1lido.
certNotVerified_Unknown=N\u00e3o foi poss\u00edvel verificar este certificado por motivos desconhecidos.

#Client auth
clientAuthMessage1=Organiza\u00e7\u00e3o: "%S"
clientAuthMessage2=Emitido em: "%S"

#Page Info
pageInfo_SiteNotVerified=Identidade do Site da Web N\u00e3o Verificada
pageInfo_WebSiteVerified=Identidade do Site da Web Verificada
pageInfo_Identity_Verified=O site da Web %S suporta autentica\u00e7\u00e3o para a p\u00e1gina que est\u00e1 sendo exibida. A identidade deste site da Web foi verificada por %S, uma autoridade de certifica\u00e7\u00e3o que voc\u00ea confia para este objetivo.
pageInfo_ViewCertificate=Exibir o certificado de seguran\u00e7a que verifica a identidade deste site da Web.
pageInfo_NoEncryption=Conex\u00e3o N\u00e3o Criptografada
pageInfo_Privacy_None1=O site da Web %S n\u00e3o suporta criptografia para a p\u00e1gina que est\u00e1 sendo exibida.
pageInfo_Privacy_None2=As informa\u00e7\u00f5es enviadas pela Internet sem criptografia podem ser vistas por outras pessoas enquanto est\u00e3o em tr\u00e2nsito.
pageInfo_Privacy_None3=A p\u00e1gina exibida n\u00e3o est\u00e1 criptografada.
pageInfo_StrongEncryption=Conex\u00e3o Criptografada: Criptografia de Alto N\u00edvel (%S %S bits)
pageInfo_Privacy_Strong1=A p\u00e1gina que est\u00e1 sendo exibida foi criptografada antes de ser transmitida pela Internet.
pageInfo_Privacy_Strong2=A criptografia torna muito dif\u00edcil para pessoas n\u00e3o autorizadas verem informa\u00e7\u00f5es transmitidas entre computadores. Portanto, \u00e9 muito improv\u00e1vel que algu\u00e9m leia esta p\u00e1gina conforme ela \u00e9 transmitida pela rede.
pageInfo_WeakEncryption=Conex\u00e3o Criptografada: Criptografia de Baixo N\u00edvel (%S %S bits)
pageInfo_Privacy_Weak1=O site da Web %S est\u00e1 usando criptografia de baixo n\u00edvel para a p\u00e1gina que est\u00e1 sendo exibida.
pageInfo_Privacy_Weak2=A criptografia de baixo n\u00edvel pode permitir que pessoas n\u00e3o autorizadas vejam estas informa\u00e7\u00f5es.

#Cert Viewer
certDetails=Visualizador de Certificado:
notPresent=<N\u00e3o \u00e9 Parte do Certificado>
unknownIssuer=< Remetente Desconhecido >

escrowFinalMessage=Voc\u00ea deve clicar em OK somente se confiar em "%S" para proteger sua chave privada de criptografia.

#Token Manager
password_not_set=(n\u00e3o definida)
failed_pw_change=N\u00e3o foi poss\u00edvel alterar Senha Mestre.
incorrect_pw=Voc\u00ea n\u00e3o digitou a Senha Mestre atual correta. Tente novamente.
pw_change_ok=Senha Mestre alterada com sucesso.
pw_erased_ok=Aviso! Voc\u00ea excluiu sua Senha Mestre.
pw_not_wanted=Aviso! Voc\u00ea decidiu n\u00e3o utilizar uma Senha Mestre.
pw_empty_warning=Suas senhas da web e de email, dados de formul\u00e1rios e chaves privadas armazenadas n\u00e3o estar\u00e3o protegidas.
login_failed=Falha no Login
loadPK11TokenDialog=Escolha um dispositivo PKCS#11 para carregar
devinfo_modname=M\u00f3dulo
devinfo_modpath=Caminho
devinfo_label=R\u00f3tulo
devinfo_manID=Fabricante
devinfo_serialnum=N\u00famero de S\u00e9rie
devinfo_hwversion=Vers\u00e3o de HW
devinfo_fwversion=Vers\u00e3o de FW
devinfo_status=Status
devinfo_desc=Descri\u00e7\u00e3o
devinfo_stat_disabled=Desativado
devinfo_stat_notpresent=Ausente
devinfo_stat_uninitialized=N\u00e3o inicializado
devinfo_stat_notloggedin=Sem Sess\u00e3o Iniciada
devinfo_stat_loggedin=Com Sess\u00e3o Iniciada
devinfo_stat_ready=Pronto
enable_fips=Ativar FIPS
disable_fips=Desativar FIPS

#device manager: load device dlg
device.loaddlg.width=350
device.loaddlg.height=150

certmgr.verified=Verificado
certmgr.verifiedNoOCSP=Verificado (Sem OCSP)

# CRL next update.
crlNextUpdateMsg1=%S n\u00e3o consegue estabelecer uma conex\u00e3o criptografada com "%S".
crlNextUpdateMsg2=A CRL (lista de revoga\u00e7\u00e3o de certificados) de "%S" precisa ser atualizada.
NoUpdateFailure=Nenhum
lastFetchUrlLabel=URL obtida originalmente em
advertisedUrlLabel=URL anunciada pela CA
CrlUpdatePrefsSetConfirmation = As prefer\u00eancias de atualiza\u00e7\u00e3o autom\u00e1tica ter\u00e3o efeito quando voc\u00ea reiniciar o navegador.
crlAutoUpdateDayCntError=O n\u00famero de dias antes da pr\u00f3xima atualiza\u00e7\u00e3o deve ser maior do que zero.
crlAutoUpdtaeFreqCntError=A freq\u00fc\u00eancia de atualiza\u00e7\u00e3o deve ser um n\u00famero maior do que zero.
disabledStatement=A Atualiza\u00e7\u00e3o Autom\u00e1tica desta CRL n\u00e3o est\u00e1 ativada.
enabledStatement=A Atualiza\u00e7\u00e3o Autom\u00e1tica desta CRL est\u00e1 ativada.
crlAutoupdateQuestion1=Deseja ativar a atualiza\u00e7\u00e3o autom\u00e1tica?
crlAutoupdateQuestion2=Deseja exibir as defini\u00e7\u00f5es de atualiza\u00e7\u00e3o autom\u00e1tica?
undefinedValStr=<Sem Defini\u00e7\u00e3o>
undefinedURL=A URL para atualiza\u00e7\u00e3o autom\u00e1tica n\u00e3o foi definida.
yesButton=Sim
noButton=N\u00e3o
resetPasswordButtonLabel=Redefinir
resetPasswordConfirmationTitle=Redefinir Senha Mestre
resetPasswordConfirmationMessage=Sua senha foi redefinida.
crlAutoupdateEnabled=Ativado
crlAutoupdateNotEnabled=Inativo
crlAutoupdateOk=OK
crlAutoupdateFailed=Falha
