# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#
IncorrectKey_TryAgain? = \u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e0d\u6b63\u3067\u3059\u3002\u3084\u308a\u76f4\u3057\u307e\u3059\u304b?
WantToCaptureForm? = \u8a18\u5165\u3057\u305f\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f
WantToSavePasswordObscured? = \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u306f\u3053\u306e\u30ed\u30b0\u30aa\u30f3\u3092\u8a18\u61b6\u3057\u3066\u304a\u304d\u3001\u6b21\u306b\u3053\u306e Web \u30b5\u30a4\u30c8\u3078\u623b\u3063\u305f\u969b\u306b\u81ea\u52d5\u7684\u306b\u5165\u529b\u3057\u307e\u3059\u3002##\u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u306b\u3053\u306e\u30ed\u30b0\u30aa\u30f3\u3092\u8a18\u61b6\u3055\u305b\u307e\u3059\u304b\uff1f
WantToSavePasswordEncrypted? = \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u306f\u3053\u306e\u30ed\u30b0\u30aa\u30f3\u3092\u8a18\u61b6\u3057\u3066\u304a\u304d\u3001\u6b21\u306b\u3053\u306e Web \u30b5\u30a4\u30c8\u3078\u623b\u3063\u305f\u969b\u306b\u81ea\u52d5\u7684\u306b\u5165\u529b\u3057\u307e\u3059\u3002##\u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u306b\u3053\u306e\u30ed\u30b0\u30aa\u30f3\u3092\u8a18\u61b6\u3055\u305b\u307e\u3059\u304b\uff1f
xWantToSavePasswordObscured? = \u30e6\u30fc\u30b6\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f##\u4fdd\u5b58\u3055\u308c\u305f\u5024\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u3088\u308a\u4fdd\u8b77\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
xWantToSavePasswordEncrypted? = \u30e6\u30fc\u30b6\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f##\u4fdd\u5b58\u3055\u308c\u305f\u5024\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u3088\u308a\u4fdd\u8b77\u3055\u308c\u3066\u3044\u307e\u3059\u3002
#translator's note: # in following line will be converted to linefeed by program
firstPassword = \u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u3001\u30cf\u30fc\u30c9\u30a6\u30a7\u30a2 \u30c9\u30e9\u30a4\u30d6\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5358\u4e00\u30b5\u30a4\u30f3\u30aa\u30f3\u6a5f\u5bc6\u60c5\u5831\u306e\u4fdd\u8b77\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002\u5c06\u6765\u306e\u30ea\u30ea\u30fc\u30b9\u3067\u306f\u3001\u4fdd\u8b77\u3092\u6700\u5927\u306b\u3059\u308b\u305f\u3081\u306b\u3001\u3053\u306e\u30c7\u30fc\u30bf\u306b\u306f\u5f37\u529b\u306a\u6697\u53f7\u5316\u304c\u65bd\u3055\u308c\u307e\u3059\u3002##\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002#\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4f7f\u7528\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u7a7a\u767d\u306e\u307e\u307e\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002#
password = \u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b:
#translator's note: # in following line will be converted to linefeed by program
newPassword = \u65b0\u3057\u3044\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002#\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4f7f\u7528\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u7a7a\u767d\u306e\u307e\u307e\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002#
enterPassword = \u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b:
confirmPassword = \u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u518d\u5165\u529b:
confirmFailed_TryAgain? = \u53cc\u65b9\u306e\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u4e21\u65b9\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u540c\u3058\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SelectUser = \u3053\u306e\u30d5\u30a9\u30fc\u30e0\u306b\u5165\u529b\u3059\u308b\u30e6\u30fc\u30b6\u540d\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SelectUserWhosePasswordIsBeingChanged = \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3057\u305f\u30e6\u30fc\u30b6\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PasswordNotification = \u30d6\u30e9\u30a6\u30b6\u3067\u306f\u30e6\u30fc\u30b6\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4fdd\u5b58\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u3063\u3066\u3001\u4eca\u5f8c\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3073\u306b\u30e6\u30fc\u30b6\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3059\u308b\u5fc5\u8981\u304c\u306a\u304f\u306a\u308a\u307e\u3059\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u89e3\u8aad\u4e0d\u80fd\u306b\u3057\u3066\u30cf\u30fc\u30c9 \u30c9\u30e9\u30a4\u30d6\u306b\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u6a5f\u80fd\u3092\u30aa\u30f3\u306b\u3057\u307e\u3059\u304b\uff1f
WalletNotification = \u30d5\u30a9\u30fc\u30e0\u306b\u5165\u529b\u3059\u308b\u60c5\u5831\u3092\u4fdd\u5b58\u3057\u3066\u3001\u5f8c\u3067\u305d\u306e\u60c5\u5831\u3092\u5225\u306e\u30d5\u30a9\u30fc\u30e0\u306b\u81ea\u52d5\u7684\u306b\u8a18\u5165\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u305d\u306e\u3088\u3046\u306a\u60c5\u5831\u3092\u4fdd\u5b58\u3059\u308b\u306b\u306f\u3001\u30d5\u30a9\u30fc\u30e0\u306e\u8868\u793a\u4e2d\u306b\uff3b\u30bf\u30b9\u30af\uff3d-\uff3bWallet\uff3d-\uff3b\u53d6\u308a\u8fbc\u307f\uff3d\u3092\u9078\u629e\u3057\u307e\u3059\u3002
noPrefills = \u524d\u3082\u3063\u3066\u8a18\u5165\u3067\u304d\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
Never = \u3053\u306e\u30b5\u30a4\u30c8\u3067\u306f\u5e38\u306b\u30aa\u30d5\u306b\u3059\u308b
Confirm = \u78ba\u8a8d\u3059\u308b
PromptForPassword = \u30d1\u30b9\u30ef\u30fc\u30c9
PromptForData = \u30d7\u30ed\u30f3\u30d7\u30c8
SaveTheseValuesObscured = \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u3092\u4f7f\u3063\u3066\u3053\u308c\u3089\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002
SaveTheseValuesEncrypted = \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u3092\u4f7f\u3063\u3066\u3053\u308c\u3089\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002
SaveThisValueObscured = \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u3092\u4f7f\u3063\u3066\u3053\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002
SaveThisValueEncrypted = \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u3092\u4f7f\u3063\u3066\u3053\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002
SaveThisPasswordObscured= \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u306b\u3053\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8a18\u61b6\u3055\u305b\u307e\u3059\u3002
SaveThisPasswordEncrypted = \u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u306b\u3053\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8a18\u61b6\u3055\u305b\u307e\u3059\u3002
xSaveTheseValuesObscured = \u3053\u308c\u3089\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002\u4fdd\u5b58\u3055\u308c\u305f\u5024\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u4fdd\u8b77\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
xSaveTheseValuesEncrypted = \u3053\u308c\u3089\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002\u4fdd\u5b58\u3055\u308c\u305f\u5024\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u4fdd\u8b77\u3055\u308c\u3066\u3044\u307e\u3059\u3002
xSaveThisValueObscured = \u3053\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002\u4fdd\u5b58\u3055\u308c\u305f\u5024\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u4fdd\u8b77\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
xSaveThisValueEncrypted = \u3053\u306e\u5024\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002\u4fdd\u5b58\u3055\u308c\u305f\u5024\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u4fdd\u8b77\u3055\u308c\u3066\u3044\u307e\u3059\u3002
UserName = \u30e6\u30fc\u30b6\u540d
Password = \u30d1\u30b9\u30ef\u30fc\u30c9
SelectUserTitleLine = \u30e6\u30fc\u30b6\u3092\u9078\u629e
NoPasswordsEverSaved = \u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u4fdd\u5b58\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
Captured = \u30c7\u30fc\u30bf\u3092\u53d6\u308a\u8fbc\u307f\u307e\u3057\u305f\u3002
NotCaptured = \u53d6\u308a\u8fbc\u3080\u5bfe\u8c61\u304c\u3042\u308a\u307e\u305b\u3093\u3002
UnableToCapture = \u30c7\u30fc\u30bf\u3092\u53d6\u308a\u8fbc\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
Converted = \u4fdd\u5b58\u3055\u308c\u305f\u30c7\u30fc\u30bf\u304c\u5909\u63db\u3055\u308c\u307e\u3057\u305f\u3002
AllDataWillBeCleared = \u4fdd\u5b58\u3055\u308c\u305f\u30c7\u30fc\u30bf\u306f\u3059\u3079\u3066\u6d88\u53bb\u3055\u308c\u307e\u3059\u3002
NotConverted = \u4fdd\u5b58\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3092\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002
PasswordNotChanged = \u6a5f\u5bc6\u60c5\u5831\u3092\u4fdd\u8b77\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
PasswordExpired = \u6a5f\u5bc6\u60c5\u5831\u306f\u73fe\u5728\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
PasswordNotExpired = \u6a5f\u5bc6\u60c5\u5831\u3092\u30ed\u30c3\u30af\u3067\u304d\u307e\u305b\u3093\u3002
Caveat = \u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u305d\u306e\u4ed6\u306e\u6a5f\u5bc6\u60c5\u5831\u3092\u4fdd\u5b58##\u30d1\u30b9\u30ef\u30fc\u30c9 \u30de\u30cd\u30fc\u30b8\u30e3\u3068\u30d5\u30a9\u30fc\u30e0 \u30de\u30cd\u30fc\u30b8\u30e3\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3001\u30e6\u30fc\u30b6\u540d\u3001\u304a\u3088\u3073\u305d\u306e\u4ed6\u306e\u6a5f\u5bc6\u60c5\u5831\u3092\u4fdd\u5b58\u3057\u3001\u5fc5\u8981\u306b\u5fdc\u3058\u3066\u81ea\u52d5\u7684\u306b\u305d\u308c\u3089\u306e\u60c5\u5831\u3092\u5165\u529b\u3057\u307e\u3059\u3002#\u3053\u306e\u6a5f\u5bc6\u60c5\u5831\u306f\u3001\u30b3\u30f3\u30d4\u30e5\u30fc\u30bf\u4e0a\u306e\u30d5\u30a1\u30a4\u30eb\u306b\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u53d6\u308a\u306f\u4e0d\u53ef\u80fd\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u56f0\u96e3\u3067\u3059\u3002#\u4ed6\u306e\u4eba\u304c\u30b3\u30f3\u30d4\u30e5\u30fc\u30bf\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u5834\u5408\u306f\u3001\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u9078\u629e\u3057\u3066\u4fdd\u5b58\u3055\u308c\u305f\u6a5f\u5bc6\u60c5\u5831\u3092\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u4fdd\u8b77\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002#\u4fdd\u5b58\u3055\u308c\u305f\u60c5\u5831\u3092\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u4fdd\u8b77\u3059\u308b\u5834\u5408\u306f\u3001\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u63d0\u4f9b\u3059\u308b\u3088\u3046\u306b\u6c42\u3081\u3089\u308c\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u30a2\u30d7\u30ed\u30fc\u30c1\u306b\u3088\u3063\u3066\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u306f\u9ad8\u307e\u308a\u307e\u3059\u304c\u3001\u591a\u5c11\u4e0d\u4fbf\u306b\u306a\u308a\u307e\u3059\u3002
CaveatTitle =\u8b66\u544a
