# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#
IncorrectKey_TryAgain?= Mot de passe principal incorrect. Voulez-vous recommencer ?
WantToCaptureForm?= Voulez-vous enregistrer les valeurs de ce formulaire dans votre calepin ?
WantToSavePasswordObscured?=Le Gestionnaire de mots de passe peut se rappeler ces informations de connexion et les entrer automatiquement la prochaine fois que vous reviendrez \u00e0 ce site.##Voulez-vous les m\u00e9moriser ?
WantToSavePasswordEncrypted?=Le Gestionnaire de mots de passe peut se rappeler ces informations de connexion et les entrer automatiquement la prochaine fois que vous reviendrez \u00e0 ce site.##Voulez-vous les m\u00e9moriser ?
xWantToSavePasswordObscured?= Voulez-vous m\u00e9moriser votre nom d'utilisateur et votre mot de passe ?##Les valeurs m\u00e9moris\u00e9es ne sont pas prot\u00e9g\u00e9es par mot de passe.
xWantToSavePasswordEncrypted?= Voulez-vous m\u00e9moriser votre nom d'utilisateur et votre mot de passe ?##Les valeurs m\u00e9moris\u00e9es sont prot\u00e9g\u00e9es par mot de passe.
#translator's note: # in following line will be converted to linefeed by program
firstPassword= Un mot de passe principal sera utilis\u00e9 pour prot\u00e9ger les informations de connexion sensibles stock\u00e9es sur le disque dur.  Dans les prochaines versions, ces donn\u00e9es seront fortement chiffr\u00e9es pour assurer une protection maximale.##S\u00e9lectionnez un mot de passe principal.#(Laissez les champs en blanc si vous ne souhaitez pas utiliser un mot de passe principal).#
password= Entrez votre mot de passe principal.
#translator's note: # in following line will be converted to linefeed by program
newPassword= S\u00e9lectionnez un nouveau mot de passe principal.#(Laissez les champs en blanc si vous ne voulez pas utiliser un mot de passe principal).#
enterPassword= Entrez un mot de passe principal
confirmPassword= Retapez le mot de passe principal
confirmFailed_TryAgain?= Les deux mots de passe principaux n'\u00e9taient pas identiques.  Entrez le m\u00eame mot de passe dans les deux champs.
SelectUser= S\u00e9lectionnez un nom d'utilisateur \u00e0 introduire dans ce formulaire.
SelectUserWhosePasswordIsBeingChanged= S\u00e9lectionnez l'utilisateur dont le mot de passe est modifi\u00e9.
PasswordNotification= Pour votre facilit\u00e9, le navigator peut m\u00e9moriser vos noms d'utilisateur et mots de passe pour vous \u00e9viter de les retaper par la suite.  Vos mots de passe seront chiffr\u00e9s avant d'\u00eatre enregistr\u00e9s sur votre disque dur.  Voulez-vous activer cette fonction ?
WalletNotification= Vous pouvez enregistrer les informations que vous entrez sur les formulaires et pr\u00e9-remplir automatiquement ces informations sur d'autres formulaires.  Pour enregistrer ces informations, s\u00e9lectionnez Enregistrer les infos des formulaires/Modifier les infos du formulaire dans le menu tout en affichant le formulaire.
noPrefills= Il n'y a pas de champs \u00e0 pr\u00e9-remplir.
Never= Jamais pour ce site
Confirm= Confirmer
PromptForPassword= Mot de passe
PromptForData= Nom d'utilisateur
SaveTheseValuesObscured= Utiliser le Gestionnaire de mots de passe pour m\u00e9moriser ces valeurs.
SaveTheseValuesEncrypted= Utiliser le Gestionnaire de mots de passe pour m\u00e9moriser ces valeurs.
SaveThisValueObscured= Utiliser le Gestionnaire de mots de passe pour m\u00e9moriser cette valeur.
SaveThisValueEncrypted= Utiliser le Gestionnaire de mots de passe pour m\u00e9moriser cette valeur.
SaveThisPasswordObscured=Utiliser le Gestionnaire de mots de passe pour m\u00e9moriser ces mots de passe.
SaveThisPasswordEncrypted=Utiliser le Gestionnaire de mots de passe pour m\u00e9moriser ces mots de passe.
xSaveTheseValuesObscured= M\u00e9moriser ces valeurs.  Les valeurs m\u00e9moris\u00e9es ne sont pas prot\u00e9g\u00e9es par mot de passe.
xSaveTheseValuesEncrypted= M\u00e9moriser ces valeurs.  Les valeurs m\u00e9moris\u00e9es sont prot\u00e9g\u00e9es par mot de passe.
xSaveThisValueObscured= M\u00e9moriser cette valeur.  Les valeurs m\u00e9moris\u00e9es ne sont pas prot\u00e9g\u00e9es par mot de passe.
xSaveThisValueEncrypted= M\u00e9moriser cette valeur.  Les valeurs m\u00e9moris\u00e9es sont prot\u00e9g\u00e9es par mot de passe.
UserName= Nom d'utilisateur
Password= Mot de passe
SelectUserTitleLine= S\u00e9lectionner un utilisateur
NoPasswordsEverSaved= Aucun mot de passe n'a jamais \u00e9t\u00e9 enregistr\u00e9.
Captured= Les donn\u00e9es ont \u00e9t\u00e9 saisies.
NotCaptured= Il n'y a rien \u00e0 saisir.
UnableToCapture= Impossible de saisir des donn\u00e9es.
Converted= Les donn\u00e9es m\u00e9moris\u00e9es ont \u00e9t\u00e9 converties.
AllDataWillBeCleared= Toutes les donn\u00e9es m\u00e9moris\u00e9es seront effac\u00e9es.
NotConverted= Impossible de convertir les donn\u00e9es m\u00e9moris\u00e9es.
PasswordNotChanged= Impossible de modifier le mot de passe qui prot\u00e8ge vos donn\u00e9es sensibles.
PasswordExpired= Vos donn\u00e9es sensibles sont maintenant verrouill\u00e9es.
PasswordNotExpired= Impossible de verrouiller vos donn\u00e9es sensibles.
Caveat= Enregistrement de mots de passe et d'autres informations confidentielles##Le Gestionnaire de mots de passe et le Gestionnaire de formulaires enregistreront les mots de passe, noms d'utilisateurs et autres informations confidentielles et les introduiront automatiquement lorsqu'elles seront n\u00e9cessaires.#Ces informations confidentielles sont stock\u00e9es sur votre ordinateur dans un fichier qui est difficile, mais pas impossible, \u00e0 lire.#Si d'autres personnes ont acc\u00e8s \u00e0 votre ordinateur, vous souhaiterez peut-\u00eatre prot\u00e9ger par un mot de passe les informations confidentielles stock\u00e9es en choisissant un mot de passe principal.#Si tel est le cas, vous serez p\u00e9riodiquement invit\u00e9 \u00e0 fournir ce mot de passe principal.  Cette approche assure une meilleure s\u00e9curit\u00e9 mais est l\u00e9g\u00e8rement moins pratique.#Pour prot\u00e9ger par un mot de passe les informations stock\u00e9es, choisissez Pr\u00e9f\u00e9rences dans le menu Edition, ouvrez la cat\u00e9gorie Confidentialit\u00e9 et s\u00e9curit\u00e9, choisissez Mots de passe Web et cochez "Utiliser le chiffrement lors du stockage d'informations confidentielles".  Cette approche assure une meilleure s\u00e9curit\u00e9 mais est un peu moins pratique.
CaveatTitle= Alerte
