# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#   Roland Mainz <roland.mainz@informatik.med.uni-giessen.de>
#

# Page number formating
## @page_number The current page number
#LOCALIZATION NOTE (pageofpages): Do not translate %ld in the following line.
# Place the word %ld where the page number and number of pages should be
# The first %ld will receive the the page number
pagenumber=%1$d

# Page number formating
## @page_number The current page number
## @page_total The total number of pages
#LOCALIZATION NOTE (pageofpages): Do not translate %ld in the following line.
# Place the word %ld where the page number and number of pages should be
# The first %ld will receive the the page number
# the second %ld will receive the total number of pages
pageofpages=%1$d von %2$d

# Print font
# The name of the font to be used to print the headers and footers
fontname=serif

# Print font size
# The size of the font to be used to print the headers and footers
fontsize=10

noPrintFilename.title=Dateiniame fehlt
noPrintFilename.alert=Sie haben "Drucken in: Datei" ausgew\u00e4hlt und keinen Dateinamen angegeben!

# Print error codes
print_error_dialog_title=Druckerfehler
printpreview_error_dialog_title=Fehler in Druckvorschau
NS_ERROR_GFX_PRINTER_CMD_NOT_FOUND=Beim Drucken ist ein Problem aufgetreten. Drucker unterst\u00fctzt Druckbefehl nicht.
NS_ERROR_GFX_PRINTER_CMD_FAILURE=Beim Drucken ist ein Problem aufgetreten. Eine an den Drucker gesendete Anweisung schlug fehl.
NS_ERROR_GFX_PRINTER_NO_PRINTER_AVAILABLE=Beim Drucken ist ein Problem aufgetreten. Es konnte kein Drucker gefunden werden.
NS_ERROR_GFX_PRINTER_NAME_NOT_FOUND=Beim Drucken ist ein Problem aufgetreten. Der Drucker konnte nicht gefunden werden.
NS_ERROR_GFX_PRINTER_ACCESS_DENIED=Beim Drucken ist ein Problem aufgetreten. Der Zugriff auf den Drucker wurde verweigert.
NS_ERROR_GFX_PRINTER_INVALID_ATTRIBUTE=Beim Drucken ist ein Problem aufgetreten. Es wurde versucht, ein ung\u00fcltiges Druckerattribut einzustellen.
NS_ERROR_GFX_PRINTER_PRINTER_NOT_READY=Beim Drucken ist ein Problem aufgetreten. Der Drucker ist nicht bereit.
NS_ERROR_GFX_PRINTER_OUT_OF_PAPER=Beim Drucken ist ein Problem aufgetreten. Der Drucker hat kein Papier mehr.
NS_ERROR_GFX_PRINTER_PRINTER_IO_ERROR=Beim Drucken ist ein Problem aufgetreten. Drucker-E/A-Fehler.
NS_ERROR_GFX_PRINTER_COULD_NOT_OPEN_FILE=Beim Drucken ist ein Problem aufgetreten. Die Ausgabedatei konnte nicht ge\u00f6ffnet werden.
NS_ERROR_GFX_PRINTER_FILE_IO_ERROR=Beim Schreiben der Druckausgabedatei ist ein Fehler aufgetreten.
NS_ERROR_GFX_PRINTER_PRINTPREVIEW=Es muss mindestens ein Drucker verf\u00fcgbar sein, damit die Druckvorschau angezeigt werden kann.
NS_ERROR_UNEXPECTED=Beim Drucken ist ein unerwartetes Problem aufgetreten.
NS_ERROR_OUT_OF_MEMORY=Beim Drucken ist ein Problem aufgetreten. Nicht gen\u00fcgend Arbeitsspeicher zum Drucken verf\u00fcgbar.
NS_ERROR_NOT_IMPLEMENTED=Eine Druckfunktion ist noch nicht implementiert.
NS_ERROR_NOT_AVAILABLE=Nicht verf\u00fcgbar
NS_ERROR_ABORT=Der Druckauftrag wurde angehalten oder gel\u00f6scht.
NS_ERROR_FAILURE=Drucken nicht erfolgreich.
NS_ERROR_GFX_PRINTER_STARTDOC=Drucken schlug am Beginn des Dokuments fehl.
NS_ERROR_GFX_PRINTER_ENDDOC=Drucken schlug bei der Fertigstellung des Dokuments fehl.
NS_ERROR_GFX_PRINTER_STARTPAGE=Drucken schlug am Beginn der Seite fehl.
NS_ERROR_GFX_PRINTER_ENDPAGE=Drucken Schlug beim Fertigstellen der Seite fehl.
NS_ERROR_GFX_PRINTER_PRINT_WHILE_PREVIEW=Sie k\u00f6nnen nicht drucken, w\u00e4hrend Sie sich in der Druckansicht befinden.
NS_ERROR_GFX_PRINTER_PAPER_SIZE_NOT_SUPPORTED=Beim Drucken ist ein Problem aufgetreten, da die angegebenen Papiergr\u00f6\u00dfe von Ihrem Drucker nicht unterst\u00fctzt wird.
NS_ERROR_GFX_PRINTER_ORIENTATION_NOT_SUPPORTED=Beim Drucken ist ein Problem aufgetreten, da die angegebene Seitenausrichtung von Ihrem Drucker nicht unterst\u00fctzt wird.
NS_ERROR_GFX_PRINTER_COLORSPACE_NOT_SUPPORTED=Beim Drucken ist ein Problem aufgetreten, da f\u00fcr den Druckauftrag Farbfunktionen erforderlich sind, die von Ihrem Drucker nicht unterst\u00fctzt werden.
NS_ERROR_GFX_PRINTER_TOO_MANY_COPIES=Beim Drucken ist ein Problem aufgetreten, da zu viele Kopien angefordert wurden.
NS_ERROR_GFX_PRINTER_DRIVER_CONFIGURATION_ERROR=Beim Drucken ist ein Problem aufgetreten. Der Druckertreiber ist nicht ordnungsgem\u00e4\u00df konfiguriert.
NS_ERROR_GFX_PRINTER_XPRINT_BROKEN_XPRT=Eine defekte Version des X-Servers f\u00fcr Drucker ((Xprt) wurde gefunden. Beachten Sie, dass Druckvorg\u00e4nge mit diesem Xprt-Server m\u00f6glicherweise nicht ordnungsgem\u00e4\u00df ausgef\u00fchrt werden. Bitte wenden Sie sich an den Server-H\u00e4ndler, um eine reparierte Version zu erhalten.
NS_ERROR_GFX_PRINTER_DOC_IS_BUSY_PP=Der Browser kann die Druckvorschau im Moment nicht erstellen.\nBitte versuchen Sie es erneut, wenn die Seite vollst\u00e4ndig geladen ist.
NS_ERROR_GFX_PRINTER_DOC_WAS_DESTORYED=Die Seite wurde ausgetauscht, w\u00e4hrend Sie zu drucken versuchten.\nBitte veruschen Sie es erneut.
NS_ERROR_GFX_NO_PRINTDIALOG_IN_TOOLKIT=Entweder die integrierbaren Dialoge wurden nicht richtig installiert\noder dieses GFX-Toolkit unterst\u00fctzt keine herstellergebundenen Druck-Dialoge mehr
NS_ERROR_GFX_NO_PRINTROMPTSERVICE=Der Service 'Printer Prompt' fehlt.
NS_ERROR_GFX_PRINTER_NO_XUL=Diese Seite kann weder gedruckt noch in der Druckvorschau angezeigt werden.
# No printers available
noprinter=Keine Drucker verf\u00fcgbar.
PrintToFile=Ausgabe in Datei umleiten
# EOF.

