<html><head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Glosario</title> <link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</HEAD>
<body> <div class="boilerplate">Este glosario es una herramienta meramente informativa y, por lo tanto, no se pretende que las definiciones de los t&eacute;rminos o las descripciones de las tecnolog&iacute;as de seguridad y confidencialidad que en &eacute;l se recogen sean exhaustivas ni que revistan car&aacute;cter de autoridad.</div>

<hr><h1><A NAME="glossary"></A><A NAME="996904"> Glosario </A></h1><p>


<A NAME="CA"></A><A NAME="1021395"> <B>AC.</B>&nbsp; </A><A NAME="1021418"></A> Consulte <a href="glossary.html#1020903">autoridad certificadora (AC)</a>.<P>

<A NAME="root_CA"></A><A NAME="1015631"> <B>AC ra&iacute;z.</B>&nbsp; </A><A NAME="1015635"></A> <a href="glossary.html#1020903">Autoridad certificadora (AC)</a> con un certificado firmado por ella misma y que se encuentra en la parte superior de una <a href="glossary.html#1018500">cadena de certificados</a>. Consulte tambi&eacute;n <a href="glossary.html#999541">AC secundaria</a>.<P>

<A NAME="subordinate_CA"></A><A NAME="999541"> <B>AC secundaria.</B>&nbsp; </A><A NAME="999591"></A> <a href="glossary.html#1020903">Autoridad certificadora (AC)</a> cuyo certificado est&aacute; firmado por otra AC secundaria o por la AC ra&iacute;z. Consulte tambi&eacute;n <a href="glossary.html#1018500">cadena de certificados</a> y <a href="glossary.html#1015631">AC ra&iacute;z</a>.<P>

<A NAME="cryptographic_algorithm"></A><A NAME="1019976"> <B>algoritmo cifrado.</B>&nbsp; </A><A NAME="1019985"></A> Conjunto de reglas o instrucciones que se utilizan para llevar a cabo operaciones criptogr&aacute;ficas como, por ejemplo, el <a href="glossary.html#999078">cifrado</a> y el <a href="glossary.html#998999">descifrado</a>. En ocasiones tambi&eacute;n se denomina <I>cifra.</I><P>

<p><a name="helper_application"></a> <b>aplicaci&oacute;n auxiliar.</b>&nbsp;Cualquier aplicaci&oacute;n que se emplee para abrir o visualizar un archivo que se haya descargado con el navegador. Un <a href="#plug-in">conector</a> es un tipo especial de aplicaci&oacute;n auxiliar que se instala autom&aacute;ticamente en el subdirectorio de conectores del directorio en que est&eacute; instalado el navegador principal, y que suele poder ejecutarse "internamente", o sea, dentro del propio navegador. En Netscape, las aplicaciones como Microsoft Word, Adobe Photoshop y otras "externas" se consideran aplicaciones auxiliares y no conectores, puesto que no se instalan autom&aacute;ticamente en el directorio del navegador sino que se pueden abrir desde el cuadro de di&aacute;logo de descarga.

<p> <A NAME="authentication"></A><A NAME="998782"> <B>autenticaci&oacute;n.</B>&nbsp; </A> Utilizaci&oacute;n de una contrase&ntilde;a, certificado, n&uacute;mero de identificaci&oacute;n personal (PIN) o cualquier otra informaci&oacute;n para validar una identidad en una red inform&aacute;tica. Consulte tambi&eacute;n <a href="glossary.html#1014123">autenticaci&oacute;n basada en contrase&ntilde;a</a>, <a href="glossary.html#1018581">autenticaci&oacute;n basada en certificado</a>, <a href="glossary.html#1021054">autenticaci&oacute;n de clientes</a>, <a href="glossary.html#1031070">autenticaci&oacute;n de servidor</a>.<P>

<A NAME="certificate-based_authentication"></A><A NAME="1018581"> <B>autenticaci&oacute;n basada en certificado.</B>&nbsp; </A><A NAME="1018582"></A> Verificaci&oacute;n de la identidad basada en certificados y en cifrado de clave p&uacute;blica. Consulte tambi&eacute;n <a href="glossary.html#1014123">autenticaci&oacute;n basada en contrase&ntilde;a</a>.<P>

<A NAME="password-based_authentication"></A><A NAME="1014123"> <B>autenticaci&oacute;n basada en contrase&ntilde;a.</B>&nbsp; </A><A NAME="1014124"></A> Identificaci&oacute;n confidencial mediante un nombre y una contrase&ntilde;a. Consulte tambi&eacute;n <a href="glossary.html#998782">autenticaci&oacute;n</a>.<P>

<A NAME="client_authentication"></A><A NAME="1021054"> <B>autenticaci&oacute;n de cliente.</B>&nbsp; </A><A NAME="1014557"></A> Proceso de identificaci&oacute;n de un <a href="glossary.html#1029510">cliente</a> por parte de un <a href="glossary.html#1029749">servidor</a>, por ejemplo, con un nombre y una contrase&ntilde;a, o con un <a href="glossary.html#1014561">certificado de cliente SSL</a> y ciertos datos de firma digital. Consulte tambi&eacute;n <a href="glossary.html#999463">Capa de seguridad de circuitos (SSL)</a>, <a href="glossary.html#1031070">autenticaci&oacute;n de servidor</a>.<P>

<A NAME="server_authentication"></A><A NAME="1031070"> <B>autenticaci&oacute;n de servidor.</B>&nbsp; </A><A NAME="1031080"></A> Proceso de identificaci&oacute;n de un <a href="glossary.html#1029749">servidor</a> por parte de un <a href="glossary.html#1029510">cliente</a> mediante la utilizaci&oacute;n de un <a href="glossary.html#1029874">certificado de servidor SSL</a>. Consulte tambi&eacute;n <a href="glossary.html#1021054">autenticaci&oacute;n de cliente</a> y <a href="glossary.html#999463">Capa de seguridad de circuitos (SSL)</a>.<P>

<A NAME="certificate_authority_(CA)"></A><A NAME="1020903"> <B>autoridad certificadora (AC).</B>&nbsp; </A><A NAME="1020904"></A> Servicio que emite un certificado despu&eacute;s de verificar la identidad de la persona o la entidad a las que se pretende identificar con el certificado. Una AC tambi&eacute;n renueva y revoca certificados, y genera una lista de certificados revocados a intervalos regulares. Las AC pueden ser vendedores independientes (por ejemplo, las AC enumeradas en <a href="https://certs.netscape.com/" TARGET="_blank">Certificados de clientes</a>) o una persona u organizaci&oacute;n que utiliza un software de emisi&oacute;n de certificados (como, por ejemplo, Mozilla Certificate Management System, el sistema de gesti&oacute;n de certificados de Netscape). Consulte tambi&eacute;n <a href="glossary.html#1018895">certificado</a>, <a href="glossary.html#1019940">lista de revocaci&oacute;n de certificados (CRL)</a>.<P>

<p><a name="Component_Bar"></a> <b>barra de componentes.</b>&nbsp;Barra situada en la la parte inferior izquierda de cualquier ventana de Netscape. Gracias a la barra de componentes, se puede pasar de uno a otro haciendo clic en los respectivos iconos de Navigator, Correo y Grupos de noticias, AOL Instant Messenger, etc.

<A NAME="Status_Bar"></A> <B>Barra de estado.</B>&nbsp; Barra de herramientas situada en la parte inferior de cualquier ventana de Netscape. Abarca tambi&eacute;n la <a href="#Component_Bar">barra de componentes</a> de la izquierda, y los iconos de estado de la derecha. Por ejemplo, en Navigator, incluye iconos de estado como el <a href="using_certs_help.html#using_certs_info">icono con forma de candado</a>.<P>

<A NAME="Location_Bar"></A> <B>barra Direcci&oacute;n.</B>&nbsp; Espacio formado por el campo, y los botones que lo acompa&ntilde;an, situado en la parte superior de una ventana de Navigator, y en el que pueden escribirse una <a href="#Uniform_Resource_Locator_(URL)">URL</a> o las palabras que se desee buscar. Si desea informaci&oacute;n detallada, consulte <a href="nav_help.html#nav_move">C&oacute;mo se cambia de p&aacute;gina</a>.<P>

<A NAME="navigation_toolbar"></A> <B>barra Navegaci&oacute;n.</B>&nbsp; Barra situada en la parte superior de la ventana del navegador y en la que se incluyen los botones Anterior y Siguiente.<P>

<A NAME="personal_toolbar"></A> <B>barra Personal.</B>&nbsp; Barra de herramientas personalizable que, de forma predeterminada, aparece inmediatamente debajo de la barra Direcci&oacute;n de Navigator . Se compone de varios botones t&iacute;picos que se pueden agregar o suprimir, como Inicio, Buscar, Marcadores y otros. Puede agregar botones para sus marcadores preferidos o para carpetas que contengan grupos de marcadores. Si desea informaci&oacute;n detallada, consulte <a href="customize_help.html#cust_personal">Barra Personal</a>.<P>

<A NAME="talkback"></A> <B>bloqueo del sistema.</B>&nbsp; Consulte <a href="#netscape_talkback">Netscape Quality Feedback Agent</a>.<P>

<p><a name="search_engine"></a> <b>buscador.</b>&nbsp;Programa para la Web con el que los usuarios pueden buscar y recuperar informaci&oacute;n en la World Wide Web. El buscador puede rastrear &iacute;ntegramente el texto de los documentos de la Web o una lista de palabras clave, o bien servirse de bibliotecarios que los examinan y los indexan manualmente para facilitar su recuperaci&oacute;n. Lo habitual es que el usuario escriba en el recuadro de b&uacute;squeda una frase o una palabra (tambi&eacute;n denominada "consulta"), y el buscador muestre como resultado enlaces a las p&aacute;ginas web que las contengan.<p>

<p><a name="cache"></a> <b>cach&eacute;.</b>&nbsp;Conjunto de p&aacute;ginas web almacenadas en el disco duro de un equipo o en la memoria de acceso aleatorio (RAM). El navegador va almacenando estas p&aacute;ginas a medida que se navega por la Web. Cuando se hace clic en el enlace, o se escribe la <a href="#Uniform_Resource_Locator_(URL)">URL</a>, de una determinada p&aacute;gina para localizarla, el navegador compara la copia almacenada en el cach&eacute; con la original. Si no se detectan modificaciones, el navegador muestra la copia de la p&aacute;gina en lugar de volver a cargar la original, lo cual supone un ahorro de tiempo de procesamiento y de carga. <p>

<A NAME="certificate_chain"></A><A NAME="1018500"> <B>cadena de certificados.</B>&nbsp; </A><A NAME="1019929"></A> Serie jer&aacute;rquica de certificados firmados por sucesivas autoridades certificadoras (AC). Un certificado de AC identifica a una <a href="glossary.html#1020903">autoridad certificadora (AC)</a> y se utiliza para firmar certificados emitidos por dicha autoridad. Un certificado de AC de un nivel superior puede, a su vez, firmar un certificado de AC, y as&iacute; hasta llegar a una <a href="glossary.html#1015631">AC ra&iacute;z</a>. <P>

<p><a name="Netscape_CalendarSDX"></a>
<p><a name="calendarIDX"></a>
<p><a name="scheduling_meetingsSDX"></a>
<p><a name="scheduling_appointmentsSDX"></a>
<p><a name="Calendar"></a> <b>Calendario.</b>&nbsp;Aplicaci&oacute;n para realizar un seguimiento de las tareas planificadas por el usuario. Si se utililza Netscape en el trabajo, es posible que esta aplicaci&oacute;n ya est&eacute; disponible en el men&uacute; Ventana de Netscape. Si utiliza Netscape en casa, o si en su lugar de trabajo no dispone del Calendario de Netscape, puede acceder al calendario en formato web disponible en <tt><a href="http://www.netscape.com" target="_blank">www.netscape.com</a></tt>.<p>

<A NAME="Secure_Sockets_Layer_(SSL)"></A><A NAME="999463"> <B>Capa de seguridad de circuitos (SSL).</B>&nbsp; </A><A NAME="999472"></A> Protocolo que permite la autenticaci&oacute;n mutua entre un <a href="glossary.html#1029510">cliente</a> y un <a href="glossary.html#1029749">servidor</a> con el prop&oacute;sito de establecer una conexi&oacute;n autenticada y cifrada. SSL se ejecuta por encima de TCP/IP y por debajo de HTTP, LDAP, IMAP, NNTP y otros protocolos de red de alto nivel. La nueva norma de Fuerza de trabajo de ingenier&iacute;a de Internet (IETF) denominado Seguridad en la capa de transporte (TLS) est&aacute; basada en SSL. Consulte tambi&eacute;n <a href="glossary.html#998782">autenticaci&oacute;n</a> y <a href="glossary.html#999078">cifrado</a>.<P>

<A NAME="certificate"></A><A NAME="1018895"> <B>certificado.</B>&nbsp; </A><A NAME="1018896"></A> Equivalente digital de una tarjeta de identificaci&oacute;n. Un certificado especifica el nombre de un individuo, una empresa o cualquier otra entidad, y certifica que una clave p&uacute;blica, la cual se incluye con el certificado, pertenece a dicha entidad. Cuando se firma digitalmente un mensaje o cualquier otra informaci&oacute;n, la firma digital se crea con ayuda de la clave privada que corresponde a la clave p&uacute;blica del certificado. Los certificados los emite y los firma digitalmente una <a href="glossary.html#1020903">autoridad certificadora (AC)</a>. La validez de un certificado se puede verificar comprobando la <a href="glossary.html#1013995">firma digital</a> de la AC. Otras denominaciones que recibe son: identificaci&oacute;n digital, pasaporte digital, certificado de clave p&uacute;blica, certificado X.509 y certificado de seguridad. Consulte tambi&eacute;n <a href="glossary.html#1019178">cifrado de clave p&uacute;blica</a>.<P>

<A NAME="CA_certificate"></A><A NAME="1017503"> <B>certificado de AC.</B>&nbsp; </A><A NAME="1017507"></A> Certificado que identifica a una autoridad certificadora. Consulte tambi&eacute;n <a href="glossary.html#1020903">autoridad certificadora (AC)</a>, <a href="glossary.html#999541">AC secundaria</a>, <a href="glossary.html#1015631">AC ra&iacute;z</a>.<P>

<A NAME="encryption_certificate"></A><A NAME="1024953"> <B>certificado de cifrado.</B>&nbsp; </A><A NAME="1024978"></A> Certificado cuya clave p&uacute;blica se corresponde con una clave privada que se utiliza s&oacute;lo para el cifrado. Los certificados de cifrado no se utilizan para operaciones de firma. Consulte tambi&eacute;n <a href="glossary.html#1020489">pares de clave dual</a>, <a href="glossary.html#999493">certificado de firma</a>.<P>

<A NAME="client_SSL_certificate"></A><A NAME="1014561"> <B>certificado de cliente SSL.</B>&nbsp; </A><A NAME="1014562"></A> Certificado que presenta un <a href="glossary.html#1029510">cliente</a> (por ejemplo, un software de navegador) a un <a href="glossary.html#1029749">servidor</a> para autenticar la identidad del cliente (o de la persona que utiliza el cliente) mediante un protocolo de <a href="glossary.html#999463">Capa de seguridad de circuitos (SSL)</a>. Consulte tambi&eacute;n <a href="glossary.html#1021054">autenticaci&oacute;n de clientes</a>.<P>

<A NAME="signing_certificate"></A><A NAME="999493"> <B>certificado de firma.</B>&nbsp; </A><A NAME="999507"></A> Certificado cuya <a href="glossary.html#1015387">clave privada</a> correspondiente se utiliza para firmar datos transmitidos, para que el destinatario pueda verificar la identidad del remitente. Las autoridades certificadoras (AC) suelen emitir un certificado de firma que se utiliza para firmar mensajes de correo electr&oacute;nico, del mismo modo que un <a href="glossary.html#1024953">certificado de cifrado</a> se utiliza para cifrar mensajes de correo electr&oacute;nico. Consulte tambi&eacute;n <a href="glossary.html#1020489">pares de clave dual</a> y <a href="glossary.html#1013995">firma digital</a>.<P>

<A NAME="object-signing certificate"></A><A NAME="1014097"> <B>certificado de firma de objeto.</B>&nbsp; </A><A NAME="1014098"></A> Certificado cuya clave privada correspondiente se utiliza para firmar objetos como archivos de c&oacute;digo. Consulte tambi&eacute;n <a href="glossary.html#1014095">firma de objeto</a>.<P>

<A NAME="security_certificate"></A><A NAME="1028900"> <B>certificado de seguridad.</B>&nbsp; </A><A NAME="1028904"></A> Consulte <a href="glossary.html#1018895">certificado</a>.<P>

<A NAME="server_SSL_certificate"></A><A NAME="1029874"> <B>certificado de servidor SSL.</B>&nbsp; </A><A NAME="999500"></A> Certificado que presenta un <a href="glossary.html#1029749">servidor</a> a un <a href="glossary.html#1029510">cliente</a> para autenticar la identidad del servidor mediante el protocolo <a href="glossary.html#999463">Capa de seguridad de circuitos (SSL)</a>.<P>

<A NAME="cipher"></A><A NAME="1021048"> <B>cifra.</B>&nbsp; </A><A NAME="1021052"></A> Consulte <a href="glossary.html#1019976">algoritmo cifrado</a>.<P>

<A NAME="encryption"></A><A NAME="999078"> <B>cifrado.</B>&nbsp; </A><A NAME="1024038"></A> Proceso de codificaci&oacute;n de la informaci&oacute;n para ocultar el significado de &eacute;sta. Por ejemplo, el cifrado de las conexiones entre equipos le dificulta enormemente a un tercero la descodificaci&oacute;n (o <I>descifrado</I>) de la informaci&oacute;n que circula por ellas. Una persona que disponga de la clave adecuada puede descifrar informaci&oacute;n cifrada. Consulte tambi&eacute;n <a href="glossary.html#1019178">cifrado de clave p&uacute;blica</a>.<P>

<A NAME="public-key_cryptography"></A><A NAME="1019178"> <B>cifrado de clave p&uacute;blica.</B>&nbsp; </A><A NAME="1023765"></A> Conjunto de t&eacute;cnicas y normas s&oacute;lidamente establecidas que permiten a una entidad (por ejemplo, una persona, empresa o aparato, como un enrutador) verificar su identidad electr&oacute;nicamente, o firmar y cifrar datos electr&oacute;nicos. Est&aacute;n implicadas dos claves: una <a href="glossary.html#1019172">clave p&uacute;blica</a> y una <a href="glossary.html#1015387">clave privada</a>. La clave p&uacute;blica se publica como parte de un <a href="glossary.html#1018895">certificado</a>, que asocia dicha clave con una identidad determinada. La clave privada correspondiente se mantiene en secreto. Los datos cifrados con la clave p&uacute;blica pueden descifrarse s&oacute;lo con la clave privada. <P>

<A NAME="symmetric_encryption"></A><A NAME="999604"> <B>cifrado sim&eacute;trico.</B>&nbsp; </A><A NAME="999625"></A> M&eacute;todo de cifrado que utiliza una sola clave criptogr&aacute;fica tanto para cifrar como para descifrar un mensaje dado.<P>

<A NAME="key"></A><A NAME="999203"> <B>clave.</B>&nbsp; </A><A NAME="999212"></A> N&uacute;mero grande utilizado por un <a href="glossary.html#1019976">algoritmo cifrado</a> para cifrar o descifrar datos. Gracias a la clave p&uacute;blica de un usuario, por ejemplo, otros pueden cifrar los mensajes de dicho usuario. Los mensajes cifrados deben descifrarse con la clave privada correspondiente. Consulte tambi&eacute;n <a href="glossary.html#1019178">cifrado de clave p&uacute;blica</a>.<P>

<A NAME="encryption_key"></A><A NAME="1021254"> <B>clave de cifrado.</B>&nbsp; </A><A NAME="1021255"></A> Clave privada que se utiliza s&oacute;lo para el cifrado. Una clave de cifrado y su clave p&uacute;blica equivalente, junto con una <a href="glossary.html#1021282">clave de firma</a> y su clave p&uacute;blica equivalente, constituyen los <a href="glossary.html#1020489">pares de clave dual</a>.<P>

<A NAME="signing_key"></A><A NAME="1021282"> <B>clave de firma.</B>&nbsp; </A><A NAME="1021283"></A> Clave privada que se utiliza s&oacute;lo para la firma. Una clave de firma y su clave p&uacute;blica equivalente, junto con una <a href="glossary.html#1021254">clave de cifrado</a> y su clave p&uacute;blica equivalente, constituyen los <a href="glossary.html#1020489">pares de clave dual</a>.<P>

<A NAME="master_key"></A><A NAME="1032598"> <B>clave maestra.</B>&nbsp; </A><A NAME="1032639"></A> Clave sim&eacute;trica utilizada por el Gestor de certificados para cifrar la informaci&oacute;n. Por ejemplo, el Gestor de contrase&ntilde;as se sirve utiliza al Gestor de certificados junto con la clave maestra del usuario para cifrar contrase&ntilde;as de correo electr&oacute;nico, de sitios web y otros tipos de informaci&oacute;n confidencial almacenada. Consulte tambi&eacute;n <a href="glossary.html#999604">cifrado sim&eacute;trico</a>.<P>

<A NAME="private_key"></A><A NAME="1015387"> <B>clave privada.</B>&nbsp; </A><A NAME="1015391"></A> Una de las dos <a href="#key">claves</a> que se utilizan en el cifrado de clave p&uacute;blica. La clave privada se mantiene en secreto y se utiliza para descifrar los datos que se han cifrado con la clave p&uacute;blica correspondiente.<P>

<A NAME="public_key"></A><A NAME="1019172"> <B>clave p&uacute;blica.</B>&nbsp; </A><A NAME="1019173"></A> Una de las dos <a href="#key">claves</a> que se utilizan en el cifrado de clave p&uacute;blica. La clave p&uacute;blica se distribuye gratuitamente y se publica como parte de un <a href="glossary.html#1018895">certificado</a>. Se utiliza normalmente para cifrar datos enviados al propietario de la clave p&uacute;blica, quien, a continuaci&oacute;n, descifra los datos con la clave privada correspondiente.<P>

<A NAME="client"></A><A NAME="1029510"> <B>cliente.</B>&nbsp; </A><A NAME="1029547"></A> Software (por ejemplo, software de navegador) que env&iacute;a solicitudes y recibe informaci&oacute;n de un <a href="glossary.html#1029749">servidor</a>, y que suele ejecutarse en otro equipo. Un equipo en el que se ejecute software de cliente tambi&eacute;n se denomina cliente.<P>

<a name="plug-in"></a> <b>conector.</b>&nbsp;Tipo de <a href="#helper_application">aplicaci&oacute;n auxiliar</a> que ampl&iacute;a las prestaciones del navegador con otras nuevas tales como la reproducci&oacute;n de audio y video. A diferencia de otros tipos de aplicaci&oacute;n auxiliar, el <a href="#plug-in">conector</a> es un tipo especial que se instala autom&aacute;ticamente en el subdirectorio de conectores del directorio en que est&eacute; instalado el navegador principal, y que suele poder ejecutarse "internamente", o sea, dentro del propio navegador. Por ejemplo, con un conector para audio pueden reproducirse los archivos de sonido incluidos en una p&aacute;gina web o en un mensaje de correo electr&oacute;nico. Macromedia Flash Player y Java son ejemplos de conectores.<p>

<A NAME="trust"></A><A NAME="1019748"></A> <B>confianza.</B>&nbsp; <A NAME="1020186"></A> Seguridad en una persona o en otra entidad. En el contexto de la <a href="glossary.html#999412">infraestructura de clave p&uacute;blica (PKI)</a>, el t&eacute;rmino "confianza" normalmente se refiere a la relaci&oacute;n entre el usuario de un certificado y la <a href="glossary.html#1020903">autoridad certificadora (AC)</a> que lo emiti&oacute;. Si utiliza el Gestor de certificados para especificar que conf&iacute;a en una AC, el Gestor de certificados confiar&aacute; en los certificados v&aacute;lidos emitidos por dicha AC a menos que se especifique lo contrario en la configuraci&oacute;n de los certificados particulares. Para especificar las AC concretas en las que conf&iacute;a o no para emitir ciertos tipos de certificados, se utiliza la pesta&ntilde;a Autoridades del Gestor de certificados. <P>

<p><a name="implicit_consent"></a><b>consentimiento impl&iacute;cito.</b>&nbsp; Tambi&eacute;n se conoce como consentimiento para "borrarse", o t&aacute;cito. Se emplea para describir los valores de confidencialidad que pueden permitir que un sitio web consiga informaci&oacute;n sobre el usuario que lo visita (por ejemplo, mediante <a href="#cookie">cookies</a> o formularios en l&iacute;nea), a menos que &eacute;ste prefiera denegar expl&iacute;citamente su consentimiento seleccionando la opci&oacute;n que corresponda en la p&aacute;gina que el sitio web tiene a tal efecto. A veces, al usuario no se le solicita su consentimiento antes de captar la informaci&oacute;n.<p>

<A NAME="certificate_backup_password"></A><A NAME="1024655"> <B>contrase&ntilde;a de copia de seguridad de certificado.</B>&nbsp; </A><A NAME="1024670"></A> Contrase&ntilde;a que protege un certificado del que el usuario ha realizado o est&aacute; realizando una copia de seguridad. El Gestor de certificados le pide que establezca esta contrase&ntilde;a cuando realice una copia de seguridad de un certificado, y le solicita la contrase&ntilde;a cuando intente restaurar certificados de los que previamente haya realizado una copia de seguridad. <P>

<A NAME="master_password"></A><A NAME="1032744"> <B>contrase&ntilde;a maestra.</B>&nbsp; </A><A NAME="1032748"></A> Contrase&ntilde;a utilizada por el Gestor de certificados para proteger la clave maestra o las claves privadas almacenadas en un <a href="glossary.html#1028962">dispositivo de seguridad</a>. El Gestor de certificados necesita tener acceso a las claves privadas del usuario, por ejemplo, al firmar mensajes de correo electr&oacute;nico o al utilizar uno de los certificados propios del usuario para identificarlo en un sitio web. Necesita acceder a la clave maestra cuando el Gestor de contrase&ntilde;as o el Gestor de formularios leen o agregan datos a la informaci&oacute;n personal del usuario. La contrase&ntilde;a maestra se puede configurar o cambiar en el panel de preferencias Contrase&ntilde;as maestras. Cada dispositivo de seguridad requiere una contrase&ntilde;a maestra por separado. Consulte tambi&eacute;n <a href="glossary.html#1015387">clave privada</a> y <a href="glossary.html#1032598">clave maestra</a>.<P>

<p><a name="cookie"></a> <b>cookie.</b>&nbsp;Peque&ntilde;o archivo con informaci&oacute;n que algunas p&aacute;ginas web almacenan en el equipo de quienes las visitan. Al visitar un sitio que utilice cookies, &eacute;ste puede pedirle al navegador que almacene uno o varios cookies en su disco duro. M&aacute;s adelante, cuando vuelva a este sitio, el navegador le devolver&aacute; al sitio los cookies que le pertenecen. Gracias a los cookies, los sitios guardan informaci&oacute;n sobre el usuario que los visita, como, por ejemplo, el contenido de su carro de la compra. Es posible configurar el navegador para controlar c&oacute;mo se utilizan los cookies y qu&eacute; tipo de informaci&oacute;n prefiere que los sitios web almacenen en ellos. Consulte tambi&eacute;n <a href="#foreign_cookie">cookie extra&ntilde;o</a>.<p>

<p><a name="foreign_cookie"></a> <b>cookie extra&ntilde;o.</b>&nbsp;Cookie procedente de un sitio web que queda almacenado en el equipo del usuario cuando visita otro sitio distinto. En ocasiones, un sitio web muestra contenido que, en realidad, est&aacute; almacenado en otro. Puede tratarse de cualquier tipo de contenido, como im&aacute;genes, texto o anuncios. El sitio en el que est&aacute;n almacenados tales elementos tambi&eacute;n es capaz de almacenar un cookie en el navegador del usuario, incluso si &eacute;ste no lo visita directamente. Tambi&eacute;n se denomina "cookie de terceros". <p>

<p><a name="third-party_cookie"></a> <b>cookie de terceros.</b>&nbsp;Consulte <a href="#foreign_cookie">cookie extra&ntilde;o</a>.<p>

<A NAME="cryptography"></A><A NAME="1026002"> <B>criptograf&iacute;a.</B>&nbsp; </A><A NAME="1026018"></A> El arte y la pr&aacute;ctica de codificar (cifrar) y descodificar (descifrar) la informaci&oacute;n. Por ejemplo, las t&eacute;cnicas criptogr&aacute;ficas se utilizan para codificar y descodificar la informaci&oacute;n que circula entre los sitios web comerciales y el navegador del usuario. Consulte tambi&eacute;n <a href="glossary.html#1019178">cifrado de clave p&uacute;blica</a>.<P>

<A NAME="decryption"></A><A NAME="998999"> <B>descifrado.</B>&nbsp; </A><A NAME="999005"></A> Proceso que consiste en descodificar la informaci&oacute;n que previamente se ha cifrado. Consulte tambi&eacute;n <a href="glossary.html#999078">cifrado</a>.<P>

<A NAME="tamper_detection"></A><A NAME="999618"> <B>detecci&oacute;n de manipulaci&oacute;n.</B>&nbsp; </A><A NAME="999631"></A> Mecanismo que garantiza que los datos recibidos electr&oacute;nicamente no han sido manipulados, es decir, que se corresponden exactamente con la versi&oacute;n original enviada.<P>

<p><a name=" Internet_protocol_address_(IP address)"></a> <b>direcci&oacute;n de Protocolo de Internet (direcci&oacute;n IP).</b>&nbsp;Direcci&oacute;n de un equipo en una red <a href="#Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)">TCP/IP</a>. Cualquier equipo conectado a Internet tiene asignada una direcci&oacute;n IP. Los <a href="#client">clients</a> tienen una direcci&oacute;n IP fija (permanente), o bien se les asigna din&aacute;micamente una cada vez que se conectan a la red. Las direcciones IP se componen de cuatro grupos de n&uacute;meros como, por ejemplo: 204.171.64.2.

<A NAME="security_device"></A><A NAME="1028962"> <B>dispositivo de seguridad.</B>&nbsp; </A><A NAME="1028963"></A> Hardware o software que proporcionan servicios criptogr&aacute;ficos como el cifrado y descifrado, adem&aacute;s de almacenar certificados y claves. Una tarjeta inteligente es un ejemplo de dispositivo de seguridad de hardware. El <a href="#Certificate_Manager">Gestor de certificados</a> contiene su propio dispositivo de seguridad integrado, denominado <a href="glossary.html#software_security_device">dispositivo de seguridad de software</a>, y se encuentra siempre disponible mientras se ejecute el navegador. Cada dispositivo de seguridad est&aacute; protegido por su propia <a href="glossary.html#1032744">contrase&ntilde;a maestra</a>.<P>

<A NAME="software_security_device"></A><A NAME="1032045"> <B>dispositivo de seguridad de software.</B>&nbsp; </A><A NAME="1032110"></A> <a href="#security_device">Dispositivo de seguridad</a> predeterminado que utiliza el Gestor de certificados para almacenar claves privadas asociadas con los certificados. Adem&aacute;s de las claves privadas, el dispositivo de seguridad de software almacena la clave maestra utilizada por el Gestor de contrase&ntilde;as para cifrar contrase&ntilde;as de correo electr&oacute;nico, de sitios web y otros tipos de informaci&oacute;n confidencial. Consulte tambi&eacute;n <a href="glossary.html#1015387">clave privada</a> y <a href="glossary.html#1032598">clave maestra</a>.<p>

<A NAME="spoofing"></A><A NAME="1014366"> <B>enga&ntilde;o.</B>&nbsp; </A><A NAME="1014367"></A> Acci&oacute;n que consiste en fingir ser otra persona. Por ejemplo, una persona puede fingir que tiene la direcci&oacute;n de correo electr&oacute;nico <TT>jsanchez@mozilla.com</TT>, o un equipo puede identificarse a s&iacute; mismo como sitio denominado <TT>www.mozilla.com</TT> sin serlo. El enga&ntilde;o es una forma de <a href="glossary.html#1014057">falsificaci&oacute;n</a>.<P>

<A NAME="misrepresentation"></A><A NAME="1014057"> <B>falsificaci&oacute;n.</B>&nbsp; </A><A NAME="1014058"></A> Presentaci&oacute;n de una entidad como una persona u organizaci&oacute;n que realmente no es. Por ejemplo, es posible que un sitio web finja ser un establecimiento de venta de muebles y, en realidad, se trate de un sitio que realiza cargos en tarjetas de cr&eacute;dito sin enviar ninguna mercanc&iacute;a. Consulte tambi&eacute;n <a href="glossary.html#1014366">enga&ntilde;o</a>.<P>

<A NAME="digital_signature"></A><A NAME="1013995"> <B>firma digital.</B>&nbsp; </A><A NAME="1013996"></A> C&oacute;digo que se crea a partir de los datos que han de firmarse y la clave privada de la persona que firma. Este c&oacute;digo es &uacute;nico para cada nueva porci&oacute;n de informaci&oacute;n. Incluso si se a&ntilde;ade una sola coma a un mensaje, la firma digital para dicho mensaje cambia. Si el software adecuado valida correctamente la firma digital, no s&oacute;lo se le corrobora al usuario que se han aprobado el mensaje o la transacci&oacute;n, sino que tambi&eacute;n se le dan pruebas de que los datos no se han modificado desde que los firm&oacute; digitalmente. Una firma digital no tiene nada que ver con una firma escrita, aunque en ocasiones pueden utilizarse para prop&oacute;sitos legales similares. Consulte tambi&eacute;n <a href="glossary.html#999248">no repudio</a>, <a href="glossary.html#999618">detecci&oacute;n de manipulaci&oacute;n</a>.<P>

<A NAME="FIPS_PUBS_140-1"></A><A NAME="1025742"> <B>FIPS PUBS 140-1.</B>&nbsp; </A><A NAME="1025743"></A> Federal Information Processing Standards Publications (publicaciones de normas de procesamiento de informaci&oacute;n federal o FIPS PUBS) 140-1 es una norma del gobierno de los Estados Unidos para la implantaci&oacute;n de m&oacute;dulos de cifrado, es decir, equipos o programas que cifren y descifren los datos o hagan otras operaciones criptogr&aacute;ficas (como la creaci&oacute;n o verificaci&oacute;n de firmas digitales). La mayor&iacute;a de los productos que se venden a la Administraci&oacute;n estadounidense deben cumplir una o varias normas FIPS.<P>

<A NAME="object_signing"></A><A NAME="1014095"> <B>firma de objeto.</B>&nbsp; </A><A NAME="1014096"></A> Tecnolog&iacute;a que permite a los programadores de software firmar c&oacute;digo Java, scripts de JavaScript o cualquier tipo de archivo, y con la que los usuarios pueden identificar a la persona que ha firmado y controlar el acceso a recursos locales del sistema por medio de c&oacute;digo firmado.<P>

<A NAME="Certificate_Manager"></A> <B>Gestor de certificados</B>&nbsp; <A NAME="1020326"></A> M&oacute;dulo del navegador con el que el usuario puede visualizar y gestionar certificados. Para visualizar la ventana principal del Gestor de certificados: Abra el men&uacute; Editar, seleccione Preferencias, haga clic en Privacidad y seguridad y, a continuaci&oacute;n, en Certificados.<P>

<p><a name="Password_Manager"></a> <b>Gestor de contrase&ntilde;as.</b>&nbsp;M&oacute;dulo del navegador que le ayuda a recordar los nombres de usuario y las contrase&ntilde;as almacen&aacute;ndolos en el disco duro de su equipo; despu&eacute;s, las introduce autom&aacute;ticamente cuando usted vuelva a visitar los mismos sitios. Si desea m&aacute;s informaci&oacute;n, consulte <a href="using_priv_help.html#using_password">El gestor de contrase&ntilde;as</a>. <p>

<p><a name="Cookie_Manager"></a> <b>Gestor de cookies.</b>&nbsp;M&oacute;dulo del navegador que se utiliza para controlar los <a href="#cookie">cookies</a>. Si desea m&aacute;s informaci&oacute;n, consulte <a href="using_priv_help.html">El gestor de cookies</a>. <p>

<p><a name="Form_Manager"></a> <b>Gestor de formularios.</b>&nbsp;M&oacute;dulo del navegador con el que es posible almacenar los datos personales que el usuario introduce en un formulario en l&iacute;nea, como nombre, direcci&oacute;n, tel&eacute;fono, etc. Despu&eacute;s, cuando un sitio le presente un formulario, el Gestor de formularios puede rellenarlo autom&aacute;ticamente. Si desea m&aacute;s informaci&oacute;n, consulte <a href="using_priv_help.html#using_forms">El gestor de formularios</a>. <p>

<A NAME="fingerprint"></A><A NAME="1020434"> <B>huella.</B>&nbsp; </A><A NAME="1020450"></A> Consulte <a href="glossary.html#1020297">huella de certificado</a>.<P>

<A NAME="certificate_fingerprint"></A><A NAME="1020297"> <B>huella de certificado.</B>&nbsp; </A> N&uacute;mero &uacute;nico asociado a un certificado. El n&uacute;mero no forma parte del mismo certificado, sino que resulta de la aplicaci&oacute;n de una funci&oacute;n matem&aacute;tica a los contenidos del certificado. Si los contenidos del certificado cambian, incluso en un solo car&aacute;cter, la funci&oacute;n genera un n&uacute;mero distinto. Por tanto, las huellas de certificados pueden utilizarse para verificar que los certificados no se hayan manipulado.<P>

<A NAME="digital_ID"></A><A NAME="999011"> <B>identificaci&oacute;n digital.</B>&nbsp; </A><A NAME="999017"></A> Consulte <a href="glossary.html#1018895">certificado</a>.<P>

<A NAME="public-key_infrastructure (PKI)"></A><A NAME="999412"> <B>infraestructura de clave p&uacute;blica (PKI).</B>&nbsp; </A><A NAME="1014263"></A> Normas y servicios que facilitan la utilizaci&oacute;n de cifrado de clave p&uacute;blica y certificados en un entorno de red.<P>

<A NAME="eavesdropping"></A><A NAME="1020620"> <B>intercepci&oacute;n de comunicaciones.</B>&nbsp; </A><A NAME="1013975"></A> Intercepci&oacute;n encubierta de la informaci&oacute;n que circula por una red, por parte de una entidad a la que no va destinada la informaci&oacute;n.<P>

<p><a name="Internet"></a> <b>Internet.</b>&nbsp;Red mundial compuesta por millones de equipos que se comunican entre s&iacute; mediante protocolos normativos como <a href="#Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)">TCP/IP</a>. Desarrollada inicialmente con fines militares en los Estados Unidos en 1969, se fue ampliando para dar cabida a instituciones educativas y de investigaci&oacute;n y, a finales de los noventa, tambi&eacute;n a empresas, organizaciones y particulares. Hoy en d&iacute;a Internet se utiliza con m&uacute;ltiples finalidades, como el correo electr&oacute;nico, la navegaci&oacute;n por la <a href="#World_Wide_Web">World Wide Web</a>, la mensajer&iacute;a instant&aacute;nea, los grupos de noticias, etc.<p>

<p><a name="Java"></a> <b>Java.</b>&nbsp;Lenguaje de programaci&oacute;n desarrollado por Sun Microsystems. Un mismo programa escrito en Java puede ejecutarse en muchos tipos de sistemas distintos, lo cual les ahorra a los programadores tener que escribir una versi&oacute;n diferente del programa para cada clase de equipo. Su navegador puede descargar y ejecutar autom&aacute;ticamente programas escritos en Java (tambi&eacute;n llamadas "applets").<p>

<p><a name="JavaScript"></a> <b>JavaScript.</b>&nbsp;Lenguaje de programaci&oacute;n de secuencias de comandos habitualmente utilizado en la creaci&oacute;n de p&aacute;ginas web. Los programadores se sirven de JavaScript para dise&ntilde;ar p&aacute;ginas web m&aacute;s interactivas; por ejemplo, que contengan formularios y botones. JavaScript y Java pueden emplearse conjuntamente pero t&eacute;cnicamente son dos lenguajes con entidad propia. Para que JavaScript funcione correctamente, no es necesaria la presencia de Java.<p>

<p><a name="XMLIDX"></a>
<p><a name="XML"></a> <b>Lenguaje ampliable de marcado (XML).</b>&nbsp; Norma abierta para la descripci&oacute;n de informaci&oacute;n. A diferencia de HTML, con XML el programador de p&aacute;ginas web puede definir etiquetas especiales. Si desea m&aacute;s informaci&oacute;n, consulte en Internet el documento del W3C <a href="http://www.w3.org/XML/" target="_blank">Extensible Markup Language (XML)</a>.<p>

<p><a name="Hypertext_Markup_Language_(HTML)"></a> <b>Lenguaje de marcado de hipertexto (HTML).</b>&nbsp; Formato de documentos que emplean las p&aacute;ginas web. En el lenguaje HTML se establecen las etiquetas o c&oacute;digos que se emplean para definir el formato del texto, las fuentes, el estilo, las im&aacute;genes y dem&aacute;s elementos que conforman una p&aacute;gina web. <p>

<A NAME="certificate_revocation_list_(CRL)"></A><A NAME="1019940"> <B>lista de revocaci&oacute;n de certificados (CRL).</B>&nbsp; </A><A NAME="1021047"></A> Lista de certificados revocados generada y firmada por una <a href="glossary.html#1020903">autoridad certificadora (AC)</a>. Es posible descargar la CRL m&aacute;s reciente al navegador o al servidor y comprobarla despu&eacute;s para asegurarse de que los certificados son todav&iacute;a v&aacute;lidos antes de utilizarlos para la autenticaci&oacute;n. <P>

<p><a name="Uniform_Resource_Locator_(URL)"></a> <b>Localizador Uniforme de Recursos (URL).</b>&nbsp;Direcci&oacute;n homologada que le indica a un navegador c&oacute;mo encontrar un archivo o cualquier otro recurso en la Web. Por ejemplo: <tt>http://www.netscape.com.</tt> Para acceder a una p&aacute;gina web, es preciso escribir su direcci&oacute;n URL en la barra Direcci&oacute;n. Las direcciones URL tambi&eacute;n se emplean en los enlaces de una p&aacute;gina web en los que puede hacer clic para desplazarse a otras. Tambi&eacute;n se conoce como "direcci&oacute;n de Internet" o "direcci&oacute;n web".<p>

<p><a name="bookmark"></a> <b>marcador.</b>&nbsp;Direcci&oacute;n de una p&aacute;gina web que queda almacenada en un equipo (<a href="#Uniform_Resource_Locator_(URL)">URL</a>) para facilitar el acceso a la p&aacute;gina haciendo clic en el icono del marcador en la barra Personal o seleccionando el nombre de &eacute;ste en el men&uacute; Marcadores.<p>

<A NAME="security_module"></A><A NAME="1029083"> <B>m&oacute;dulo de seguridad.</B>&nbsp; </A><A NAME="1029097"></A> Consulte <a href="glossary.html#1025197">m&oacute;dulo PKCS #11</a>.<P>

<A NAME="PKCS_11_module"></A><A NAME="1025197"> <B>m&oacute;dulo PKCS #11.</B>&nbsp; </A><A NAME="1025271"></A> Programa del equipo que gestiona los servicios criptogr&aacute;ficos, como el cifrado y el descifrado, mediante la norma PKCS #11. Tambi&eacute;n se denominan <I>m&oacute;dulos criptogr&aacute;ficos</I>, <I>proveedores de servicios criptogr&aacute;ficos</I> o <I>m&oacute;dulos de seguridad</I>; los m&oacute;dulos PKCS #11 controlan tanto a dispositivos de hardware como de software. Un m&oacute;dulo PKCS #11 siempre controla una o m&aacute;s ranuras, que pueden &igrave;mplementarse en forma de lector f&iacute;sico (por ejemplo, para la lectura de tarjetas inteligentes) o en forma de software. Cada ranura de un m&oacute;dulo PKCS #11 puede contener, a su vez, un <a href="glossary.html#1028962">dispositivo de seguridad</a> (tambi&eacute;n denominado <I>s&iacute;mbolo de seguridad</I>)<B>,</B> que es el dispositivo de hardware o software que ofrece servicios criptogr&aacute;ficos y almacena certificados y claves. El Gestor de certificados ofrece dos m&oacute;dulos PKCS #11 incorporados. Es posible instalar m&oacute;dulos adicionales en el equipo para controlar los lectores de tarjetas inteligentes u otros dispositivos de hardware.<P>

<A NAME="talkbackSDX"></A> <A NAME="talkbackIDX"></A> <A NAME="netscape_talkback"></A> <B>Netscape Quality Feedback Agent.</B>&nbsp; Peque&ntilde;o programa integrado en Netscape 7.0 que registra informaci&oacute;n t&eacute;cnica cuando el programa se cierra de manera imprevista. Tras solicitar la autorizaci&oacute;n del usuario, env&iacute;a a Netscape la informaci&oacute;n obtenida. El usuario tiene la posibilidad de describir con comentarios adicionales el comportamiento del equipo cuando se bloque&oacute;. Netscape utiliza la informaci&oacute;n recibida para subsanar errores y mejorar el rendimiento. El agente y otros servicios servicios relacionados establecen una especie "di&aacute;logo" con el usuario para ayudarle a solucionar las incidencias que se produzcan. Si desea m&aacute;s informaci&oacute;n, consulte en Internet el documento <a href="http://help.netscape.com/netscape7/qfs3.html" target="_blank">Netscape Quality Feedback System for Netscape</a>.<P>

<A NAME="subject_name"></A><A NAME="1021328"> <B>nombre del sujeto.</B>&nbsp; </A><A NAME="1021338"></A> <a href="glossary.html#1022191">Nombre distinguido (DN)</a> que describe de forma exclusiva al <a href="glossary.html#1013880">sujeto</a> de un <a href="glossary.html#1018895">certificado</a>.<P>

<A NAME="distinguished_name_(DN)"></A><A NAME="1022191"> <B>nombre distinguido (DN).</B>&nbsp; </A><A NAME="1022194"></A> Nombre con formato especial que identifica de forma exclusiva al sujeto del certificado.<P>

<A NAME="nonrepudiation"></A><A NAME="999248"> <B>no repudio.</B>&nbsp; </A><A NAME="999254"></A> Incapacidad, por parte del remitente, de negar que ha enviado el mensaje. Una firma normal escrita a mano es una de las formas de no repudio. Una <a href="glossary.html#1013995">firma digital</a> es otra.<P>

<p><a name="home_page"></a> <b>p&aacute;gina inicial.</b>&nbsp;P&aacute;gina que muestra el navegador siempre que se inicie o que se haga clic en el bot&oacute;n Inicio. Tambi&eacute;n se emplea este t&eacute;rmino para referirse a la p&aacute;gina principal de un sitio web, desde la que se puede navegar por las dem&aacute;s que lo componen.<p>

<p><a name="web_page"></a> <b>p&aacute;gina web.</b>&nbsp;Cada uno de los documentos de la World Wide Web que tiene asignada una direcci&oacute;n &uacute;nica, o URL, y que puede contener texto, hiperenlaces, gr&aacute;ficos y otros elementos.<p>

<A NAME="dual_key_pairs"></A><A NAME="1020489"> <B>pares de clave dual.</B>&nbsp; </A><A NAME="1020619"></A> Dos pares de claves p&uacute;blicas y privadas (cuatro claves en total) que corresponden a dos certificados por separado. La clave privada de un par se utiliza para las operaciones de firma, y las claves p&uacute;blica y privada del otro se utilizan para operaciones de cifrado y descifrado. Cada par corresponde a un <a href="glossary.html#1018895">certificado</a> por separado. Consulte tambi&eacute;n <a href="glossary.html#1019178">cifrado de clave p&uacute;blica</a>.<P>

<A NAME="PKCS_#11"></A><A NAME="1025194"> <B>PKCS #11.</B>&nbsp; </A><A NAME="1025195"></A> Norma de cifrado de clave p&uacute;blica que rige en dispositivos de seguridad tales como las tarjetas inteligentes. Consulte tambi&eacute;n <a href="glossary.html#1028962">dispositivo de seguridad</a> y <a href="glossary.html#1027625">tarjeta inteligente</a>.<P>

<p><a name="p3p"></a> <b>Plataforma para Preferencias de Privacidad (P3P).</b>&nbsp;Norma publicado por el World Wide Web Consortium (W3C) dise&ntilde;ado para que los usuarios puedan controlar mejor el uso que de su informaci&oacute;n personal hacen los sitios web que visitan. Si desea m&aacute;s informaci&oacute;n sobre la utilizaci&oacute;n de cookies con sitios web que admiten esta norma, consulte <a href="using_priv_help.html#privacy_levels"> C&oacute;mo se configuran los niveles de confidencialidad</a>. Si desea informaci&oacute;n general sobre la propia norma, consulte en Internet el documento <a href="http://www.w3.org/P3P/" target="_blank">P3P Public Overview</a>.<p>

<p><a name="proxy"></a> <b>proxy.</b>&nbsp;Programa que hace las veces de intermediario, o mensajero, y act&uacute;a tanto de <a href="#server">servidor</a> como de <a href="#client">cliente</a> para cursar solicitudes en nombre de otros clientes.<p>

<p><a NAME="IMAP_glossary"></a> <b>Protocolo de acceso a mensajes de Internet (IMAP).</b>&nbsp;Protocolo normativo para servidores de correo con el que el usuario puede almacenar todos los mensajes y las modificaciones que realice en ellos en el servidor en lugar de hacerlo en el disco duro del equipo. El empleo de IMAP en vez de <a href="#POP_glossary">POP</a> supone un ahorro de espacio en disco y posibilita que el usuario pueda acceder desde cualquier lugar a la totalidad de su correo, incluidas las carpetas de correo enviado, de borradores o las personalizadas. La descarga de mensajes con m&oacute;dem desde un servidor IMAP suele ser m&aacute;s r&aacute;pida que cuando &eacute;sta se realiza desde un servidor POP porque inicialmente se descargan s&oacute;lo los encabezados de los mensajes. No todos los proveedores de servicios de Internet admiten IMAP. <p>

<p><a name="Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)"></a> <a name="tcp"></a> <b>Protocolo de Control de Transmisi&oacute;n/Protocolo de Internet (TCP/IP).</b>&nbsp;Protocolo Unix que se emplea para conectar equipos que tengan instalados sistemas operativos de diversos tipos. TCP/IP es un protocolo esencial de Internet y se ha convertido en una norma internacional.<p>

<a NAME="POP_glossary"></a> <b>Protocolo de Oficina Postal (POP).</b>&nbsp;Protocolo para servidores de correo t&iacute;picos que obliga al usuario a que se descargue a su equipo los mensajes nuevos, aunque tiene la posibilidad de conservar una copia en el servidor. Con la norma POP, todo el correo, incluidos el enviado, los borradores y las carpetas personalizadas, puede almacenarse s&oacute;lo en un equipo. Por el contrario, con la norma <a href="#IMAP_glossary">IMAP</a>, el usuario puede almacenar de manera permanente en el servidor todos los mensajes y las modificaciones que realice en ellos, y acceder a su correo desde cualquier ordenador. La mayor&iacute;a de proveedores de servicios de Internet admiten POP actualmente. <p>

<p><a name="File_Transfer_Protocol_(FTP)"></a> <b>Protocolo de transferencia de archivos (FTP).</b>&nbsp;Norma que facilita a los usuarios el intercambio de archivos entre equipos a trav&eacute;s de una red. Gracias al protocolo FTP, es posible localizar archivos con el navegador.<p>

<A NAME="Online_Certificate_Status_Protocol_(OCSP)"></A><A NAME="1029304"> <B>Protocolo en l&iacute;nea de estado de certificado (OCSP).</B>&nbsp; </A><A NAME="1029312"></A> Conjunto de reglas que debe seguir el Gestor de certificados para llevar a cabo una comprobaci&oacute;n en l&iacute;nea de la validez de un certificado cada vez que &eacute;ste se utilice. Este proceso consiste en buscar el certificado en una lista de certificados v&aacute;lidos que se encuentra en un sitio web concreto. El equipo debe estar en l&iacute;nea para que funcione OCSP.<P>

<A NAME="Lightweight_Directory_Access_Protocol_(LDAP)"></A><A NAME="1022286"></A> <a NAME="LDAP_glossary"></a> <B>Protocolo ligero de acceso a directorios (LDAP).</B>&nbsp; <A NAME="1022287"></A> Protocolo para el acceso a servicios de directorio a trav&eacute;s de varias plataformas. Es posible configurar el navegador para posibilitarle el acceso a directorios LDAP del libro de direcciones. Adem&aacute;s, pueden configurarse el correo y los grupos de noticias para que se sirvan de un directorio LDAP para rellenar autom&aacute;ticamente direcciones de correo electr&oacute;nico.<P>

<A NAME="slot"></A><A NAME="1025218"> <B>ranura.</B>&nbsp; </A><A NAME="1025222"></A> Pieza de hardware, o su equivalente en software, que est&aacute; controlada por un <a href="glossary.html#1025197">m&oacute;dulo PKCS #11</a> y dise&ntilde;ada para contener un <a href="glossary.html#1028962">dispositivo de seguridad</a>. <P>

<A NAME="certificate_renewal"></A><A NAME="1031319"> <B>renovaci&oacute;n de certificado.</B>&nbsp; </A><A NAME="1031323"></A> Proceso de renovaci&oacute;n de un <a href="glossary.html#1018895">certificado</a> que est&aacute; a punto de caducar.<P>

<A NAME="server"></A><A NAME="1029749"> <B>servidor.</B>&nbsp; </A><A NAME="1029869"></A> Software (como el que sirve las p&aacute;ginas web) que recibe solicitudes y env&iacute;a informaci&oacute;n a un <a href="glossary.html#1029510">cliente</a>, el cual se ejecuta normalmente en otro equipo. El equipo en el que se ejecuta software de servidor tambi&eacute;n se denomina "servidor".<P>

<A NAME="security_token"></A><A NAME="1028905"> <B>s&iacute;mbolo relativo a la seguridad.</B>&nbsp; </A><A NAME="1028909"></A> Consulte <a href="glossary.html#1028962">dispositivo de seguridad</a>.<P>

<A NAME="token"></A><A NAME="1024528"> <B>s&iacute;mbolo de seguridad.</B>&nbsp; </A><A NAME="1024586"></A> Consulte <a href="glossary.html#1028962">dispositivo de seguridad</a>.<P>

<p><a name="web_site"></a> <b>sitio web.</b>&nbsp;Conjunto de p&aacute;ginas web relacionadas que est&aacute;n enlazadas mediante hiperv&iacute;nculos y son gestionadas por una misma persona, empresa u organizaci&oacute;n. Un sitio web se puede componer de texto, gr&aacute;ficos, archivos de audio y v&iacute;deo, y de enlaces a otros sitios.<p>

<A NAME="SSL"></A><A NAME="999533"> <B>SSL.</B>&nbsp; </A><A NAME="999539"></A> Consulte <a href="glossary.html#999463">Capa de seguridad de circuitos (SSL)</a>. <P>

<A NAME="subject"></A><A NAME="1013880"> <B>sujeto.</B>&nbsp; </A><A NAME="1013881"></A> Entidad (por ejemplo, una persona, una organizaci&oacute;n o un enrutador) a la que identifica un <a href="glossary.html#1018895">certificado</a>. En particular, el campo sujeto de un certificado contiene el <a href="glossary.html#1021328">nombre del sujeto</a> y otras caracter&iacute;sticas de la entidad certificada.<P>

<A NAME="smart_card"></A><A NAME="1027625"> <B>tarjeta inteligente.</B>&nbsp; </A><A NAME="1027626"></A> Peque&ntilde;o dispositivo que suele tener el tama&ntilde;o de una tarjeta de cr&eacute;dito, contiene un microprocesador, y es capaz de almacenar informaci&oacute;n de cifrado (como claves y certificados) y de llevar a cabo operaciones criptogr&aacute;ficas. Las tarjetas inteligentes utilizan la norma <a href="glossary.html#1025194">PKCS #11</a>. Una tarjeta inteligente es un ejemplo de <a href="glossary.html#1028962">dispositivo de seguridad</a>. <P>

<A NAME="TCP_IP)"></A> <B>TCP.</B>&nbsp; Consulte <a href="#Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)">Protocolo de Control de Transmisi&oacute;n /Protocolo de Internet (TCP/IP)</a>.<P>

<A NAME="TLS"></A><A NAME="1027427"> <B>TLS.</B>&nbsp; </A><A NAME="1027428"></A> Consulte <a href="glossary.html#999463">Capa de seguridad de circuitos (SSL)</a>.<P>

<p><a name="XSLTIDX"></a>
<p><a name="XSLT"></a> <b>Transformaci&oacute;n del lenguaje ampliable de hojas de estilo (XSLT).</b>&nbsp; Lenguaje que se emplea para convertir un documento XML en otro del mismo tipo o con un formato diferente. Si desea informaci&oacute;n sobre la compatibilidad de Netscape con XSLT, consulte <a href="cs_nav_prefs_advanced.html#Advanced">Preferencias avanzadas: avanzadas</a>.<p>

<A NAME="certificate_verification"></A><A NAME="1025527"> <B>verificaci&oacute;n de certificados.</B>&nbsp; </A><A NAME="1025531"></A> Cuando el <a href="#Certificate_Manager">Gestor de certificados</a> verifica un certificado, confirma que la firma digital la cre&oacute; una AC cuyo propio certificado de AC est&aacute; tanto almacenado en el Gestor de certificados como marcado y validado para la emisi&oacute;n de ese tipo de certificados. Tambi&eacute;n confirma que el certificado que se est&aacute; verificando no ha sido marcado como no validado. Por &uacute;ltimo, si se ha activado el <a href="glossary.html#1029304">Protocolo en l&iacute;nea de estado de certificado (OCSP)</a>, el Gestor de certificados tambi&eacute;n realiza una comprobaci&oacute;n en l&iacute;nea. Para ello, busca el certificado en una lista de certificados v&aacute;lidos que se encuentra en una URL que se especifica en el mismo certificado o en las preferencias de validaci&oacute;n del navegador. Si cualquiera de estas comprobaciones falla, el Gestor de certificados marca el certificado como no verificado y no reconoce la identidad de &eacute;ste.<P>

<p><a name="World_Wide_Web"></a> <b>World Wide Web.</b>&nbsp;Tambi&eacute;n conocida como la Web. Parte de Internet que est&aacute; integrada por las p&aacute;ginas web almacenadas en <a href="#server">servidores</a> web y que se muestran mediante <a href="#client">clientes</a> denominados "navegadores web" como, por ejemplo, Netscape Navigator.<p>




<p> [&nbsp;<A HREF="glossary.html#glossary">Volver al principio del glosario</A>&nbsp;]
</p>

<hr>
<p><i>19 de junio del 2002</i></p>
<p>Copyright &copy; 1998&ndash;2002 Netscape Communications Corporation.</p>

<BR>

</BODY>

</HTML>
