# LOCALIZATION NOTE: Do not translate <html:br/>
migratebeforestart=\u9078\u629e\u3057\u305f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u4ee5\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Netscape \u3067\u4f5c\u6210\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001%brandShortName% \u3067\u4f7f\u7528\u3059\u308b\u306b\u306f\u30b3\u30d4\u30fc\u3092\u4f5c\u6210\u3057\u3066\u304b\u3089\u5909\u63db\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002<html:br/><html:br/> \u5143\u306e Netscape \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u5909\u66f4\u304c\u52a0\u3048\u3089\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002 <html:br/><html:br/> \u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30b3\u30d4\u30fc\u3092\u4f5c\u6210\u3057\u3066\u5909\u63db\u3057\u307e\u3059\u304b\uff1f
migratebeforerename=\u9078\u629e\u3057\u305f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u4ee5\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Netscape \u3067\u4f5c\u6210\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u540d\u524d\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u30b3\u30d4\u30fc\u3092\u4f5c\u6210\u3057\u3066\u304b\u3089 %brandShortName% \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u5909\u63db\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002<html:br/><html:br/> \u5143\u306e Netscape \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u5909\u66f4\u304c\u52a0\u3048\u3089\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002 <html:br/><html:br/> \u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u5909\u63db\u3057\u307e\u3059\u304b\uff1f<html:br/><html:br/>
migratebeforedelete=\u9078\u629e\u3057\u305f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u4ee5\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Netscape \u3067\u4f5c\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002%brandShortName% \u3092\u4f7f\u3063\u3066\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30ea\u30b9\u30c8\u304b\u3089\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b\u3053\u3068\u306f\u53ef\u80fd\u3067\u3059\u304c\u3001\u304a\u4f7f\u3044\u306e\u30b7\u30b9\u30c6\u30e0\u304b\u3089\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b\u306b\u306f\u305d\u308c\u3092\u4f5c\u6210\u3057\u305f\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Netscape \u3092\u4f7f\u7528\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u624b\u4f5c\u696d\u3067\u524a\u9664\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002<html:br/><html:br/> \u5143\u306e Netscape \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u5909\u66f4\u304c\u52a0\u3048\u3089\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002<html:br/><html:br/> \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30ea\u30b9\u30c8\u304b\u3089\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f<html:br/><html:br/>



migratetitle=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u79fb\u52d5
migrateallprofilestitle=\u3059\u3079\u3066\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u79fb\u52d5
renameProfilePrompt=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb "%oldProfileName%" \u306e\u540d\u524d\u3092\u6b21\u306e\u540d\u524d\u306b\u5909\u66f4\u3059\u308b:
renameprofiletitle=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d\u3092\u5909\u66f4

deletetitle=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u524a\u9664
delete4xprofile=\u9078\u629e\u3057\u305f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u4ee5\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Netscape \u3067\u4f5c\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002%S \u304c\u7dad\u6301\u3057\u3066\u3044\u308b\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30ea\u30b9\u30c8\u304b\u3089\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b\u3053\u3068\u306f\u53ef\u80fd\u3067\u3059\u304c\u3001\u304a\u4f7f\u3044\u306e\u30b7\u30b9\u30c6\u30e0\u304b\u3089\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b\u306b\u306f\u305d\u308c\u3092\u4f5c\u6210\u3057\u305f\u30d0\u30fc\u30b8\u30e7\u30f3\u306e Netscape \u3092\u4f7f\u7528\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u624b\u4f5c\u696d\u3067\u524a\u9664\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002<html:br/><html:br/>\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb \u30ea\u30b9\u30c8\u304b\u3089\u524a\u9664\u3057\u307e\u3059\u304b\uff1f<html:br/><html:br/>
deleteprofile=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b\u3068\u3001\u4f7f\u7528\u53ef\u80fd\u306a\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30ea\u30b9\u30c8\u304b\u3089\u305d\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304c\u524a\u9664\u3055\u308c\u3001\u5fa9\u5143\u3067\u304d\u307e\u305b\u3093\u3002<html:br/>\u307e\u305f\u3001\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u30e1\u30fc\u30eb\u3001\u8a2d\u5b9a\u3001\u304a\u3088\u3073\u8a3c\u660e\u66f8\u3092\u542b\u3081\u3066\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb \u30c7\u30fc\u30bf \u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b\u3088\u3046\u306b\u9078\u629e\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3059\u308b\u3068\u3001\u300c%S\u300d\u30d5\u30a9\u30eb\u30c0\u304c\u524a\u9664\u3055\u308c\u3001\u5fa9\u5143\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002<html:br/><html:br/>\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb \u30c7\u30fc\u30bf \u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
deleteFiles=\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3059\u308b
dontDeleteFiles=\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u306a\u3044

pm_title=\u30e6\u30fc\u30b6 \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u7ba1\u7406
ps_title=\u30e6\u30fc\u30b6 \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e

pm_button=\u623b\u308b...
ps_button=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u7ba1\u7406...

startButton=%brandShortName% \u3092\u8d77\u52d5
exitButton=\u7d42\u4e86

cancel=\u30ad\u30e3\u30f3\u30bb\u30eb

invalidCharA=\u6b21\u306e\u6587\u5b57\u306f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d\u306e\u4f5c\u6210\u3042\u308b\u3044\u306f\u5909\u66f4\u6642\u306b\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093:"
invalidCharB="<html:br/><html:br/>\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u7528\u306b\u4ed6\u306e\u540d\u524d\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

profileExists=\u3053\u306e\u540d\u524d\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002\u5225\u306e\u540d\u524d\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
profileExistsTitle=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u7d42\u4e86
profDirMissing=%S \u306f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u300c%S\u300d\u3092\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u539f\u56e0:\u305d\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3080\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002<html:br/><html:br/>\u5225\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u65b0\u3057\u3044\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002

sourceProfileDirMissing=\u3053\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u79fb\u52d5\u3067\u304d\u307e\u305b\u3093\u3002\u539f\u56e0:\u305d\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u60c5\u5831\u3092\u542b\u3080\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u5225\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u65b0\u3057\u3044\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
sourceProfileDirMissingTitle=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u3042\u308a\u307e\u305b\u3093
