<?xml version='1.0' encoding='utf-8'?>
<resources>
  <string name="action_cancel">မလုပ်ဆောင်တော့ပါ</string>
  <string name="action_ok">ကောင်းပြီ</string>
  <string name="urlbar_hint">ရှာဖွေပါ သို့မဟုတ် လိပ်စာရိုက်ပါ</string>
  <string name="teaser">အလိုအလျောက် တစ်ကိုယ်ရေသုံး၊ \nသုံးပြီးဖျက်</string>
  <string name="feedback_erase">သင့် ဘယောက်ဆာသုံး မှတ်တမ်းဖျက်ပြီး</string>
  <string name="search_hint">%1$s ကိုရှာမယ်</string>
  <string name="menu_share">မျှဝေပါ…</string>
  <string name="menu_open_with_default_browser">%1$s ဖြင့်ဖွင့်</string>
  <string name="menu_open_with_a_browser">…တွင် ဖွင့်ရန်</string>
  <string name="menu_settings">အပြင်အဆင်များ</string>
  <string name="menu_about">အကြောင်း</string>
  <string name="menu_help">အကူအညီ</string>
  <string name="menu_rights">သင်၏ အခွင့်အရေးများ</string>
  <string name="menu_trackers_blocked_title">နောက်ယောင်ခံများကို တားဆီးထား</string>
  <string name="share_dialog_title">မျှဝေရန်</string>
  <string name="notification_erase_text">ကြည့်ရှုမှုမှတ်တမ်းကို ရှင်းလင်းရန်</string>
  <string name="shortcut_erase_short_label">ရှင်းလင်းရန်</string>
  <string name="shortcut_erase_long_label">ကြည့်ရှုမှုမှတ်တမ်းကို ရှင်းလင်းရန်</string>
  <string name="text_selection_search_action">သီးသန့်လုံခြုံစွာ ရှာဖွေပါ</string>
  <string name="about_content"><![CDATA[<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">%1$s &#4126;&#4106;&#4154; &#4126;&#4100;&#4151;&#4154;&#4096;&#4141;&#4143; &#4113;&#4141;&#4116;&#4154;&#4152;&#4097;&#4155;&#4143;&#4117;&#4154;&#4121;&#4158;&#4143; &#4117;&#4145;&#4152;&#4113;&#4140;&#4152;&#4117;&#4139;&#4126;&#4106;&#4154;&#4171;</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"&#4126;&#4142;&#4152;&#4126;&#4116;&#4151;&#4154;&#4112;&#4101;&#4154;&#4096;&#4141;&#4143;&#4122;&#4154;&#4123;&#4145;&#4126;&#4143;&#4150;&#4152; &#4120;&#4123;&#4145;&#4140;&#4100;&#4154;&#4103;&#4140;&#4129;&#4116;&#4145;&#4116;&#4158;&#4100;&#4151;&#4154; &#4129;&#4126;&#4143;&#4150;&#4152;&#4117;&#4156;&#4143;&#4117;&#4139;\n  "<ul>"\n    "<li>&#4123;&#4158;&#4140;&#4118;&#4157;&#4145;&#4096;&#4156;&#4106;&#4151;&#4154;&#4123;&#4158;&#4143;&#4117;&#4139;</li>"\n    "<li>&#4116;&#4145;&#4140;&#4096;&#4154;&#4122;&#4145;&#4140;&#4100;&#4154;&#4097;&#4150;&#4121;&#4155;&#4140;&#4152;&#4096;&#4141;&#4143; &#4112;&#4140;&#4152;&#4102;&#4142;&#4152;&#4117;&#4139; (&#4126;&#4141;&#4143;&#4151;&#4121;&#4127;&#4143;&#4112;&#4154; &#4116;&#4145;&#4140;&#4096;&#4154;&#4122;&#4145;&#4140;&#4100;&#4154;&#4097;&#4150;&#4121;&#4155;&#4140;&#4152;&#4096;&#4141;&#4143; &#4097;&#4157;&#4100;&#4151;&#4154;&#4117;&#4156;&#4143;&#4123;&#4116;&#4154; &#4126;&#4112;&#4154;&#4121;&#4158;&#4112;&#4154;&#4117;&#4156;&#4100;&#4154;&#4102;&#4100;&#4154;&#4117;&#4139;)</li>"\n    "<li>&#4096;&#4157;&#4112;&#4154;&#4096;&#4142;&#4152;&#4121;&#4155;&#4140;&#4152;&#4170; &#4123;&#4158;&#4140;&#4118;&#4157;&#4145;&#4096;&#4156;&#4106;&#4151;&#4154;&#4123;&#4158;&#4143;&#4121;&#4158;&#4143;&#4121;&#4158;&#4112;&#4154;&#4112;&#4121;&#4154;&#4152;&#4121;&#4155;&#4140;&#4152;&#4096;&#4141;&#4143; &#4123;&#4158;&#4100;&#4154;&#4152;&#4124;&#4100;&#4154;&#4152;&#4117;&#4139;</li>"\n  "</ul>\n</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">%1$s &#4096;&#4141;&#4143; Mozilla &#4121;&#4158; &#4113;&#4143;&#4112;&#4154;&#4124;&#4143;&#4117;&#4154;&#4117;&#4139;&#4126;&#4106;&#4154;&#4171; &#4096;&#4155;&#4157;&#4116;&#4154;&#4143;&#4117;&#4154;&#4112;&#4141;&#4143;&#4151;&#4175; &#4123;&#4106;&#4154;&#4121;&#4158;&#4116;&#4154;&#4152;&#4097;&#4155;&#4096;&#4154;&#4126;&#4106;&#4154; &#4096;&#4145;&#4140;&#4100;&#4154;&#4152;&#4121;&#4157;&#4116;&#4154;&#4117;&#4157;&#4100;&#4151;&#4154;&#4124;&#4100;&#4154;&#4152;&#4126;&#4145;&#4140; &#4129;&#4100;&#4154;&#4112;&#4140;&#4116;&#4096;&#4154;&#4096;&#4141;&#4143; &#4112;&#4106;&#4154;&#4102;&#4145;&#4140;&#4096;&#4154;&#4123;&#4116;&#4154; &#4118;&#4156;&#4101;&#4154;&#4126;&#4106;&#4154;&#4171;<br/>\n<a href="%2$s">Learn more</a></p>]]></string>
  <string name="preference_category_search">ရှာဖွေရန်</string>
  <string name="preference_search_engine_default">မူလသတ်မှတ်ချက်</string>
  <string name="preference_language">ဘာသာစကား</string>
  <string name="preference_language_systemdefault">စနစ် သတ်မှတ်ချက်</string>
  <string name="preference_dialog_title_search_engine">မူသေရှာဖွေရေး</string>
  <string name="preference_category_privacy">ကိုယ်ပိုင်လွတ်လပ်ခွင့်</string>
  <string name="preference_privacy_block_ads">ကြော်ငြာနောက်ယောက်ခံ ကိရိယာများကို ပိတ်ပင်ပါ</string>
  <string name="preference_privacy_block_analytics">သရုပ်ခွဲလေ့လာသည့် နောက်ယောင်ခံကိရိယာများကို ပိတ်ပင်ပါ</string>
  <string name="preference_privacy_block_social">လူမှုမီဒီယာ နောက်ယောင်ခံကိရိယာများကို ပိတ်ပင်ပါ</string>
  <string name="preference_privacy_block_content">အခြားသော အကြောင်းအရာနောက်ယောက်ခံကိရိယာများကို ပိတ်ပင်ပါ</string>
  <string name="preference_privacy_block_content_summary">အချို့သော ဗီဒီယိုများနှင့် ဝဘ်စာမျက်နှာများကို ထိခိုက်စေသည်</string>
  <string name="preference_privacy_secure_mode">တိတ်တဆိတ်အသုံးပြုမှု</string>
  <string name="preference_category_performance">လုပ်ဆောင်မှု</string>
  <string name="preference_performance_block_webfonts">ဝဘ်ဖောင့်များကို ပိတ်ပင်ပါ</string>
  <string name="preference_performance_block_webfonts_summary">အိုင်ကွန်များ သို့မဟုတ် ရုပ်ပုံများမပေါ်ခြင်း ဖြစ်စေနိုင်သည်</string>
  <string name="preference_performance_block_images">ရုပ်ပုံများကို မပြပါနှင့်</string>
  <string name="preference_default_browser">ပုံသေအသုံးပြုမည့် ဘရောင်ဇာအဖြစ် သတ်မှတ်ပါ</string>
  <string name="preference_category_mozilla">Mozilla</string>
  <string name="preference_mozilla_telemetry">အမျိုးအမည်မဲ့ အသုံးပြုမှု အချက်အလက်များကို ပေးပို့ရန်</string>
  <string name="preference_mozilla_telemetry_summary">ပိုမိုလေ့လာရန်</string>
  <string name="preference_about">%1$s အကြောင်း</string>
  <string name="content_description_clear_input">Input ကို ရှင်းလင်းရန်</string>
  <string name="content_description_dismiss_input">ပိတ်ရန်</string>
  <string name="content_description_erase">ကြည့်ရှုမှုမှတ်တမ်းကို ရှင်းလင်းရန်</string>
  <string name="content_description_lock">လုံခြုံသော ချိတ်ဆက်မှု</string>
  <string name="accessibility_announcement_loading">ဆောင်ရွက်နေသည်</string>
  <string name="accessibility_announcement_loading_finished">ဝဘ်ဆိုက်ကို ဖွင့်ပြီးပြီ</string>
  <string name="content_description_menu">နောက်ထပ် ရွေးချယ်စရာများ</string>
  <string name="content_description_forward">ရှေ့သို့ သွားပါ</string>
  <string name="content_description_reload">ဝဘ်ဆိုက်ကို ပြန်ဖွင့်ပါ</string>
  <string name="content_description_back">နောက်သို့ သွားပါ</string>
  <string name="content_description_stop">ဝဘ်ဆိုက်ဖွင့်ခြင်းကို ရပ်ပါ</string>
  <string name="content_description_customtab_exit">အရင်ကအက်ပ်သို့ သွားပါ</string>
  <string name="content_description_blocking_switch">နောက်ယောင်ခံများကို တားဆီးပါ</string>
  <string name="context_menu_paste_go">ပွားပြီး ၎င်းသို့ သွားပါ</string>
  <string name="your_rights">သင်၏ အခွင့်အရေးများ</string>
  <string name="external_app_prompt_title">အခြားအက်ပ်တွင် လင့်ခ်ကို ဖွင့်ပါ</string>
  <string name="external_app_prompt">%2$s တွင် ယခုလင့်ခ်ကို ဖွင့်ရန် %1$s ထံမှ ထွက်ခွာနိုင်ပါသည်။</string>
  <string name="external_app_prompt_no_app_title">လင့်ခ်ကို ဖွင့်နိုင်သော အက်ပ်ကို ရှာပါ</string>
  <string name="external_app_prompt_no_app">ယခုလင့်ခ်ကို ကိရိယာရှိ မည်သည့်အက်ပ်မျှ မဖွင့်နိုင်ပါ။ ၎င်းကို ဖွင့်နိုင်သည့်အက်ပ် %2$s တွင် ရှာဖွေရန် %1$s ထံမှ ထွက်ခွာနိုင်ပါသည်။</string>
  <string name="external_multiple_apps_matched_exit">လုံခြုံစွာ ဝဘ်ဆိုက်ကြည့်ရှုခြင်းမှ ထွက်ပါမည်လား။</string>
  <string name="errorpage_title">စာမျက်နှာဖွင့်လှစ်မှု အမှား</string>
  <string name="errorpage_refresh">ထပ်မံ ဆောင်ရွက်ကြည့်ပါ</string>
  <string name="error_connectionfailure_title">မချိတ်ဆက်နိုင်ပါ</string>
  <string name="error_connectionfailure_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li>&#4122;&#4097;&#4143;&#4125;&#4120;&#4154;&#4102;&#4141;&#4143;&#4096;&#4154;&#4096;&#4141;&#4143; &#4122;&#4140;&#4122;&#4142; &#4129;&#4126;&#4143;&#4150;&#4152;&#4121;&#4117;&#4156;&#4143;&#4116;&#4141;&#4143;&#4100;&#4154;&#4117;&#4139; &#4126;&#4141;&#4143;&#4151;&#4121;&#4127;&#4143;&#4112;&#4154; &#4129;&#4126;&#4143;&#4150;&#4152;&#4117;&#4156;&#4143;&#4126;&#4144; &#4121;&#4155;&#4140;&#4152;&#4116;&#4145;&#4126;&#4145;&#4140;&#4096;&#4156;&#4145;&#4140;&#4100;&#4151;&#4154; &#4118;&#4156;&#4101;&#4154;&#4116;&#4141;&#4143;&#4100;&#4154;&#4126;&#4106;&#4154;&#4171;</li>"\n        "<li>&#4129;&#4096;&#4122;&#4154;&#4173; &#4126;&#4100;&#4154;&#4126;&#4106;&#4154; &#4121;&#4106;&#4154;&#4126;&#4106;&#4151;&#4154;&#4125;&#4120;&#4154;&#4102;&#4141;&#4143;&#4096;&#4154;&#4121;&#4155;&#4158; &#4121;&#4118;&#4157;&#4100;&#4151;&#4154;&#4116;&#4141;&#4143;&#4100;&#4154;&#4117;&#4139;&#4096; &#4126;&#4100;&#4151;&#4154;&#4121;&#4141;&#4143;&#4120;&#4141;&#4143;&#4100;&#4154;&#4152;&#4096;&#4141;&#4123;&#4141;&#4122;&#4140;&#4175; &#4114;&#4145;&#4112;&#4140; &#4126;&#4141;&#4143;&#4151;&#4121;&#4127;&#4143;&#4112;&#4154; &#4125;&#4141;&#4143;&#4100;&#4154;&#4118;&#4141;&#4143;&#4100;&#4154; &#4097;&#4155;&#4141;&#4112;&#4154;&#4102;&#4096;&#4154;&#4121;&#4158;&#4143;&#4096;&#4141;&#4143; &#4101;&#4101;&#4154;&#4102;&#4145;&#4152;&#4117;&#4139;&#4171;</li>"\n      "</ul>]]></string>
  <string name="error_timeout_title">ချိတ်ဆက်မှုသည် သတ်မှတ်ချိန် ကျော်လွန်ခဲ့သည်</string>
  <string name="error_hostLookup_title">ဆာဗာကို မတွေ့ပါ</string>
  <string name="error_hostLookup_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li>"&#4129;&#4145;&#4140;&#4096;&#4154;&#4117;&#4139;&#4096;&#4146;&#4151;&#4126;&#4141;&#4143;&#4151; &#4101;&#4140;&#4123;&#4141;&#4143;&#4096;&#4154;&#4129;&#4121;&#4158;&#4140;&#4152;&#4121;&#4155;&#4140;&#4152; &#4123;&#4158;&#4141;/&#4121;&#4123;&#4158;&#4141; &#4124;&#4141;&#4117;&#4154;&#4101;&#4140;&#4096;&#4141;&#4143; &#4101;&#4101;&#4154;&#4102;&#4145;&#4152;&#4117;&#4139;\n          "<strong>ww</strong>".example.com &#4127;&#4143; &#4121;&#4158;&#4140;&#4152;&#4123;&#4145;&#4152;&#4113;&#4140;&#4152;&#4097;&#4156;&#4100;&#4154;&#4152;\n          "<strong>www</strong>.example.com</li>"\n        "<li>&#4126;&#4100;&#4154;&#4126;&#4106;&#4154; &#4121;&#4106;&#4154;&#4126;&#4106;&#4151;&#4154;&#4125;&#4120;&#4154;&#4102;&#4141;&#4143;&#4096;&#4154;&#4121;&#4155;&#4158; &#4121;&#4118;&#4157;&#4100;&#4151;&#4154;&#4116;&#4141;&#4143;&#4100;&#4154;&#4117;&#4139;&#4096; &#4126;&#4100;&#4151;&#4154;&#4096;&#4141;&#4123;&#4141;&#4122;&#4140;&#4175; &#4114;&#4145;&#4112;&#4140; &#4126;&#4141;&#4143;&#4151;&#4121;&#4127;&#4143;&#4112;&#4154; &#4125;&#4141;&#4143;&#4100;&#4154;&#4118;&#4141;&#4143;&#4100;&#4154; &#4097;&#4155;&#4141;&#4112;&#4154;&#4102;&#4096;&#4154;&#4121;&#4158;&#4143;&#4096;&#4141;&#4143; &#4101;&#4101;&#4154;&#4102;&#4145;&#4152;&#4117;&#4139;&#4171;</li>"\n      "</ul>]]></string>
  <string name="error_malformedURI_title">လိပ်စာမှားနေသည်</string>
  <string name="error_malformedURI_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>"&#4125;&#4120;&#4154;&#4124;&#4141;&#4117;&#4154;&#4101;&#4140;&#4121;&#4155;&#4140;&#4152;&#4096;&#4141;&#4143; &#4117;&#4143;&#4150;&#4121;&#4158;&#4116;&#4154;&#4129;&#4140;&#4152;&#4118;&#4156;&#4100;&#4151;&#4154; "<strong>http://www.example.com/</strong>" &#4096;&#4146;&#4151;&#4126;&#4141;&#4143;&#4151; &#4123;&#4145;&#4152;&#4124;&#4145;&#4151;&#4123;&#4158;&#4141;&#4126;&#4106;&#4154;"</li>"\n  "<li>"&#4123;&#4158;&#4145;&#4151;&#4122;&#4141;&#4143;&#4100;&#4154;&#4121;&#4155;&#4105;&#4154;&#4152;&#4101;&#4145;&#4140;&#4100;&#4154;&#4152;&#4096;&#4141;&#4143; &#4129;&#4126;&#4143;&#4150;&#4152;&#4117;&#4156;&#4143;&#4113;&#4140;&#4152;&#4097;&#4156;&#4100;&#4154;&#4152; &#4127;&#4143;&#4112;&#4154;/&#4121;&#4127;&#4143;&#4112;&#4154; &#4101;&#4101;&#4154;&#4102;&#4145;&#4152;&#4117;&#4139;&#4171; (&#4116;&#4121;&#4144;&#4116;&#4140; "<strong>/</strong>)</li>\n</ul>]]></string>
  <string name="error_redirectLoop_title">ယခုစာမျက်နှာသည် ကောင်းမွန်စွာ လမ်းညွှန်မပေးနိုင်ပါ</string>
  <string name="error_redirectLoop_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#4096;&#4157;&#4112;&#4154;&#4096;&#4142;&#4152;&#4129;&#4126;&#4143;&#4150;&#4152;&#4117;&#4156;&#4143;&#4121;&#4158;&#4143; &#4117;&#4141;&#4112;&#4154;&#4113;&#4140;&#4152;&#4097;&#4156;&#4100;&#4154;&#4152; &#4126;&#4141;&#4143;&#4151;&#4121;&#4127;&#4143;&#4112;&#4154; &#4124;&#4096;&#4154;&#4121;&#4097;&#4150;&#4097;&#4156;&#4100;&#4154;&#4152; &#4101;&#4126;&#4106;&#4154;&#4112;&#4141;&#4143;&#4151;&#4126;&#4106;&#4154; &#4112;&#4101;&#4154;&#4097;&#4139;&#4112;&#4101;&#4154;&#4123;&#4150; &#4122;&#4097;&#4143;&#4117;&#4156;&#4159;&#4116;&#4140;&#4096;&#4141;&#4143; &#4118;&#4156;&#4101;&#4154;&#4117;&#4145;&#4139;&#4154;&#4101;&#4145;&#4116;&#4141;&#4143;&#4100;&#4154;&#4126;&#4106;&#4154;&#4171;</li>\n</ul>]]></string>
  <string name="error_unsupportedprotocol_title">လိပ်စာကို နားမလည်ပါ</string>
  <string name="error_unsupportedprotocol_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#4122;&#4097;&#4143;&#4124;&#4141;&#4117;&#4154;&#4101;&#4140;&#4096;&#4141;&#4143; &#4118;&#4157;&#4100;&#4151;&#4154;&#4123;&#4116;&#4154; &#4129;&#4097;&#4156;&#4140;&#4152;&#4102;&#4145;&#4140;&#4151;&#4118;&#4154;&#4125;&#4146;&#4124;&#4154; &#4112;&#4117;&#4154;&#4102;&#4100;&#4154;&#4123;&#4116;&#4154; &#4124;&#4141;&#4143;&#4129;&#4117;&#4154;&#4096;&#4145;&#4140;&#4100;&#4154;&#4152; &#4124;&#4141;&#4143;&#4129;&#4117;&#4154;&#4116;&#4141;&#4143;&#4100;&#4154;&#4126;&#4106;&#4154;&#4171;</li>\n</ul>]]></string>
  <string name="error_sslhandshake_title">လုံခြုံသော ချိတ်ဆက်မှု မအောင်မြင်ခဲ့ပါ</string>
  <string name="error_sslhandshake_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#4122;&#4097;&#4143;&#4117;&#4156;&#4159;&#4116;&#4140;&#4126;&#4106;&#4154; &#4102;&#4140;&#4119;&#4140;&#4175; &#4129;&#4117;&#4156;&#4100;&#4154;&#4129;&#4102;&#4100;&#4154;&#4096;&#4156;&#4145;&#4140;&#4100;&#4151;&#4154; &#4126;&#4141;&#4143;&#4151;&#4121;&#4127;&#4143;&#4112;&#4154; &#4112;&#4101;&#4154;&#4122;&#4145;&#4140;&#4096;&#4154;&#4122;&#4145;&#4140;&#4096;&#4154;&#4126;&#4106;&#4154; &#4102;&#4140;&#4119;&#4140; &#4129;&#4122;&#4145;&#4140;&#4100;&#4154;&#4102;&#4145;&#4140;&#4100;&#4154;&#4116;&#4145;&#4126;&#4145;&#4140;&#4096;&#4156;&#4145;&#4140;&#4100;&#4151;&#4154; &#4118;&#4156;&#4101;&#4154;&#4116;&#4141;&#4143;&#4100;&#4154;&#4126;&#4106;&#4154;&#4171;</li>"\n  "<li>&#4129;&#4096;&#4122;&#4154;&#4173; &#4126;&#4100;&#4154;&#4126;&#4106;&#4154; &#4129;&#4123;&#4100;&#4154;&#4096; &#4122;&#4097;&#4143;&#4102;&#4140;&#4119;&#4140;&#4096;&#4141;&#4143; &#4097;&#4155;&#4141;&#4112;&#4154;&#4102;&#4096;&#4154;&#4097;&#4146;&#4151;&#4118;&#4144;&#4152;&#4117;&#4139;&#4096; &#4122;&#4097;&#4143;&#4117;&#4156;&#4159;&#4116;&#4140;&#4126;&#4106;&#4154; &#4122;&#4140;&#4122;&#4142; &#4118;&#4156;&#4101;&#4154;&#4116;&#4141;&#4143;&#4100;&#4154;&#4126;&#4106;&#4154;&#4170; &#4116;&#4145;&#4140;&#4100;&#4154;&#4112;&#4157;&#4100;&#4154; &#4117;&#4156;&#4116;&#4154;&#4124;&#4106;&#4154;&#4097;&#4155;&#4141;&#4112;&#4154;&#4102;&#4096;&#4154;&#4096;&#4156;&#4106;&#4151;&#4154;&#4117;&#4139;&#4171;</li>\n</ul>]]></string>
  <string name="error_generic_title">Oops</string>
  <string name="error_generic_message">အခြားအကြောင်းအရာများ ရှိသောကြောင့် ယခုစာမျက်နှာကို မဖွင့်နိုင်ပါ။</string>
  <string name="contextmenu_link_share">လင့်ခ်ကို မျှဝေရန်</string>
  <string name="contextmenu_link_copy">လင့်ခ်လိပ်စာကို ကူးပါ</string>
  <string name="contextmenu_image_share">ရုပ်ပုံကို မျှဝေရန်</string>
  <string name="contextmenu_image_copy">ရုပ်ပုံလိပ်စာကို ကူးပါ</string>
  <string name="contextmenu_image_save">ရုပ်ပုံကို သိမ်းရန်</string>
  <string name="contextmenu_image_warning"><![CDATA["သင် %1$s မှတ်တမ်းကို ရှင်းလင်းသည့်အခါ သိမ်းထားသော သို့မဟုတ် မျှဝေထားသော ရုပ်ပုံများကို "<b xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">&#4121;&#4118;&#4155;&#4096;&#4154;&#4117;&#4139;</b>။]]></string>
  <string name="firstrun_tracking_title">မည်သူမျှစောင့်ကြည့်မနေသကဲ့သို့ အသုံးပြုပါ</string>
  <string name="firstrun_tracking_text">ကြည့်ရှုနေစဉ် အွန်လိုင်းနောက်ယောင်ခံများကို အလိုအလျောက် တားဆီးသည်။ ထို့နောက် ကြည့်ရှုခဲ့သော ဝဘ်စာမျက်နှာများနှင့် ကွတ်ကီးများကို အက်ပ်ရှိ သို့မဟုတ် အသိပေးချက်များထဲရှိ အမှိုက်ပုံးပုံငယ်ကို တို့ထိပြီး ရှင်းလင်းပါ။</string>
  <string name="firstrun_defaultbrowser_title">ကိုယ်ရေးကာကွယ်မှုကို တိုးမြှင့်ပါ</string>
  <string name="firstrun_defaultbrowser_text">%1$s ကို မူသေအသုံးပြု ဘရောင်ဇာအဖြစ် သတ်မှတ်ပါ။ ထို့ပြင် အခြား Android အက်ပ်များထံမှ လင့်ခ်များကို ကြည့်ရှုရာတွင် ကိုယ်ရေးအချက်အလက်ကာကွယ်ပြီး ကြည့်ရှုခြင်း၏ အကျိုးကျေးဇူးများနှင့်အတူ အသုံးပြုပါ။</string>
  <string name="firstrun_breaking_title">အောက်ပါထဲမှ တစ်ခုခု ဖြစ်လျှင် အမြန်ပြင်ဆင်မှု\nပိတ်ပင်ထားခြင်း = ပျက်ဆီးခြင်း</string>
  <string name="firstrun_breaking_text">အွန်လိုင်းနောက်ယောင်ခံများကို တားဆီးခြင်းသည် ဝဘ်ဆိုက်ကို ကောင်းမွန်စွာ မဆောင်ရွက်နိုင်စေပါက ကိရိယာမီနူးတွင် တို့ထိပြီး နောက်ယောင်ခံတားဆီးမှုကို ပိတ်နိုင်သည်။</string>
  <string name="firstrun_close_button">ကောင်းပြီ၊ ရပါပြီ။</string>
  <string name="firstrun_skip_button">ကျော်ရန်</string>
  <string name="firstrun_next_button">ရှေ့သို့</string>
</resources>
