## S/MIME error strings.
## Note to localization: %S is a placeholder
NoSenderSigningCert=Vous avez sp\u00e9cifi\u00e9 que ce message doit \u00eatre sign\u00e9 num\u00e9riquement, mais l'application n'a pas trouv\u00e9 le certificat de signature indiqu\u00e9 dans vos pr\u00e9f\u00e9rens de compte de messagerie et forums ou le certificat a expir\u00e9.
NoSenderEncryptionCert=Vous avez sp\u00e9cifi\u00e9 le chiffrement de ce message, mais l'application n'a pas trouv\u00e9 le certificat de chiffrement indiqu\u00e9 dans vos pr\u00e9f\u00e9rens de compte de messagerie et forums ou le certificat a expir\u00e9.
MissingRecipientEncryptionCert=Vous avez sp\u00e9cifi\u00e9 le chiffrement de ce message, mais l'application n'a pas trouv\u00e9 de certificat de chiffrement pour %S.
SignNoSenderEncryptionCert=Vous avez sp\u00e9cifi\u00e9 que ce message doit \u00eatre sign\u00e9 num\u00e9riquement, mais l'application n'a pas trouv\u00e9 de certificat de chiffrement \u00e0 inclure dans le message sign\u00e9 ou le certificat a expir\u00e9.
ErrorCanNotEncrypt=Impossible chiffrer le message. V\u00e9rifiez que vous avez un certificat de message valide pour chaque destinataire. Assurez-vous que les certificats sp\u00e9cifi\u00e9s dans les param\u00e8tres du compte de messagerie et forums pour ce compte de messagerie sont valides et s\u00e9curis\u00e9s.
ErrorCanNotSign=Impossible de signer le message. Assurez-vous que les certificats sp\u00e9cifi\u00e9s dans les param\u00e8tres du compte de messagerie et forums pour ce compte de messagerie sont valides et s\u00e9curis\u00e9s

## Strings used for in the prefs.
prefPanel-smime=S\u00e9curit\u00e9
NoSigningCert=Le Gestionnaire de certificats ne peut pas localiser un certificat valide utilisable pour signer num\u00e9riquement vos messages.
NoEncryptionCert=Le Gestionnaire de certificats ne peut pas localiser un certificat valide utilisable par d'autres personnes pour vous envoyer des messages \u00e9lectroniques chiffr\u00e9s.

encryption_needCertWantSame=Avant de pouvoir signer des messages num\u00e9riquement, vous devez \u00e9galement sp\u00e9cifier un certificat utilisable par d'autres personnes pour vous envoyer des messages chiffr\u00e9s. Souhaitez-vous utiliser le m\u00eame certificat pour chiffrer et d\u00e9chiffrer les messages entrants ?
encryption_wantSame=Souhaitez-vous utiliser le m\u00eame certificat pour chiffrer et d\u00e9chiffrer les messages entrants ?
encryption_needCertWantToSelect=Avant de pouvoir signer des messages num\u00e9riquement, vous devez \u00e9galement sp\u00e9cifier un certificat utilisable par d'autres personnes pour vous envoyer des messages chiffr\u00e9s. Souhaitez-vous configurer un certificat de chiffrement maintenant ?
signing_needCertWantSame=Vous devez \u00e9galement sp\u00e9cifier un certificat \u00e0 utiliser pour signer vos messages num\u00e9riquement. Souhaitez-vous utiliser le m\u00eame certificat pour signer vos messages num\u00e9riquement ?
signing_wantSame=Souhaitez-vous utiliser le m\u00eame certificat pour signer vos messages num\u00e9riquement ?
signing_needCertWantToSelect=Vous devez \u00e9galement sp\u00e9cifier un certificat \u00e0 utiliser pour signer vos messages num\u00e9riquement. Souhaitez-vous configurer un certificat pour signer vos messages num\u00e9riquement maintenant ?
