#
# The contents of this file are subject to the Mozilla Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#

SignedBy=Unterzeichnet von %s
CertPassPrompt=Bitte geben Sie das pers\u00f6nliche SicherheitsPasswort f\u00fcr die Sicherheitseinrichtung f\u00fcr PSM-Privatschl\u00fcssel ein.

#These are for dialogs
#Download Cert dialog
newCAMessage1=M\u00f6chten Sie "%S" f\u00fcr die folgenden Zwecke akzeptieren?
unnamedCA=Zertifikatsaussteller (ohne Namen)

#For editing cert trust
editTrustWindowTitle=Zertifikatsvertrauenseinstellungen bearbeiten
editTrustCA=Das Zertifikat "%S" steht f\u00fcr einen Zertifikatsaussteller.
editTrustSSL=Das Zertifikat "%s" wurde ausgestellt von:
issuerNotTrusted=Da Sie dem Aussteller dieses Zertifikats nicht vertrauen, wird auch die Authentizit\u00e4t dieses Zertifikats nicht anerkannt, sofern Sie hier keine anderen Angaben machen.
issuerTrusted=Da Sie dem Aussteller dieses Zertifikats vertrauen, wird auch die Authentizit\u00e4t dieses Zertifikats anerkannt, sofern Sie hier keine anderen Angaben machen.
issuerNotKnown=Da Sie den Aussteller dieses Zertifikats nicht kennen, wird die Authentizit\u00e4t dieses Zertifikats nicht anerkannt, sofern Sie hier keine anderen Angaben machen.
issuerCertNotFound=Das Zertifikat f\u00fcr diesen Zertifikatsaussteller wurde nicht gefunden

#For Deleting Certificates
deleteSslCertFlag=deleteSslFlag
deleteSslCertConfirm=M\u00f6chten Sie diese Web-Site-Zertifikate wirklich l\u00f6schen?
deleteSslCertImpact=Wenn Sie ein Web-Site-Zertifikat l\u00f6schen, werden Sie beim n\u00e4chsten Aufruf der Web-Site erneut gefragt, ob Sie das Zertifikat akzeptieren.
deleteSslCertTitle=Web-Site-Zertifikate l\u00f6schen

deleteUserCertFlag=deleteUserFlag
deleteUserCertConfirm=M\u00f6chten Sie diese Zertifikate wirklich l\u00f6schen?
deleteUserCertImpact=Wenn Sie eines Ihrer eigenen Zertifikate l\u00f6schen, k\u00f6nnen Sie dieses nicht mehr zu Ihrer Identifikation verwenden.
deleteUserCertTitle=Ihre Zertifikate l\u00f6schen

deleteCaCertFlag=deleteCaFlag
deleteCaCertConfirm=M\u00f6chten Sie diese ZA-Zertifikate wirklich l\u00f6schen?
deleteCaCertImpact=Wenn Sie ein Zertifikat eines Zertifikatsausstellers (ZA) l\u00f6schen, akzeptiert Ihr Browser keine von diesem ZA ausgestellten Zertifikate mehr.
deleteCaCertTitle=ZA-Zertifikate l\u00f6schen

deleteEmailCertFlag=deleteEmailFlag
deleteEmailCertConfirm=Sind Sie sicher, dass Sie die eMail-Zertifikate dieser Personen l\u00f6schen m\u00f6chten?
deleteEmailCertImpact=Wenn Sie ein eMail-Zertifikat l\u00f6schen, k\u00f6nnen Sie keine verschl\u00fcsselten eMails mehr an diese Personen senden..
deleteEmailCertTitle=eMail-Zertifikate l\u00f6schen


#PKCS#12 file dialogs
chooseP12RestoreFileDialog=Name der wiederherzustellenden Datei
chooseP12BackupFileDialog=Name der zu sichernden Datei

#Mismatch Domain Dialg
mismatchDomainMsg1=Sie haben versucht, eine Verbindung zu "%S" herzustellen.  Das \u00fcbermittelte Sicherheitszertifikat geh\u00f6rt jedoch zu "%S".  Es ist m\u00f6glich, wenn auch unwahrscheinlich, dass jemand Ihre Kommunikation mit dieser Web-Site abh\u00f6rt.
mismatchDomainMsg2=Wenn Sie vermuten, dass das angezeigte Zertifikat nicht zu "%S" geh\u00f6rt, brechen Sie die Verbindung ab und benachrichtigen Sie den Site-Administrator.

#Server Cert expired
serverCertExpiredMsg1=Die Site "%S" benutzt ein Sicherheitszertifikat zur Verschl\u00fcsselung der \u00fcbertragenen Daten, das Zertifikat ist jedoch am %S verfallen.
serverCertExpiredTitle=Server-Zertifikat abgelaufen
serverCertNotYetValedMsg1=Die Site "%S" benutzt ein Sicherheitszertifikat zur Verschl\u00fcsselung der \u00fcbertragenen Daten, das Zertifikat tritt jedoch erst am %S in Kraft.
serverCertNotYetValidTitle=Server-Zertifikat noch nicht g\u00fcltig
serverCertExpiredMsg2=Bitte \u00fcberpr\u00fcfen Sie, ob Zeit und Datum (derzeit %S) auf Ihrem Computer korrekt eingestellt sind.

#Preferences
resetPreferences=Mit Hilfe dieser Schaltfl\u00e4che setzen Sie die Sicherheitseinstellungen f\u00fcr %S auf die Vorgaben des Herstellers zur\u00fcck.

#Cert verification
certVerified=Dieses Zertifikat wurde f\u00fcr folgende Zwecke zugelassen:
certNotVerified_CertRevoked=Zertifikat konnte nicht zugelassen werden, da es zur\u00fcckgezogen wurde.
certNotVerified_CertExpired=Zertifikat konnte nicht zugelassen werden, da es verfallen ist.
certNotVerified_CertNotTrusted=Zertifikat konnte nicht zugelassen werden, da es nicht akzeptiert wird.
certNotVerified_IssuerNotTrusted=Zertifikat konnte nicht zugelassen werden, da der Aussteller nicht akzeptiert wird.
certNotVerified_IssuerUnknown=Zertifikat konnte nicht zugelassen werden, da der Aussteller unbekannt ist.
certNotVerified_CAInvalid=Zertifikat konnte nicht zugelassen werden, da das Zertifikat des Ausstellers ung\u00fcltig ist.
certNotVerified_Unknown=Zertifikat konnte aus unbekannten Gr\u00fcnden nicht zugelassen werden.

#Client auth
clientAuthMessage1=Firma: "%S"
clientAuthMessage2=Ausgestellt unter: "%S"

#Page Info
pageInfo_SiteNotVerified=Identit\u00e4t der Web-Site konnte nicht best\u00e4tigt werden
pageInfo_WebSiteVerified=Identit\u00e4t der Web-Site best\u00e4tigt
pageInfo_Identity_Verified=Die Web-Site %S unterst\u00fctzt Authentifizierung f\u00fcr die Seite, die Sie anzeigen. Die Identit\u00e4t dieser Web-Site wurde best\u00e4tigt von %S, einem Zertifikatsaussteller, den Sie f\u00fcr diesen Zweck akzeptieren.
pageInfo_ViewCertificate=Das Sicherheitszertifikat f\u00fcr die Identit\u00e4t dieser Web-Site anzeigen.
pageInfo_NoEncryption=Verbindung nicht verschl\u00fcsselt
pageInfo_Privacy_None1=Die Web-Site %S unterst\u00fctzt keine Verschl\u00fcsselung f\u00fcr die Seite, die Sie anzeigen m\u00f6chten.
pageInfo_Privacy_None2=Informationen, die unverschl\u00fcsselt \u00fcber das Internet \u00fcbertragen werden, k\u00f6nnen von unbefugten Personen eingesehen werden.
pageInfo_Privacy_None3=Die von Ihnen angezeigte Seite ist nicht verschl\u00fcsselt.
pageInfo_StrongEncryption=Verbindung verschl\u00fcsselt: Hochgradige Verschl\u00fcsselung (%S %S Bit)
pageInfo_Privacy_Strong1=Die Seite, die Sie anzeigen, war verschl\u00fcsselt, bevor sie \u00fcber das Internet \u00fcbertragen wurde.
pageInfo_Privacy_Strong2=Die Verschl\u00fcsselung erschwert unbefugten Personen die Einsicht in Informationen, die zwischen Computern \u00fcbertragen werden. Es ist daher unwahrscheinlich, dass diese Seite w\u00e4hrend der \u00dcbertragung \u00fcber das Netzwerk gelesen wurde.
pageInfo_WeakEncryption=Verbindung verschl\u00fcsselt: Geringe Verschl\u00fcsselung (%S %S Bit)
pageInfo_Privacy_Weak1=Die Web-Site %S verwendet eine geringe Verschl\u00fcsselung f\u00fcr die Seite, die Sie anzeigen wollen.
pageInfo_Privacy_Weak2=Bei geringer Verschl\u00fcsselung k\u00f6nnen m\u00f6glicherweise unbefugte Personen diese Informationen einsehen.

#Cert Viewer
certDetails=Zertifikatsanzeige:
notPresent=<Nicht Bestandteil des Zertifikats>
unknownIssuer=<Unbekannter Aussteller>

escrowFinalMessage=Klicken Sie nur auf OK, wenn Sie \u00fcberzeugt sind, dass "%S" Ihren privaten Kodierschl\u00fcssel sch\u00fctzt.

#Token Manager
password_not_set=(nicht eingestellt)
failed_pw_change=Master-Passwort kann nicht ge\u00e4ndert werden.
incorrect_pw=Das aktuelle Master-Passwort wurde nicht korrekt eingegeben. Bitte versuchen Sie es noch einmal.
pw_change_ok=Das Master-Passwort wurde erfolgreich ge\u00e4ndert.
pw_erased_ok=Warnung! Sie haben Ihr Master-Passwort gel\u00f6scht.
pw_not_wanted=Warnung! Sie haben sich entschieden, kein Master-Passwort zu verwenden.
pw_empty_warning=Ihre gespeicherten Web- und eMail-Passw\u00f6rter, Formulardaten und privaten Schl\u00fcssel werden nicht gesch\u00fctzt.
login_failed=Anmeldung fehlgeschlagen
loadPK11TokenDialog=W\u00e4hlen Sie das zu ladende PKCS#11-Ger\u00e4t
devinfo_modname=Modul
devinfo_modpath=Pfad
devinfo_label=Etikett
devinfo_manID=Hersteller
devinfo_serialnum=Seriennummer
devinfo_hwversion=HW-Version
devinfo_fwversion=FW-Version
devinfo_status=Status
devinfo_desc=Beschreibung
devinfo_stat_disabled=Deaktiviert
devinfo_stat_notpresent=Nicht vorhanden
devinfo_stat_uninitialized=Nicht initialisiert
devinfo_stat_notloggedin=Nicht angemeldet
devinfo_stat_loggedin=Angemeldet
devinfo_stat_ready=Bereit
enable_fips=FIPS aktivieren
disable_fips=FIPS deaktivieren

#device manager: load device dlg
device.loaddlg.width=300
device.loaddlg.height=200

certmgr.verified=\u00dcberpr\u00fcft
certmgr.verifiedNoOCSP=\u00dcberpr\u00fcft (kein OCSP)

# CRL next update.
crlNextUpdateMsg1=%S kann keine verschl\u00fcsselte Verbindung zu "%S" herstellen.
crlNextUpdateMsg2=Die Liste widerrufener Zertifikate (CRL: Certificate Revocation List) von "%S" muss aktualisiert werden.
NoUpdateFailure=Keine
lastFetchUrlLabel=URL urspr\u00fcnglich abgerufen von
advertisedUrlLabel=URL vom ZA beworben
CrlUpdatePrefsSetConfirmation= Automatische Aktualisierungseinstellungen werden beim Neustart des Browsers wirksam.
crlAutoUpdateDayCntError=Die Zahl der Tage vor der n\u00e4chsten Aktualisierung muss gr\u00f6\u00dfer als null sein.
crlAutoUpdtaeFreqCntError=Die Aktualisierungsh\u00e4ufigkeit muss einen Wert haben, der gr\u00f6\u00dfer als null ist.
disabledStatement=Die automatische Aktualisierung ist f\u00fcr diese CRL nicht aktiviert.
enabledStatement=Die automatische Aktualisierung ist f\u00fcr diese CRL aktiviert.
crlAutoupdateQuestion1=M\u00f6chten Sie die automatische Aktualisierung aktivieren?
crlAutoupdateQuestion2=M\u00f6chten Sie die Einstellungen f\u00fcr die automatische Aktualisierung anzeigen?
undefinedValStr=<Nicht definiert>
undefinedURL=Die automatische Aktualisierung der URL ist nicht definiert.
yesButton=Ja
noButton=Nein
resetPasswordButtonLabel=Zur\u00fccksetzen
resetPasswordConfirmationTitle=Master-Passwort zur\u00fccksetzen
resetPasswordConfirmationMessage=Ihr Passwort wurde zur\u00fcckgesetzt.
crlAutoupdateEnabled=Aktiviert
crlAutoupdateNotEnabled=Nicht aktiviert
crlAutoupdateOk=OK
crlAutoupdateFailed=Fehlgeschlagen
