<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Informations de certificat et d&eacute;cisions</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white"> <a NAME="cert_dialog_help_first"></a> <div class="boilerplate">Ce document est fourni par Netscape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr><h1>Informations de certificat et d&eacute;cisions</h1>
<p>Cette section d&eacute;crit l'utilisation de diverses fen&ecirc;tres affich&eacute;es &agrave; diff&eacute;rents moments par le Gestionnaire de certificats. Les informations compl&eacute;mentaires fournies ici apparaissent lorsque vous cliquez sur le bouton Aide dans l'une de ces fen&ecirc;tres. </P>




<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#Certificate_Details">Afficheur de certificat</a></p>
<p><a href="cert_dialog_help.html#Choose_Security_Device">S&eacute;lection d'un dispositif de s&eacute;curit&eacute;</a>
<p><a href="cert_dialog_help.html#Certificate_Backup">Sauvegarde de certificats</a>
<p><a href="#User_Identification_Request">Demande d'identification utilisateur</a></p>
<p><a href="#New_Certificate_Authority">Nouvelle autorit&eacute; de certification</a></p>
<p><a href="#Web_Site_Certificates">Certificats de sites Web</a></p>
</td>
</tr>
</table>


<p>&nbsp;</p>
<hr> <a NAME="view_certificateSDX"></a> <a NAME="Certificate_Details"></a>
<h2>Afficheur de certificat</h2>


<p>L'Afficheur de certificat pr&eacute;sente des informations sur un certificat s&eacute;lectionn&eacute; dans un des onglets du Gestionnaire de certificats. L'onglet G&eacute;n&eacute;rales affiche des informations succinctes sur l'&eacute;metteur du certificat, son &eacute;tat de v&eacute;rification, ce pour quoi le certificat peut &ecirc;tre utilis&eacute;, etc. L'onglet D&eacute;tails fournit des informations d&eacute;taill&eacute;es sur le contenu du certificat.</p>

<p>Si l'Afficheur de certificat n'est pas &agrave; l'&eacute;cran, proc&eacute;dez comme suit&nbsp;:

<ol>
   <li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
   <li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
   <li>Cliquez sur G&eacute;rer les certificats.
   <li>Cliquez sur l'onglet correspondant au type de certificat dont vous souhaitez afficher les d&eacute;tails.
   <li>S&eacute;lectionnez le certificat dont vous souhaitez afficher les d&eacute;tails.
   <li>Cliquez sur Afficher.
</ol>




<p><table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#General_Tab">Onglet G&eacute;n&eacute;rales</a></p>
<p><a href="#Details_Tab">Onglet D&eacute;tails</a></p>
</td>
</tr>
</table>


<p>&nbsp;</p> <a NAME="General_Tab"></a>
<h3>Onglet G&eacute;n&eacute;rales</h3>

<p>Lors de la premi&egrave;re ouverture de l'Afficheur de certificat, l'onglet G&eacute;n&eacute;rales affiche diff&eacute;rents types d'informations concernant les certificat s&eacute;lectionn&eacute;s&nbsp;: </P>

<ul>
	<li><b>Ce certificat a &eacute;t&eacute; v&eacute;rifi&eacute; pour les utilisations suivantes :</b> Voir <a href="glossary.html#certificate_verification">v&eacute;rification de certificats</a> pour la description de la v&eacute;rification des certificats par le Gestionnaire de certificats. Les utilisations peuvent &ecirc;tre les suivantes&nbsp;:</li>
<ul>
<LI><B>Certificat client SSL :</B> Certificat utilis&eacute; pour vous identifier aupr&egrave;s des sites Web.</LI>

<LI><B>Certificat serveur SSL&nbsp;:</B> Certificat utilis&eacute; pour identifier un site Web aupr&egrave;s des navigateurs.</LI>

<LI><B>Certificat de signataire de courrier&nbsp;:</B> Certificat utilis&eacute; pour vous identifier afin de signer num&eacute;riquement des messages &eacute;lectroniques.</LI>

<LI><B>Certificat de destinataire de courrier :</B> Certificat utilis&eacute; pour identifier quelqu'un d'autre, par exemple pour pouvoir lui envoyer des messages chiffr&eacute;s.</LI>

<LI><B>Certificat de r&eacute;pondeur d'&eacute;tat&nbsp;:</B> Certificat utilis&eacute; pour identifier un r&eacute;pondeur d'&eacute;tat en ligne utilisant le protocole OCSP (Online Certificate Status Protocol) pour v&eacute;rifier la validit&eacute; des certificats. Pour plus d'informations sur OCSP, voir <a href="validation_help.html">Param&egrave;tres de validation</a>.</LI>

<LI><B>Autorit&eacute; de certification SSL&nbsp;:</B> Certificat utilis&eacute; pour identifier une autorit&eacute; de certification, c'est-&agrave;-dire un service &eacute;mettant des certificats &agrave; utiliser comme identification sur des r&eacute;seaux informatiques.</LI>

</ul>
	<li><b>D&eacute;livr&eacute; &agrave; :</b> R&eacute;sume les informations suivantes concernant le certificat&nbsp;:</li>
	<ul>
	<LI><B>Nom commun&nbsp;:</B> Nom de la personne ou entit&eacute; identifi&eacute;e par le certificat.</LI>

	<LI><B>Organisation&nbsp;:</B> Nom de l'organisation &agrave; laquelle appartient l'entit&eacute; (comme le nom d'une soci&eacute;t&eacute;).</LI>

	<LI><B>Unit&eacute; organisationnelle&nbsp;:</B> Nom de l'unit&eacute; organisationnelle &agrave; laquelle appartient l'entit&eacute; (par exemple, D&eacute;partement comptable).</LI>
	<LI><B>Num&eacute;ro de s&eacute;rie&nbsp;:</B> Le num&eacute;ro de s&eacute;rie du certificat.</LI>
	</UL>

	<li><b>D&eacute;livr&eacute; par&nbsp;:</b> R&eacute;sume les informations (similaires &agrave; celles fournies sous "D&eacute;livr&eacute; &agrave;"&nbsp;; voir ci-dessus) concernant l'autorit&eacute; de certification qui a &eacute;mis le certificat.
	<li><b>Validit&eacute; :</b> Indique la p&eacute;riode de validit&eacute; du certificat.
	<li><b>Empreintes digitales :</b> Enum&egrave;re les empreintes digitales du certificat. Une empreinte est un num&eacute;ro unique produit en appliquant une fonction math&eacute;matique au contenu du certificat. Les empreintes du certificat peuvent &ecirc;tre utilis&eacute;es pour v&eacute;rifier qu'il n'a pas &eacute;t&eacute; falsifi&eacute;.
</ul>


<p>&nbsp;</p> <a NAME="Details_Tab"></a>
<h3>Onglet D&eacute;tails</h3>

<p>Cliquez sur l'onglet D&eacute;tails en haut de l'Afficheur de certificat pour afficher des informations plus d&eacute;taill&eacute;es concernant le certificat s&eacute;lectionn&eacute;. Pour examiner les informations d'un certificat dans la zone Hi&eacute;rarchie de certificats, s&eacute;lectionnez son nom puis, dans la zone Champs du certificat, s&eacute;lectionnez le champ &agrave; examiner et lisez la valeur du champ dans Valeur du champ :


<ul>
	<li><b>Hi&eacute;rarchie de certificats :</b> Affiche la cha&icirc;ne de certificats avec, dans le bas, le certificat s&eacute;lectionn&eacute; &agrave; l'origine. Une cha&icirc;ne de certificats est une s&eacute;rie hi&eacute;rarchique de certificats sign&eacute;s par des autorit&eacute;s de certification (CA) successives. Un certificat d'autorit&eacute; de certification identifie une <a href="glossary.html#certificate_authority_(CA)">autorit&eacute; de certification</a> et est utilis&eacute; pour signer les certificats &eacute;mis par cette autorit&eacute;. Un certificat d'autorit&eacute; de certification peut &agrave; son tour &ecirc;tre sign&eacute; par celui d'une autorit&eacute; de certification parente et ainsi de suite jusqu'&agrave; une <a href="glossary.html#root_CA">autorit&eacute; de certification principale</a>.
	<li><b>Champs du certificat :</b> Affiche les champs du certificat s&eacute;lectionn&eacute; dans Hi&eacute;rarchie de certificats.
	<li><b>Valeur du champ :</b> Affiche la valeur du champ s&eacute;lectionn&eacute; dans Champs du certificat.
</ul>

<p>L'Afficheur de certificat affiche, dans la mesure du possible, des types ANSI de base dans une forme interpr&eacute;table par l'utilisateur. Pour les champs dont celui-ci ne peut interpr&eacute;ter le contenu, le Gestionnaire de certificats affiche les valeurs r&eacute;elles contenues dans le certificat.</P>


<p>&nbsp;</p>
<hr> <a NAME="Choose_Security_Device"></a>
<h2>S&eacute;lection d'un dispositif de s&eacute;curit&eacute;</h2>

<p>Un dispositif de s&eacute;curit&eacute; (parfois appel&eacute; jeton) est un dispositif mat&eacute;riel ou logiciel fournissant des services cryptographiques tels que le chiffrement et le d&eacute;chiffrement et stockant des certificats et cl&eacute;s. La fen&ecirc;tre Choisir un dispositif de s&eacute;curit&eacute; s'affiche lorsque le Gestionnaire de certificats a besoin d'aide pour d&eacute;cider du dispositif de s&eacute;curit&eacute; &agrave; utiliser lors de l'importation d'un certificat ou de la r&eacute;alisation d'une op&eacute;ration cryptographique, comme la g&eacute;n&eacute;ration de cl&eacute;s pour un nouveau certificat. Cette fen&ecirc;tre permet de s&eacute;lectionner l'un des dispositifs de s&eacute;curit&eacute; d&eacute;tect&eacute;s par le Gestionnaire de certificats sur votre machine.

<p>Une carte &agrave; puce constitue un exemple de dispositif de s&eacute;curit&eacute;. Par exemple, si vous avez ins&eacute;r&eacute; une carte &agrave; puce dans un lecteur connect&eacute; &agrave; votre ordinateur, le nom de la carte figure dans le menu d&eacute;roulant. Dans ce cas, vous devez choisir le nom de la carte &agrave; puce dans le menu et indiquer au Gestionnaire de certificats que vous souhaitez l'utiliser.

<p>Le Gestionnaire de certificats poss&egrave;de &eacute;galement son propre dispositif de s&eacute;curit&eacute; int&eacute;gr&eacute; par d&eacute;faut, qui peut toujours &ecirc;tre utilis&eacute; sans tenir compte des autres dispositifs &eacute;ventuellement disponibles.


<p>&nbsp;</p>
<hr><a NAME="Encryption_Key_Copy"></a>
<h2>Copie de la cl&eacute; de chiffrement</h2>


<p>Les <a href="glossary.html#certificate_authority_(CA)">autorit&eacute;s de certification</a> qui &eacute;mettent des certificats de courrier distincts pour la signature et le chiffrement effectuent g&eacute;n&eacute;ralement des copies de sauvegarde de votre <a href="glossary.html#encryption_key">cl&eacute; de chiffrement</a> priv&eacute;e pendant le processus d'inscription.

<p>La bo&icirc;te de dialogue Copie de cl&eacute; de chiffrement permet d'approuver la cr&eacute;ation d'une telle sauvegarde ou d'annuler la demande de certificat. Une autorit&eacute; de certification qui a archiv&eacute; une copie de sauvegarde de votre cl&eacute; de chiffrement a la possibilit&eacute; de d&eacute;chiffrer n'importe quel message chiffr&eacute; que vous recevez, en utilisant la cl&eacute; publique correspondante.




<p>La bo&icirc;te de dialogue Copie de cl&eacute; de chiffrement permet d'effectuer les op&eacute;rations suivantes :

<ul><li><b>Afficher un certificat :</b> Pour afficher le certificat identifiant l'autorit&eacute; de certification qui demande la copie de sauvegarde, cliquez sur Afficher un certificat.</P>
	<li><b>OK :</b> Si vous faites confiance &agrave; l'autorit&eacute; de certification identifi&eacute;e par le certificat pour d&eacute;chiffrer les messages chiffr&eacute;s que vous recevez, cliquez sur OK.
	<p>Si vous n'&ecirc;tes pas s&ucirc;r de pouvoir faire confiance &agrave; l'AC demandant la copie de sauvegarde, contactez votre administrateur syst&egrave;me.
	<li><b>Annuler :</b> Si vous ne faites pas confiance &agrave; l'AC demandant la copie de sauvegarde, ne lui demandez pas de certificat. Cliquez sur Annuler pour interrompre la proc&eacute;dure de sauvegarde et la demande de certificat.
</ul>

<p>Une fois la copie de sauvegarde de la cl&eacute; de chiffrement r&eacute;alis&eacute;e, vous pourrez utiliser la cl&eacute; pour acc&eacute;der &agrave; votre courrier chiffr&eacute;, m&ecirc;me en cas de perte du mot de passe ou de votre copie de la cl&eacute;. En l'absence de copie de votre cl&eacute; de chiffrement, vous ne pourrez lire aucun de vos messages &eacute;lectroniques chiffr&eacute;s avec cette cl&eacute; en cas de perte du mot de passe ou de la cl&eacute;.


<p>&nbsp;</p>
<hr> <a NAME="Certificate_Backup"></a>
<h2>Sauvegarde de certificats</h2>

<p>Lorsque vous recevez un certificat, faites-en une copie de sauvegarde, puis conservez-la en lieu s&ucirc;r. Par exemple, vous pouvez enregistrer la copie sur disquette et la mettre sous cl&eacute; avec d'autres objets de valeur. M&ecirc;me si vous rencontrez des probl&egrave;mes d'endommagement de fichier ou de disque dur, vous pouvez alors ais&eacute;ment restaurer le certificat.</P>

<p>Il peut &ecirc;tre g&ecirc;nant, voire catastrophique, de perdre votre certificat et la cl&eacute; priv&eacute;e associ&eacute;e, selon l'utilisation que vous en faites. Par exemple :</P>

<ul>
	<LI>Si vous perdez un certificat vous identifiant aupr&egrave;s de sites Web importants, vous ne pourrez plus y acc&eacute;der &agrave; moins d'obtenir un nouveau certificat. </LI>

	<LI>Si vous perdez un certificat utilis&eacute; pour chiffrer des messages &eacute;lectroniques, vous ne pourrez plus lire votre courrier chiffr&eacute;, qu'il s'agisse de messages envoy&eacute;s ou re&ccedil;us. Dans ce cas, si vous ne pouvez pas obtenir une copie de la cl&eacute; de chiffrement priv&eacute;e associ&eacute;e au certificat, vous ne pourrez lire aucun des messages chiffr&eacute;s avec cette cl&eacute;.</LI>
</ul>

<p>Comme d'autres donn&eacute;es pr&eacute;cieuses, les certificats doivent &ecirc;tre sauvegard&eacute;s pour &eacute;viter tout probl&egrave;me ou frais futurs. Faites la sauvegarde imm&eacute;diatement pour ne pas l'oublier.</P>

<p>&nbsp;</p>
<hr> <a NAME="User_Identification_Request"></a>
<h2>Demande d'identification utilisateur</h2>


<P>Certains sites Web vous invitent &agrave; vous identifier &agrave; l'aide d'un certificat plut&ocirc;t que d'un nom et d'un mot de passe, car les certificats constituent une forme d'identification plus fiable. Cette m&eacute;thode d'identification sur Internet est parfois appel&eacute;e <a href="glossary.html#client_authentication">authentification du client</a>.

<p>Toutefois, le Gestionnaire de certificats peut poss&eacute;der plusieurs certificats utilisables pour vous identifier aupr&egrave;s d'un site Web. Dans ce cas, le Gestionnaire de certificats pr&eacute;sente la bo&icirc;te de dialogue, Demande d'identification utilisateur, qui affiche deux types d'informations :</P>

<p><b>Ce site a demand&eacute; que vous vous identifiez avec un certificat:</b> Cette section de la bo&icirc;te de dialogue fournit les informations suivantes :
	<ul>
		<li><b>Nom d'h&ocirc;te :</b> Nom du serveur demandant l'identification, tel qu'utilis&eacute; dans son adresse URL. Par exemple, le nom d'h&ocirc;te du site Web de Netscape est <tt>home.netscape.com</tt> .
		<li><b>Organisation :</b> Nom de l'organisation qui administre le site Web.
		<li><b>Emis sous :</b> Nom de l'<a href="glossary.html#certificate_authority_(CA)">autorit&eacute; de certification</a> qui a &eacute;mis le certificat.
	</ul>

<p><b>Choisissez un certificat &agrave; pr&eacute;senter comme identification :</b> Les certificats disponibles pour vous identifier aupr&egrave;s d'un site Web figurent dans la liste d&eacute;roulante dans cette section de la bo&icirc;te de dialogue. S&eacute;lectionnez le certificat le plus susceptible d'&ecirc;tre reconnu par le site Web &agrave; visiter.
	<p>Pour vous aider &agrave; d&eacute;cider, la bo&icirc;te de dialogue affiche les d&eacute;tails suivants concernant le certificat s&eacute;lectionn&eacute;&nbsp;:<?li>
	<ul>
		<li><b>D&eacute;livr&eacute; &agrave; :</b> Affiche des informations concernant la personne identifi&eacute;e par le certificat (par exemple, votre nom et votre adresse &eacute;lectronique) ainsi que le num&eacute;ro de s&eacute;rie et les dates de validit&eacute; du certificat.
		<li><b>D&eacute;livr&eacute; par :</b> Fournit des informations succinctes sur l'autorit&eacute; de certification qui a &eacute;mis le certificat : nom, emplacement, &eacute;tat...
	</ul>




<p>&nbsp;</p>
<hr> <a NAME="New_Certificate_Authority"></a>
<h2>Nouvelle autorit&eacute; de certification</h2>

<p>Les certificats dont dispose le Gestionnaire de certificats, stock&eacute;s sur votre ordinateur ou sur un dispositif de s&eacute;curit&eacute; externe tel qu'une carte &agrave; puce, englobent des certificats qui identifient des <a href="glossary.html#certificate_authority_(CA)">autorit&eacute;s de certification</a>. Pour pouvoir reconna&icirc;tre les autres certificats dont il dispose, le Gestionnaire de certificats doit avoir des certificats pour les autorit&eacute;s de certification qui ont &eacute;mis ou autoris&eacute; l'&eacute;mission de ces certificats.

<p>Lorsque vous d&eacute;cidez de faire confiance &agrave; une autorit&eacute; de certification, le Gestionnaire de certificats t&eacute;l&eacute;charge le certificat de cette autorit&eacute; et peut alors reconna&icirc;tre les types de certificats que vous acceptez de cette autorit&eacute;.</P>

<p>Avant de t&eacute;l&eacute;charger un nouveau certificat d'autorit&eacute; de certification, le Gestionnaire de certificats permet de sp&eacute;cifier comment vous souhaitez, le cas &eacute;ch&eacute;ant, faire confiance au certificat. Vous pouvez choisir l'une des options suivantes&nbsp;:

<ul>
	<LI><B>Faire confiance &agrave; cette autorit&eacute; de certification pour identifier les sites Web : </B>Les certificats de certains sites Web, tels que ceux qui traitent des transactions financi&egrave;res, peuvent &ecirc;tre extr&ecirc;mement importants et une identification inappropri&eacute;e ou fausse peut avoir des cons&eacute;quences n&eacute;gatives.</LI>
	<LI><B> Faire confiance &agrave; cette autorit&eacute; de certification pour identifier les utilisateurs de courrier &eacute;lectronique : </B>Si vous souhaitez envoyer &agrave; des utilisateurs de courrier des informations confidentielles sous une forme chiffr&eacute;e ou si une identification exacte de ces utilisateurs est importante pour vous pour d'autres raisons, vous devez examiner attentivement les proc&eacute;dures d'identification des futurs propri&eacute;taires de certificats par l'autorit&eacute; de certification et vous assurer qu'elles sont adapt&eacute;es &agrave; vos objectifs avant de s&eacute;lectionner cette option.</LI>
	<LI><B>Faire confiance &agrave; cette autorit&eacute; de certification pour identifier les d&eacute;veloppeurs de logiciels :</B> Cette option signifie que vous faites confiance &agrave; l'autorit&eacute; de certification pour l'&eacute;mission de certificats qui identifient l'origine des applets Java et scripts JavaScript n&eacute;cessitant un acc&egrave;s sp&eacute;cial &agrave; votre ordinateur, comme la capacit&eacute; de modifier des fichiers. Ces privil&egrave;ges d'acc&egrave;s pouvant &ecirc;tre utilis&eacute;s &agrave; mauvais escient, par exemple pour d&eacute;truire des donn&eacute;es stock&eacute;es sur le disque dur, faites preuve de prudence lors de la s&eacute;lection de cette option, &agrave; moins d'&ecirc;tre certain de pouvoir faire confiance &agrave; l'AC dans ce domaine.
</ul>

<p>Avant de d&eacute;cider de faire confiance &agrave; une nouvelle autorit&eacute; de certification, v&eacute;rifiez que vous savez qui la dirige. Assurez-vous que les politiques et proc&eacute;dures de l'autorit&eacute; de certification sont appropri&eacute;es pour les certificats qu'elle &eacute;met. Par exemple, si l'autorit&eacute; de certification &eacute;met des certificats identifiant les sites Web utilis&eacute;s pour les transactions financi&egrave;res, assurez-vous que vous &ecirc;tes satisfait du niveau d'assurance garanti par l'autorit&eacute; de certification.

<ul>
	<li><b>Afficher :</b> Cliquez sur ce bouton pour afficher le certificat d'autorit&eacute; de certification que vous vous appr&ecirc;tez &agrave; t&eacute;l&eacute;charger. Si vous d&eacute;cidez de ne pas t&eacute;l&eacute;charger ce certificat, cliquez sur Annuler.
</ul>


<p>&nbsp;</p>
<hr> <a NAME="Web_Site_Certificates"></a>
<h2>Certificats de sites Web</h2>


<p>Une des fen&ecirc;tres &eacute;num&eacute;r&eacute;es ici peut s'afficher lorsque vous tentez de s&eacute;lectionner un site Web prenant en charge l'utilisation de <a href="glossary.html#Secure_Sockets_Layer_(SSL)">SSL</a> pour l'<a href="glossary.html#authentication">authentification</a> et le <a href="glossary.html#Secure_Sockets_Layer_(SSL)">chiffrement</a>.</P>


<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#New_Web_Site_Certificate">Site Web certifi&eacute; par une autorit&eacute; inconnue</a>
<p><a href="#Expired_Web_Site_Certificate">Certificat de serveur expir&eacute;</a>
<p><a href="#Web_Site_Certificate_Not_Yet_Valid">Certificat de serveur pas encore valide</a>
<p><a href="#Unexpected_Certificate_Name">Discordance de nom de domaines</a>
</td>
</tr>
</table>


<p>&nbsp;</p>
<hr> <a NAME="New_Web_Site_Certificate"></a>
<h3>Site Web certifi&eacute; par une autorit&eacute; inconnue</h3>


<p>De nombreux sites Web utilisent des certificats pour s'identifier lorsque vous les visitez. Si le Gestionnaire de certificats ne reconna&icirc;t pas l'<a href="glossary.html#certificate_authority_(CA)">autorit&eacute; de certification</a> qui a &eacute;mis le certificat d'un site Web, il pr&eacute;sente une alerte qui vous permet d'examiner le certificat du nouveau site Web et de d&eacute;cider que faire :

<ul>
	<li><b>Afficher un certificat :</b> Cliquez sur ce bouton pour afficher le certificat du site Web.
	<li><b>M&eacute;moriser ce certificat de mani&egrave;re permanente.</b> Si vous avez la certitude que le certificat est valide, s&eacute;lectionnez cette option et cliquez sur Continuer. Le Gestionnaire de certificats reconna&icirc;tra ce certificat comme identification l&eacute;gitime jusqu'&agrave; son expiration.
</ul>

<p>Pour faire dispara&icirc;tre l'alerte et poursuivre votre travail, cliquez sur Continuer ou Annuler :

<ul>

	<li>Si vous soup&ccedil;onnez le site Web de ne pas &ecirc;tre ce qu'il pr&eacute;tend, cliquez sur Annuler. Le Gestionnaire de certificats ne se connectera pas au site Web cette fois, mais affichera de nouveau la m&ecirc;me fen&ecirc;tre lors de votre prochaine visite.

	<p>L'annulation peut par exemple s'av&eacute;rer appropri&eacute;e si vous effectuez des transactions financi&egrave;res sur le site Web. Dans ce cas, vous souhaiterez peut-&ecirc;tre signaler le probl&egrave;me &agrave; la banque ou autre organisation qui administre le site et v&eacute;rifier que le certificat de ce dernier est valide avant d'aller plus loin.

	<li>Si vous souhaitez consulter le site Web malgr&eacute; le probl&egrave;me, cliquez sur Continuer.</li>
	<p>Si vous avez s&eacute;lectionn&eacute; "M&eacute;moriser ce certificat de mani&egrave;re permanente", le Gestionnaire de certificats reconna&icirc;tra ce certificat comme identification l&eacute;gitime jusqu'&agrave; son expiration.
	<p>Si vous n'avez pas s&eacute;lectionn&eacute; "M&eacute;moriser ce certificat de mani&egrave;re permanente", le Gestionnaire de certificats reconna&icirc;tra ce certificat comme identification l&eacute;gitime pour cette session uniquement. La m&ecirc;me alerte s'affichera lors de votre prochaine visite du site.

</ul>

<p>L'option "M&eacute;moriser ce certificat de mani&egrave;re permanente" r&eacute;sout le probl&egrave;me pour le certificat de ce site Web, mais la m&ecirc;me alerte appara&icirc;tra pour tout autre site dont le certificat a &eacute;t&eacute; &eacute;mis par la m&ecirc;me autorit&eacute; de certification.

<p>Pour que le Gestionnaire de certificats fasse confiance &agrave; tous les certificats &eacute;mis par une autorit&eacute; donn&eacute;e, vous devez modifier les param&egrave;tres de confiance du certificat de l'autorit&eacute; de certification correspondante. Pour ce faire, proc&eacute;dez comme suit :

<ol>
   <li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
   <li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
   <li>Cliquez sur G&eacute;rer les certificats.
   <li>Cliquez sur l'onglet Autorit&eacute;s.
   <li>S&eacute;lectionnez le certificat d'autorit&eacute; de certification dont vous souhaitez modifier les param&egrave;tres de confiance.
   <li>Cliquez sur le bouton Modifier et s&eacute;lectionnez les param&egrave;tres de confiance appropri&eacute;s.
</ol>

<p>&nbsp;</p>
<hr> <a NAME="Expired_Web_Site_Certificate"></a>
<h3>Certificat de serveur expir&eacute;</h3>

<p>A l'instar d'une carte de cr&eacute;dit, d'un permis de conduire et de nombreuses autres formes d'identification, un <a href="glossary.html#certificate">certificat</a> est valide pendant une certaine p&eacute;riode. Une fois le certificat expir&eacute;, le propri&eacute;taire du certificat doit en obtenir un nouveau.</P>

<p>Le Gestionnaire de certificats vous 	avertit lorsque vous tentez de visiter un site Web dont le certificat de serveur a expir&eacute;. Il convient d'abord de v&eacute;rifier l'exactitude de la date et de l'heure affich&eacute;es par votre ordinateur. Si l'horloge de l'ordinateur est r&eacute;gl&eacute;e sur une date ult&eacute;rieure &agrave; la date d'expiration, le Gestionnaire de certificats consid&egrave;re le certificat du site Web comme ayant expir&eacute;. </P>

<p>Si l'horloge de votre ordinateur est correctement r&eacute;gl&eacute;e, vous devez d&eacute;cider de faire confiance ou non au site. Cette d&eacute;cision d&eacute;pend de ce que vous avez l'intention de faire sur ce site et de ce que vous savez de lui par ailleurs. La plupart des sites commerciaux veillent &agrave; remplacer leurs certificats avant leur expiration. </P>

<p>La bo&icirc;te de dialogue Certificat de serveur expir&eacute; permet d'effectuer les op&eacute;rations suivantes :

<ul><li><b>Afficher un certificat :</b> Pour consulter les informations du certificat, notamment sa p&eacute;riode de validit&eacute;, cliquez sur Afficher un certificat.</P>
	<li><b>OK :</b> Si vous avez des raisons de penser que l'expiration du certificat est une erreur, vous pouvez cliquer sur OK pour accepter le certificat pour la session en cours et informer le webmaster du probl&egrave;me.
	<p>Soyez prudent dans les op&eacute;rations que vous effectuez sur ce site.
	<li><b>Annuler :</b> Si vous soup&ccedil;onnez qu'il y a un probl&egrave;me r&eacute;el et ne souhaitez pas prendre le risque de visiter le site, cliquez sur Annuler (dans ce cas, le Gestionnaire de certificats ne vous connecte pas au site).
</ul>



<p>&nbsp;</p>
<hr> <a NAME="Web_Site_Certificate_Not_Yet_Valid"></a>
<h3>Certificat de serveur pas encore valide</h3>


<p>A l'instar d'une carte de cr&eacute;dit, d'un permis de conduire et de nombreuses autres formes d'identification, un <a href="glossary.html#certificate">certificat</a> est valide pendant une certaine p&eacute;riode.</P>

<p>Le Gestionnaire de certificats vous 	avertit lorsque vous tentez de visiter un site Web dont la p&eacute;riode de validit&eacute; du certificat de serveur n'a pas encore commenc&eacute;. Il convient d'abord de v&eacute;rifier l'exactitude de la date et de l'heure affich&eacute;es par votre ordinateur. Si la date de l'horloge de votre ordinateur est incorrecte, le Gestionnaire de certificats peut consid&eacute;rer le certificat du serveur comme non encore valide m&ecirc;me si ce n'est pas le cas. </P>

<p>Si l'horloge de votre ordinateur est correctement r&eacute;gl&eacute;e, vous devez d&eacute;cider de faire confiance ou non au site. Cette d&eacute;cision d&eacute;pend de ce que vous avez l'intention de faire sur ce site et de ce que vous savez de lui par ailleurs. La plupart des sites commerciaux s'assurent que la p&eacute;riode de validit&eacute; de leurs certificats a commenc&eacute; avant de les utiliser. </P>

<p>La bo&icirc;te de dialogue Certificat de serveur pas encore valide permet d'effectuer les op&eacute;rations suivantes :

<ul><li><b>Afficher un certificat :</b> Pour consulter les informations du certificat, notamment sa p&eacute;riode de validit&eacute;, cliquez sur Afficher un certificat.</P>
	<li><b>OK :</b> Si vous avez des raisons de penser qu'il s'agit d'une erreur, vous pouvez cliquer sur OK pour accepter le certificat pour la session en cours et informer le webmaster du probl&egrave;me.
	<p>Soyez prudent dans les op&eacute;rations que vous effectuez sur ce site.
	<li><b>Annuler :</b> Si vous soup&ccedil;onnez qu'il y a un probl&egrave;me r&eacute;el et ne souhaitez pas prendre le risque de visiter le site, cliquez sur Annuler (dans ce cas, le Gestionnaire de certificats ne vous connecte pas au site).
</ul>

<p>&nbsp;</p>
<hr> <a NAME="Unexpected_Certificate_Name"></a>
<h3>Discordance de nom de domaines</h3>


<p>Un <a href="glossary.html#certificate">certificat</a> de serveur sp&eacute;cifie le nom du serveur sous la forme du nom de domaine du site. Par exemple, le nom de domaine du site Web de Netscape est <tt>home.netscape.com</tt> . Si le nom de domaine du certificat d'un serveur ne correspond pas au nom de domaine r&eacute;el du site, cela peut indiquer que quelqu'un tente d'intercepter votre communication avec le site.</P>

<p>Votre d&eacute;cision de faire confiance au site ou non d&eacute;pend des activit&eacute;s que vous souhaitez y mener et des informations dont vous disposez &agrave; son &eacute;gard. La plupart des sites commerciaux s'assurent que le nom d'h&ocirc;te d'un certificat de site Web correspond au nom d'h&ocirc;te v&eacute;ritable.</P>

<p>La bo&icirc;te de dialogue Discordance de nom de domaines permet d'effectuer les op&eacute;rations suivantes :

<ul><li><b>Afficher un certificat :</b> Pour examiner le certificat, cliquez sur Afficher un certificat.</P>
	<li><b>OK :</b> Si vous avez des raisons de penser qu'il s'agit d'une erreur, vous pouvez cliquer sur OK pour accepter le certificat pour la session en cours et informer le webmaster du probl&egrave;me.
	<p>Soyez prudent dans les op&eacute;rations que vous effectuez sur ce site et consid&eacute;rez les informations que vous y trouvez comme potentiellement suspectes.
	<li><b>Annuler :</b> Si vous soup&ccedil;onnez qu'il y a un probl&egrave;me r&eacute;el et ne souhaitez pas prendre le risque de visiter le site, cliquez sur Annuler (dans ce cas, le Gestionnaire de certificats ne vous connecte pas au site).
</ul>


<p>Si vous d&eacute;cidez d'accepter le certificat pour la session en cours, vous devez faire preuve de prudence sur le site et consid&eacute;rer les informations que vous y trouverez comme potentiellement suspectes.</P>




<hr>
<p><i>18 juin 2002</i></p>
<p>Copyright &copy; 1994-2000 Netscape Communications Corporation.</p>

</body>
</html>



