<html>
<head>
<title>Gestionnaire de certificats</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white"> <a NAME="certs_first"></a> <div class="boilerplate">Ce document est fourni par Nestcape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr>
<h1>Gestionnaire de certificats</h1>

<p>Cette section d&eacute;crit l'utilisation du Gestionnaire de certificats. Pour obtenir plus d'informations sur l'utilisation des certificats, voir <a href="using_certs_help.html">Utilisation de certificats</a>.

<p>Si la fen&ecirc;tre du Gestionnaire de certificats n'est pas encore affich&eacute;e, proc&eacute;dez comme suit&nbsp;:

<ol>
   <li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
   <li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
   <li>Cliquez sur G&eacute;rer les certificats.
</ol>

<p><table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#My_Certificates">Vos certificats</a></p>
<p><a href="#Other_Peoples_Certificates">Certificats d'autres personnes</a></p>
<p><a href="#Web_Site_Certificates">Certificats de sites Web</a></p>
<p><a href="#CA_Certificates">Autorit&eacute;s</a></p>
</td>
</tr>
</table>


<p>&nbsp;</p>
<hr> <a NAME="back_up_certificatesSDX"></a> <a NAME="backup_certificatesSDX"></a> <a NAME="import_certificatesSDX"></a> <a NAME="import_certificatesIDX"></a> <a NAME="backing_up_certificatesIDX"></a> <a NAME="certificates:backups_ofIDX"></a> <a NAME="certificates:importing_your_ownIDX"></a> <a NAME="smart_card_backupsSDX"></a> <a NAME="smart_cards:backupsSDX"></a> <a NAME="My_Certificates"></a><h2>Vos certificats</h2>

<p>L'onglet Vos certificats du <A href="#certs_first">Gestionnaire de certificats</a> affiche les certificats enregistr&eacute;s qui vous identifient. Vos certificats sont repris sous les noms des organisations qui les ont &eacute;mis :

<ul>
	<li>Si vous ne pouvez pas voir les noms de certificats sous le nom d'une organisation, double-cliquez sur le nom.
	<li>Pour s&eacute;lectionner un certificat, cliquez sur son nom.
	<li>Pour s&eacute;lectionner plusieurs certificats, maintenez enfonc&eacute;e la touche Ctrl tout en cliquant sur leur nom.
</ul>

<p>Pour effectuer les actions suivantes, s&eacute;lectionnez un ou plusieurs certificats et cliquez sur le bouton correspondant&nbsp;:
<UL>
  <LI><b>Afficher :</b> Affiche des informations d&eacute;taill&eacute;es sur les certificats s&eacute;lectionn&eacute;s.</LI>
  <LI><b>Sauvegarder :</b> Lance le processus d'enregistrement des certificats s&eacute;lectionn&eacute;s. Une fen&ecirc;tre vous permettant de s&eacute;lectionner un mot de passe pour prot&eacute;ger la copie de sauvegarde s'affiche. Vous pouvez ensuite enregistrer la copie de sauvegarde dans un r&eacute;pertoire de votre choix.</LI>
  <LI><b>Supprimer :</b> Supprime les certificats s&eacute;lectionn&eacute;s.</LI>
</UL>

<P>Les actions ne n&eacute;cessitent pas la s&eacute;lection d'un certificat :</P>
<UL>

  <LI><b>Importer :</b> Importe un fichier contenant un ou plusieurs certificats sauvegard&eacute;s pr&eacute;c&eacute;demment. Lorsque vous cliquez sur Importer, le Gestionnaire de certificats vous invite d'abord &agrave; localiser le fichier contenant la copie de sauvegarde. Les noms des fichiers de sauvegarde des certificats se terminent g&eacute;n&eacute;ralement par <tt>.p12</tt> ; par exemple, <tt>MonCert.p12</tt>. Une fois le fichier &agrave; importer s&eacute;lectionn&eacute;, le Gestionnaire de certificats vous invite &agrave; entrer le mot de passe d&eacute;fini lors de la sauvegarde du certificat.</LI>

  <LI><b>Tout sauvegarder :</b> Lance le processus d'enregistrement de tous les certificats stock&eacute;s dans le <a href="glossary.html#software_security_device">dispositif de s&eacute;curit&eacute; logiciel</a>.

<p><b>Remarque&nbsp;: Les certificats enregistr&eacute;s sur des cartes &agrave; puce ne peuvent pas &ecirc;tre sauvegard&eacute;s.</b> Que vous s&eacute;lectionniez certains de vos certificats et cliquiez sur Sauvegarder, ou que vous cliquiez sur Tout sauvegarder, le fichier de sauvegarde obtenu n'inclura aucun des certificats stock&eacute;s sur des cartes &agrave; puce ou sur d'autres dispositifs de s&eacute;curit&eacute; externes. Seuls peuvent &ecirc;tre sauvegard&eacute;s les certificats stock&eacute;s sur le dispositif de s&eacute;curit&eacute; logiciel interne.

</UL>


<p>&nbsp;</p>
<hr><a NAME="Choose_a_Certificate_Backup_Password"></a>
<H3>Choix d'un mot de passe de sauvegarde de certificat</H3>

<P>Un mot de passe de sauvegarde de certificat prot&egrave;ge un ou plusieurs certificats que vous sauvegardez &agrave; partir de l'onglet <a href="#My_Certificates">Vos certificats</a> du Gestionnaire de certificats.

<p>Le Gestionnaire de certificats vous invite &agrave; d&eacute;finir ce mot de passe lorsque vous sauvegardez des certificats et le demande lorsque vous tentez d'importer des certificats pr&eacute;c&eacute;demment sauvegard&eacute;s.</P>

<ul>
<li><b>Mot de passe de sauvegarde de certificat :</b> Tapez votre mot de passe de sauvegarde dans ce champ.

<li><b>Mot de passe de sauvegarde de certificat (encore) :</b> Tapez de nouveau votre mot de passe de sauvegarde. Si vous ne le saisissez pas la seconde fois exactement comme la premi&egrave;re, le bouton OK reste inactif. Si cela se produit, essayez de retaper le nouveau mot de passe.
</ul>

<p>Si une personne se procure le fichier contenant un certificat sauvegard&eacute; et l'importe avec succ&egrave;s, elle pourra envoyer des messages ou acc&eacute;der &agrave; des sites Web en usurpant votre identit&eacute;. Cette situation peut poser des probl&egrave;mes, par exemple, si vous signez num&eacute;riquement d'importants messages &eacute;lectroniques ou g&eacute;rez vos comptes bancaires ou de placement sur Internet.

<p>Par cons&eacute;quent, il importe de s&eacute;lectionner un mot de passe de sauvegarde de certificat difficile &agrave; deviner. La <b>mesure de qualit&eacute; du mot de passe</b> donne une indication de la qualit&eacute; de votre mot de passe lors de sa saisie en fonction de facteurs tels que la longueur et l'utilisation de majuscules, de minuscules, de chiffres et de symboles. Elle ne garantit cependant pas que votre mot de passe ne pourra pas &ecirc;tre devin&eacute;.

<p>Pour d'autres indications, reportez-vous au document en ligne <a href="http://home.netscape.com/security/basics/passwords.html"  TARGET="_blank">Choix d'un bon mot de passe</a>.

<p>Il importe &eacute;galement d'enregistrer le mot de passe en lieu s&ucirc;r (pas &agrave; un endroit facilement accessible &agrave; n'importe qui). Si vous oubliez ce mot de passe, vous ne pourrez pas importer la copie de sauvegarde de votre certificat.</p>


<p>&nbsp;</p>
<hr><a NAME="Delete_My_Certificate"></a>
<h3>Suppression de vos certificats</h3>

<P>Avant de supprimer un de vos certificats expir&eacute;s de l'onglet <a href="#My_Certificates">Vos certificats</a> du Gestionnaire de certificats, assurez-vous qu'il ne vous sera pas un jour n&eacute;cessaire pour lire d'anciens courriers &eacute;lectroniques que vous avez chiffr&eacute;s avec la cl&eacute; priv&eacute;e correspondante.



</P>


<p>&nbsp;</p>
<hr><a NAME="Other_Peoples_Certificates"></a>
<h2>Certificats d'autres personnes</h2>

<p>L'onglet Certificats d'autres personnes du <A href="#certs_first">Gestionnaire de certificats</a> affiche les certificats dont vous disposez et qui identifient d'autres personnes.

<p>Lorsque quelqu'un vous envoie un message &eacute;lectronique sign&eacute; &eacute;lectroniquement, le Gestionnaire de certificats importe automatiquement son certificat. Vous pouvez utiliser ce certificat pour lui envoyer des messages chiffr&eacute;s.

<p>Les certificats des autres personnes sont repris sous les noms des organisations qui les ont &eacute;mis :

<ul>
	<li>Si vous ne pouvez pas voir les noms de certificats sous le nom d'une organisation, double-cliquez sur le nom.
	<li>Pour s&eacute;lectionner un certificat, cliquez sur son nom.
	<li>Pour s&eacute;lectionner plusieurs certificats, maintenez enfonc&eacute;e la touche Ctrl tout en cliquant sur leur nom.
</ul>

<p>Pour effectuer les actions suivantes, s&eacute;lectionnez un ou plusieurs certificats et cliquez sur le bouton correspondant&nbsp;:

<ul>
	<li><b>Afficher :</b> Affiche des informations d&eacute;taill&eacute;es sur les certificats s&eacute;lectionn&eacute;s.

	<li><b>Supprimer :</b> Supprime les certificats s&eacute;lectionn&eacute;s.
</ul>


<p>&nbsp;</p>
<hr><a NAME="Delete_Email_Certificate"></a>
<h3>Suppression de certificats de courrier &eacute;lectronique</h3>

<p>Avant de supprimer le certificat d'une autre personne &agrave; partir de l'onglet  <a href="#Other_Peoples_Certificates">Certificats d'autres personnes</a> du Gestionnaire de certificats, v&eacute;rifiez que vous n'en aurez plus jamais besoin pour envoyer un message chiffr&eacute; &agrave; cette personne ou pour v&eacute;rifier la signature num&eacute;rique des messages provenant de cette personne.

<p>&nbsp;</p>
<hr><a NAME="Web_Site_Certificates"></a>
<h2>Certificats de sites Web</h2>

<p>L'onglet Sites Web du Gestionnaire de certificats affiche les certificats dont vous disposez concernant des sites Web.

<p>Les certificats de sites Web sont repris sous les noms des organisations qui les ont &eacute;mis :

<ul>
	<li>Si vous ne pouvez pas voir les noms de certificats sous le nom d'une organisation, double-cliquez sur le nom.
	<li>Pour s&eacute;lectionner un certificat, cliquez sur son nom.
	<li>Pour s&eacute;lectionner plusieurs certificats, maintenez enfonc&eacute;e la touche Ctrl tout en cliquant sur leur nom.
</ul>



<p>Pour effectuer les actions suivantes, s&eacute;lectionnez un ou plusieurs certificats et cliquez sur le bouton correspondant&nbsp;:

<ul>
	<li><b>Afficher :</b> Affiche des informations d&eacute;taill&eacute;es sur les certificats s&eacute;lectionn&eacute;s.

	<li><b>Modifier&nbsp;:</b> Permet d'afficher ou de modifier les param&egrave;tres de confiance que le Gestionnaire de certificats associe aux certificats s&eacute;lectionn&eacute;s. Vous pouvez utiliser ces param&egrave;tres pour d&eacute;signer un certificat de sites Web comme fiable ou non &agrave; des fins d'identification.

	<li><b>Supprimer :</b> Supprime les certificats s&eacute;lectionn&eacute;s.
</ul>

<p>&nbsp;</p>
<hr><a NAME="Edit_Web_Site_Certificate_Settings"></a>
<h3>Modification des param&egrave;tres de confiance de certificats de sites Web</h3>

<p>Lorsque vous s&eacute;lectionnez un certificat de sites Web dans l'onglet <A href="#Web_Site_Certificates">Sites Web</a> du Gestionnaire de certificats et cliquez sur Modifier, une fen&ecirc;tre intitul&eacute;e "Modifier les param&egrave;tres de confiance du certificat du site Web" s'affiche.

Sp&eacute;cifiez si vous souhaitez faire confiance au certificat s&eacute;lectionn&eacute; pour identifier le site Web et &eacute;tablir une connexion chiffr&eacute;e.<p>

<p>La bo&icirc;te de dialogue contient les &eacute;l&eacute;ments suivants :

<ul>

	<li><b>Le certificat "<i>nom du certificat</i>" a &eacute;t&eacute; &eacute;mis par :</b> Fournit des informations sur l'<a href="glossary.html#certificate_authority_(CA)">autorit&eacute; de certification</a> qui a &eacute;mis ce certificat.

	<li><b>Modifier les param&egrave;tres de confiance du certificat :</b></li>

<ul>
	<li><b>Faire confiance &agrave; l'authenticit&eacute; de ce certificat :</b> Si vous s&eacute;lectionnez cette option, le Gestionnaire de certificats fera dor&eacute;navant confiance &agrave; ce certificat pour l'identification de ce site Web ou l'&eacute;tablissement d'une connexion chiffr&eacute;e. Si vous s&eacute;lectionnez cette option, puis tentez de visiter le site Web, votre navigateur acc&egrave;dera au site avec, le cas &eacute;ch&eacute;ant, quelques messages d'avertissement.

	<li><b>Ne pas faire confiance &agrave; l'authenticit&eacute; de ce certificat :</b> Si vous s&eacute;lectionnez cette option, le Gestionnaire de certificats ne fera plus confiance &agrave; ce certificat pour l'identification de ce site Web ou l'&eacute;tablissement d'une connexion chiffr&eacute;e. Si vous s&eacute;lectionnez cette option, puis tentez de visiter le site Web, un ou plusieurs messages d'avertissement s'afficheront avant que vous puissiez acc&eacute;der au site.

</ul>
<li><b>Modifier la confiance de l'autorit&eacute; de certification :</b> Cliquez sur ce bouton pour sp&eacute;cifier des param&egrave;tres de confiance pour l'autorit&eacute; de certification qui a &eacute;mis le certificat du site Web. Ces param&egrave;tres permettent de faire confiance ou non &agrave; diff&eacute;rents types de certificats &eacute;mis par cette autorit&eacute;. Par exemple, vous pouvez choisir de faire confiance &agrave; tous les certificats de sites Web qu'elle &eacute;met.
</ul>

<p>Cliquez sur OK pour confirmer votre choix.




<p>&nbsp;</p>
<hr><a NAME="Delete_Web_Site_Certificate"></a>
<h3>Suppression de certificats de sites Web</h3>

<p>Avant de supprimer un certificat de sites Web &agrave; partir de l'onglet <a href="#Web_Site_Certificates">Sites Web</a> du Gestionnaire de certificats, assurez-vous que vous n'en aurez plus besoin pour identifier un site Web et &eacute;tablir une connexion chiffr&eacute;e.


<p>&nbsp;</p>
<hr><a NAME="importing_a_certificate_chainSDX"></a> <a NAME="importing_intermediate_CA certificatesSDX"></a> <a NAME="certificates:importing_chained_CAIDX"></a> <a NAME="certificates:intermediate_CAIDX"></a> <a NAME="CA_Certificates"></a>
<h2>Autorit&eacute;s</h2>

<p>L'onglet Autorit&eacute;s du <A href="#certs_first">Gestionnaire de certificats</a> affiche les certificats dont vous disposez et qui identifient des <a href="glossary.html#certificate_authority_(CA)">autorit&eacute;s de certification</a>.


<p>Les certificats d'autorit&eacute; de certification sont repris sous les noms des organisations qui les ont &eacute;mis :

<ul>
	<li>Si vous ne pouvez pas voir les noms de certificats sous le nom d'une organisation, double-cliquez sur le nom.
	<li>Pour s&eacute;lectionner un certificat d'autorit&eacute; de certification, cliquez sur son nom.
	<li>Pour s&eacute;lectionner plusieurs certificats d'autorit&eacute; de certification, maintenez enfonc&eacute;e la touche Ctrl tout en cliquant sur leur nom.
</ul>


<p>Pour effectuer ces op&eacute;rations, s&eacute;lectionnez les certificats sur lesquels vous souhaitez agir et cliquez sur l'un des boutons suivants :
<ul>
	<li><b>Afficher :</b> Affiche des informations d&eacute;taill&eacute;es sur les certificats s&eacute;lectionn&eacute;s.

	<li><b>Modifier&nbsp;:</b> Permet d'afficher ou de modifier les param&egrave;tres que le Gestionnaire de certificats associe aux certificats s&eacute;lectionn&eacute;s. Vous pouvez utiliser ces param&egrave;tres pour indiquer &agrave; quels types de certificats &eacute;mis par les autorit&eacute;s de certification correspondantes vous faites confiance.

	<li><b>Supprimer :</b> Supprime les certificats s&eacute;lectionn&eacute;s.
</ul>

<p>Pour faire confiance &agrave; toute une <a href="glossary.html#certificate_chain">cha&icirc;ne de certificats</a> d'autorit&eacute;s de certification, modifiez uniquement le certificat de l'autorit&eacute; de certification principale.

<p>Pour importer la cha&icirc;ne, vous cliquez sur un lien sur une page Web fournie par l'autorit&eacute; de certification. Vous pouvez alors utiliser l'onglet Autorit&eacute;s pour localiser le certificat principal et en modifier les param&egrave;tres de confiance.

<p>L'autorit&eacute; principale et les autorit&eacute;s interm&eacute;diaires apparaissent toutes sous la m&ecirc;me organisation. Le certificat principal est celui qui est indiqu&eacute; comme &eacute;metteur.

<p><b>Si vous t&eacute;l&eacute;chargez une autorit&eacute; de certification interm&eacute;diaire :</b> Si vous t&eacute;l&eacute;chargez un certificat d'autorit&eacute; de certification interm&eacute;diaire encha&icirc;n&eacute; &agrave; un certificat principal d&eacute;j&agrave; marqu&eacute; comme digne de confiance dans votre navigateur, vous ne devez pas indiquer &agrave; quelles fins vous lui faites confiance. Les certificats interm&eacute;diaires h&eacute;ritent automatiquement des param&egrave;tres de confiance des certificats principaux correspondants.


<p>&nbsp;</p><hr><a NAME="Edit_CA_Certificate_Settings"></a>
<h3>Modification des param&egrave;tres de confiance de certificats d'autorit&eacute;s de certification</h3>

<p>Lorsque vous s&eacute;lectionnez un certificat d'autorit&eacute; de certification dans l'onglet <A href="#CA_Certificates">Autorit&eacute;s</a> du Gestionnaire de certificats et cliquez sur Modifier, une fen&ecirc;tre intitul&eacute;e "Modifier les param&egrave;tres de confiance du certificat de l'autorit&eacute; de certification" s'affiche. Sp&eacute;cifiez les types de certificats que vous confiez &agrave; cette autorit&eacute; &agrave; des fins de certification. Si vous d&eacute;sactivez toutes les cases, le Gestionnaire de certificats ne fera confiance &agrave; aucun certificat &eacute;mis par cette autorit&eacute;.

<p>Les param&egrave;tres ont les effets suivants :
<ul>
<li><b>Ce certificat peut identifier des sites Web :</b> Les Gestionnaire de certificat fera confiance aux certificats &eacute;mis par cette autorit&eacute; pour l'identification de sites Web et de chiffrement de connexion &agrave; des sites Web. Si vous d&eacute;sactivez cette case, le Gestionnaire de certificats ne fera pas confiance aux certificats de sites Web &eacute;mis par cette autorit&eacute;.

<li><b>Ce certificat peut identifier des utilisateurs de courrier &eacute;lectronique :</b> Le Gestionnaire de certificats fera confiance aux certificats &eacute;mis par cette autorit&eacute; de certification pour la signature ou le chiffrement de courrier &eacute;lectronique. Si vous d&eacute;sactivez cette case, le Gestionnaire de certificats ne fera pas confiance aux certificats de courrier &eacute;lectronique &eacute;mis par cette autorit&eacute;.

<li><b>Ce certificat peut identifier des d&eacute;veloppeurs de logiciels :</b> Le Gestionnaire de certificats fera confiance aux certificats &eacute;mis par cette autorit&eacute; de certification aux fins d'identification de d&eacute;veloppeurs de logiciels. Si vous d&eacute;sactivez cette case, le Gestionnaire de certificats ne fera pas confiance &agrave; ces certificats &eacute;mis par cette autorit&eacute;.
</ul>

<p>Cliquez sur OK pour confirmer les param&egrave;tres que vous avez s&eacute;lectionn&eacute;s.


<p>&nbsp;</p>
<hr><a NAME="Delete_CA_Certificate"></a>
<h3>Suppression de certificats d'autorit&eacute; de certification</h3>

<p>Avant de supprimer un certificat d'autorit&eacute; de certification &agrave; partir de l'onglet <A href="#CA_Certificates">Autorit&eacute;s</a> du Gestionnaire de certificats, assurez-vous que vous n'en aurez plus besoin pour valider des certificats &eacute;mis par cette autorit&eacute;. Si vous supprimez le seul certificat valide que vous poss&eacute;dez pour une autorit&eacute; de certification, le Gestionnaire de certificats ne fera plus confiance &agrave; aucun certificat &eacute;mis par cette autorit&eacute;.

<p>&nbsp;</p>
<hr><a NAME="Device_Manager:options"></a> <a NAME="Security_Devices"></a>
<h1>Gestionnaire de dispositifs</h1>

<p>Cette section d&eacute;crit les options de la fen&ecirc;tre Gestionnaire de dispositifs. Pour obtenir des informations g&eacute;n&eacute;rales et des instructions pas &agrave; pas sur l'utilisation du Gestionnaire de dispositifs, voir <a href="using_certs_help.html#using_certs_devices">Gestion des cartes &agrave; puce et autres dispositifs de s&eacute;curit&eacute;</a>.

<P>Si la fen&ecirc;tre du Gestionnaire de dispositifs n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Dans le panneau Certificats, cliquez sur G&eacute;rer les dispositifs de s&eacute;curit&eacute;.
</ol>

<p>Le Gestionnaire de dispositifs &eacute;num&egrave;re chaque module PKCS n&deg;11 disponible, et les dispositifs de s&eacute;curit&eacute; g&eacute;r&eacute;s par chaque module en dessous du nom du module.

<p>Lorsque vous s&eacute;lectionnez un module ou dispositif, des informations sur la s&eacute;lection s'affichent au centre de la fen&ecirc;tre et certains boutons deviennent disponibles sur la droite. En g&eacute;n&eacute;ral, une action s'effectue sur un module ou dispositif en s&eacute;lectionnant son nom et en cliquant sur le bouton appropri&eacute; :

<ul>
	<li><b>Connexion :</b> Permet de se connecter au dispositif de s&eacute;curit&eacute; s&eacute;lectionn&eacute;. Une fois la connexion effectu&eacute;e, la fr&eacute;quence &agrave; laquelle il vous sera demand&eacute; d'entrer le mot de passe principal du dispositif d&eacute;pend des param&egrave;tres <a href="passwords_help.html#Master_Password">Expiration de mot de passe principal</a>.
	<li><b>D&eacute;connecter :</b> Permet de se d&eacute;connecter du dispositif de s&eacute;curit&eacute; s&eacute;lectionn&eacute;. Apr&egrave;s la d&eacute;connexion, le dispositif et les certificats qu'il contient ne seront pas disponibles tant que vous ne vous reconnecterez pas.
	<li><b>Changer le mot de passe :</b> Permet de modifier le mot de passe principal du dispositif de s&eacute;curit&eacute; s&eacute;lectionn&eacute;.
	<li><b>Charger :</b> Affiche une bo&icirc;te de dialogue permettant de sp&eacute;cifier le nom et l'emplacement d'un nouveau module PKCS n&deg;11. Avant d'ajouter un nouveau module, vous devez au pr&eacute;alable installer le logiciel du module sur votre ordinateur et, au besoin, connecter tout dispositif mat&eacute;riel associ&eacute;. Suivez les instructions du fournisseur.
	<li><b>D&eacute;charger :</b> D&eacute;charge le module s&eacute;lectionn&eacute;. Si vous d&eacute;chargez un module, ce dernier et ses dispositifs de s&eacute;curit&eacute; ne sont plus utilisables par le navigateur.
	<li><b>Activer FIPS&nbsp;:</b> Active ou d&eacute;sactive le mode FIPS. Pour plus d'informations, voir <a href="using_certs_help.html#using_certs_devices_fips">Activation du mode FIPS</a>.

</ul>

<hr>
<p><i>18 juin 2002</i></p>
<p>Copyright &copy; 1994-2000 Netscape Communications Corporation.</p>

</body>
</html>
