<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Cr&eacute;ation de pages Web avec Netscape Composer</title> <link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>
<body bgcolor="white">
<p>&nbsp;</p>

<a name="web_page_editorSDX"></a> <a name="editing_web_pagesSDX"></a> <a name="comp_top"></a>

<h1>Cr&eacute;ation de pages Web avec Netscape Composer</h1>

<p>Netscape Composer vous permet de cr&eacute;er vos propres pages Web et de les publier sur Internet. Pas besoin de conna&icirc;tre le langage HTML pour utiliser Composer : il est aussi facile &agrave; utiliser qu'un traitement de texte.</p>

<p>Les boutons des barres d'outils permettent d'ajouter des listes, tableaux, images, liens vers d'autres pages, couleurs et styles de police. Vous pouvez voir de quoi votre document aura l'air sur le Web &agrave; mesure que vous le cr&eacute;ez et pouvez facilement le partager avec d'autres utilisateurs, quel que soit le type de navigateur ou le programme de messagerie compatible HTML qu'ils utilisent.</p>

<p>Pour commencer &agrave; utiliser Netscape Composer :</p>

<ul>
<li>Cliquez sur l'ic&ocirc;ne Composer dans l'angle inf&eacute;rieur gauche d'une fen&ecirc;tre Netscape.</li>
</ul>

<table>
<tr>
<td colspan="4"> <img src="images/composer_icon.gif" hspace="0" vspace="0"></td>
</tr>

<tr>
<td width="80"><b>&nbsp;</b></td>
<td><b>Ic&ocirc;ne Composer</b></td>
</tr>
</table>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#comp_start">D&eacute;marrage d'une nouvelle page</a></p>

<p><a href="#page_change">Formatage des pages Web</a></p>

<p><a href="#page_table">Ajout de tableaux &agrave; votre page Web</a></p>

<p><a href="#page_picture">Ajout d'images &agrave; votre page Web</a></p>

<p><a href="#page_properties">R&eacute;glage des propri&eacute;t&eacute;s de page</a></p>

<p><a href="#page_link">Cr&eacute;ation de liens dans Composer</a></p>

<p><a href="#publish_top">Publication de vos pages sur le Web</a></p>

<p><a href="#Set_Comp_prefs">Pr&eacute;f&eacute;rences de Composer</a></p>
</td>
</tr>
</table>

<p><br>
</p>


<hr> <a name="comp_start"></a>
<h1>D&eacute;marrage d'une nouvelle page</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#create_document">Cr&eacute;ation d'une page</a></p>

<p><a href="#browse_new_page">Enregistrement et navigation dans la nouvelle page</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="new_web_pageSDX"></a> <a name="web_pages:creatingIDX"></a> <a name="Composer:creating_new_pagesIDX"></a> <a name="create_document"></a>

<h2>Cr&eacute;ation d'une page</h2>

<p>Netscape Composer est un &eacute;diteur HTML (Hypertext Markup Language) permettant de cr&eacute;er et de modifier des pages Web. Editeur <i>WYSIWYG</i> (What You See Is What You Get), Composer permet de voir exactement la fa&ccedil;on dont la page sera affich&eacute;e &agrave; mesure de sa cr&eacute;ation. Il n'est pas n&eacute;cessaire de conna&icirc;tre le langage HTML, dans la mesure o&ugrave; la plupart des fonctions HTML sont disponibles sous la forme de commandes des barres d'outils et des menus.</p>

<p>Composer permet &eacute;galement de modifier la source HTML si vous le souhaitez. Pour afficher ou modifier le code source HTML, ouvrez le menu Afficher et s&eacute;lectionnez Source HTML, ou cliquez sur l'onglet &lt;HTML&gt; source dans la barre d'outils de modification au bas de la fen&ecirc;tre Composer.</p>

<p>Pour cr&eacute;er une page Web, proc&eacute;dez comme suit. Une fois que vous avez entam&eacute; une page, vous pouvez ajouter et modifier du texte tout comme dans un traitement de texte.</p>

<p><b>Pour cr&eacute;er une page &agrave; partir de Navigator</b>&nbsp;:</p>

<ul>
<li>Ouvrez le menu Fichier et choisissez Nouveau, puis Page de Composer. Une fen&ecirc;tre Composer contenant une page vierge s'ouvre.</li>
</ul>

<a name="edit_pageSDX"></a>

<p><b>Pour modifier une page que vous consultez dans Navigator&nbsp;</b>:</p>

<ul>
<li>Dans la fen&ecirc;tre Navigator de la page s&eacute;lectionn&eacute;e, ouvrez le menu Fichier et s&eacute;lectionnez Modifier la page. Une fen&ecirc;tre Composer contenant la page s&eacute;lectionn&eacute;e s'affiche.</li>
</ul>

<p><b>Pour cr&eacute;er une page dans Composer</b>&nbsp;:</p>

<ul>
<li>Cliquez sur le bouton Nouveau dans la barre d'outils de Composer.</li>
</ul>

<p><b>Pour d&eacute;marrer &agrave; partir d'un fichier HTML stock&eacute; sur le lecteur local&nbsp;</b>:</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et s&eacute;lectionnez Composer. La fen&ecirc;tre Composer s'affiche.</li>

<li>Ouvrez le menu Fichier et choisissez Ouvrir un fichier. La bo&icirc;te de dialogue Ouvrir un fichier HTML s'affiche.</li>

<li>Sur le lecteur local, trouvez le fichier &agrave; modifier.</li>

<li>Cliquez sur Ouvrir pour afficher le fichier sp&eacute;cifi&eacute; dans une fen&ecirc;tre Composer.</li>
</ol>

<p><b>Pour modifier une page Web&nbsp;</b>:</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et choisissez Navigator.</li>

<li>Acc&eacute;dez &agrave; une page Web en tapant son URL (par exemple, <tt>http://home.netscape.com</tt>) dans la barre d'adresse et en appuyant sur Entr&eacute;e (Retour sur Macintosh).</li>

<li>Ouvrez le menu Fichier et s&eacute;lectionnez Modifier la page.</li>
</ol> <a name="open_recent_pages_in_ComposerSDX"></a>
<p><b>Astuce&nbsp;</b>: Dans la fen&ecirc;tre Composer, vous pouvez ouvrir rapidement les derniers fichiers sur lesquels vous avez travaill&eacute; en ouvrant le menu Fichier, puis en s&eacute;lectionnant Pages r&eacute;centes, et en choisissant le fichier d&eacute;sir&eacute; dans la liste.</p>

<p>[&nbsp;<a href="#comp_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:saving_pagesIDX"></a> <a name="Composer:browsing_pagesIDX"></a> <a name="browse_new_page"></a>

<h2>Enregistrement et navigation dans la nouvelle page</h2>

<p>Vous pouvez enregistrer des documents Composer au format HTML ou texte uniquement. L'enregistrement d'un document au format HTML conserve son formatage, notamment les styles de texte (par exemple, gras ou italique), les tableaux, les liens et les images. L'enregistrement au format texte uniquement supprime toutes les &eacute;tiquettes HTML mais conserve le texte.</p>

<p>Pour enregistrer un document au format HTML&nbsp;:</p>

<ul>
<li>Ouvrez le menu Fichier et s&eacute;lectionnez Enregistrer ou cliquez sur le bouton Enregistrer dans la barre d'outils Composition.

<p>Si vous n'avez pas encore attribu&eacute; de titre &agrave; la page, Composer vous invite &agrave; le faire. Composer affiche le titre de la page dans la barre de titre de la fen&ecirc;tre du navigateur lorsque vous l'y affichez. Le titre de la page appara&icirc;t &eacute;galement dans votre liste de signets, le cas &eacute;ch&eacute;ant.</p>

<p>Composer vous invite alors &agrave; entrer un nom de fichier et &agrave; sp&eacute;cifier son emplacement d'enregistrement. Veillez &agrave; conserver l'extension .html du nom de fichier.</p>
</li>
</ul>

<p>Pour changer le nom de fichier ou l'emplacement d'un fichier HTML existant :</p>

<ul>
<li>Choisissez Enregistrer sous et s&eacute;lectionnez un autre nom de fichier ou emplacement.</li>
</ul>

<p>Lorsque vous enregistrez une page dans Composer, tous les &eacute;l&eacute;ments de la page (le code HTML, les images et les autres fichiers, tels que les fichiers son et les feuilles de style) sont enregistr&eacute;s localement sur votre disque dur. Si vous souhaitez uniquement enregistrer la partie HTML de la page, vous devez modifier la pr&eacute;f&eacute;rence de Composer relative &agrave; l'enregistrement des pages. Voir  <a href= "#PREFERENCES_EDITOR_GENERAL">Pr&eacute;f&eacute;rences de Composer - Composer</a> pour plus d'informations sur la modification du r&eacute;glage de Composer relatif &agrave; l'enregistrement des pages.</p>

<p>Si une adresse d'image est absolue (commence par "http://") et que vous &ecirc;tes connect&eacute; &agrave; Internet, vous verrez toujours l'image du document dans Composer et Navigator. Cependant, si l'emplacement de l'image est relatif &agrave; l'emplacement de la page (commence par "file:///"), vous ne la verrez pas dans la version locale du document.</p>

<p>Pour enregistrer un document au format texte uniquement&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fichier et choisissez Exporter vers texte.</li>

<li>Entrez le nom du fichier et son emplacement d'enregistrement.</li>
</ol>

<p><b>Remarque</b>&nbsp;: Les images ne s'affichent pas dans les documents enregistr&eacute;s au format texte uniquement.</p>

<p><b>Astuce&nbsp;</b>: Vous pouvez aussi choisir Revenir &agrave; la version enregistr&eacute;e dans le menu Fichier pour r&eacute;cup&eacute;rer la derni&egrave;re version enregistr&eacute;e du document sur lequel vous travaillez. N'oubliez pas que les modifications en cours seront perdues.</p>

<p>Pour afficher la page dans une fen&ecirc;tre du navigateur afin de tester les liens&nbsp;:</p>

<ul>
<li>Ouvrez le menu Fichier et s&eacute;lectionnez Parcourir une page (ou cliquez sur Parcourir dans la barre d'outils Composition). Si vous n'avez pas encore enregistr&eacute; le document, Composer vous invite &agrave; entrer un titre de page, un nom de fichier et un emplacement. La fen&ecirc;tre Composer reste ouverte en arri&egrave;re-plan de la nouvelle fen&ecirc;tre Navigator.</li>
</ul>

<p>[&nbsp;<a href="#comp_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<p><br>
</p>


<hr> <a name="page_change"></a>
<h1>Formatage des pages Web</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#PROPERTIES_PARAGRAPH">Formatage de paragraphes, en-t&ecirc;tes et listes</a></p>

<p><a href="#lists">Manipulation de listes</a></p>

<p><a href="#PROPERTIES_CHARACTER">Modification de la couleur, du style et de la police du texte</a></p>

<p><a href="#style_remove">Suppression ou interruption de styles de texte</a></p>

<p><a href="#FIND_TEXT">Recherche et remplacement de texte</a></p>

<p><a href="#PROPERTIES_HRULE">Insertion de lignes horizontales</a></p>

<p><a href="#SPECIAL_CHARACTERS">Insertion de caract&egrave;res sp&eacute;ciaux</a></p>

<p><a href="#HTML_TAG">Insertion d'&eacute;l&eacute;ments et d'attributs HTML</a></p>

<p><a href="#SPELL_CHECK">V&eacute;rification orthographique</a></p>

<p><a href="#HTML_VALIDATE">Validation du code HTML</a></p>

<p><a href="#Edit_modes">S&eacute;lection du mode d'&eacute;dition correct</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="Composer:formatting_paragraphsIDX"></a> <a name="Composer:formatting_headingsIDX"></a> <a name="Composer:formatting_listsIDX"></a> <a name="PROPERTIES_PARAGRAPH"></a>

<h2>Formatage de paragraphes, en-t&ecirc;tes et listes</h2>

<p>Pour appliquer un format &agrave; un paragraphe, commencez dans la fen&ecirc;tre Composer :</p>

<ol>
<li>Cliquez pour placer le curseur &agrave; l'endroit o&ugrave; vous souhaitez que le format commence ou s&eacute;lectionnez le texte &agrave; formater.</li>

<li>Choisissez un format de paragraphe &agrave; l'aide de la liste d&eacute;roulante de la barre d'outils de formatage&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>Texte du corps&nbsp;</b>: Utilise la police et le style par d&eacute;faut de l'application pour le texte normal, sans influencer l'espacement avant ou apr&egrave;s.</li>

<li><b>Paragraphe&nbsp;</b>: Ins&egrave;re une &eacute;tiquette de paragraphe (&agrave; utiliser pour commencer un nouveau paragraphe). Le paragraphe comprend des marges sup&eacute;rieure et inf&eacute;rieure.</li>

<li><b>En-t&ecirc;te 1</b> - <b>En-t&ecirc;te 6&nbsp;</b>: Formate le paragraphe comme un en-t&ecirc;te. En-t&ecirc;te 1 est l'en-t&ecirc;te de plus haut niveau ; En-t&ecirc;te 6 est l'en-t&ecirc;te de plus bas niveau.</li>

<li><b>Adresse&nbsp;</b>: Ce format peut &ecirc;tre utilis&eacute; pour une "signature" de page Web qui indique l'auteur de la page et la personne &agrave; contacter pour plus d'informations, comme dans l'exemple suivant&nbsp;: <tt>utilisateur@exemple.com</tt>

<p>Vous pouvez y inclure la date et une note de copyright. Ce format s'affiche g&eacute;n&eacute;ralement au bas de la page Web sous une ligne horizontale. Navigator affiche le format d'adresse en italique.</p>
</li>

<li><b>Pr&eacute;format&eacute;&nbsp;</b>: Ce format est utile pour les &eacute;l&eacute;ments tels que les exemples de code, les donn&eacute;es en colonnes et les messages &eacute;lectroniques &agrave; afficher dans une police &agrave; chasse fixe. En texte normal, la plupart des navigateurs suppriment les espaces, tabulations et retours chariot superflus. Toutefois, le texte utilisant le style Pr&eacute;format&eacute; s'affiche avec l'espacement intact, ce qui pr&eacute;serve la mise en page du texte original.</li>
</ul>
</li>
</ol>

<p>Pour formater du texte comme un en-t&ecirc;te&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur &agrave; un endroit quelconque du texte &agrave; formater.</li>

<li>A l'aide de la liste d&eacute;roulante de la barre d'outils de formatage, s&eacute;lectionnez le niveau d'en-t&ecirc;te de votre choix, de 1 (le plus grand) &agrave; 6 (le plus petit). Choisissez "En-t&ecirc;te 1" pour l'en-t&ecirc;te principal, "En-t&ecirc;te 2" pour l'en-t&ecirc;te suivant, etc.</li>
</ol>

<p>Pour appliquer un format de liste&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur dans la ligne de texte &agrave; formater.</li>

<li>Ouvrez le menu Format et choisissez Liste.</li>

<li>Choisissez le style de liste&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>Puces&nbsp;</b>: Chaque &eacute;l&eacute;ment de la liste est accompagn&eacute; d'une puce (point) (comme dans cette liste).</li>

<li><b>Num&eacute;rot&eacute;e&nbsp;</b>: Les &eacute;l&eacute;ments sont num&eacute;rot&eacute;s.</li>

<li><b>Terme</b> et <b>D&eacute;finition&nbsp;</b>: Ces deux styles sont associ&eacute;s et cr&eacute;ent une apparence de type glossaire. Utilisez l'&eacute;tiquette Terme pour le mot &agrave; d&eacute;finir et le l'&eacute;tiquette D&eacute;finition pour la d&eacute;finition. Le texte Terme est align&eacute; &agrave; gauche et le texte D&eacute;finition s'affiche en retrait.</li>
</ul>
</li>
</ol>

<p><b>Astuce&nbsp;</b>: Vous pouvez appliquer rapidement un style de liste &agrave; un bloc de texte en le s&eacute;lectionnant et en cliquant sur le bouton Liste num&eacute;rot&eacute;e <img src= "images/numbers.gif" width="21" height="21" alt="" border="0">ou Liste &agrave; puces<img src="images/bullets.gif" width="20" height="20" alt="" border="0"> de la barre d'outils de formatage.</p>

<p>Pour modifier le style des puces ou num&eacute;ros&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur dans le texte de la liste &agrave; modifier ou s&eacute;lectionnez un ou plusieurs &eacute;l&eacute;ments de la liste pour appliquer un nouveau style &agrave; l'ensemble de la liste.</li>

<li>Ouvrez le menu Format et choisissez Propri&eacute;t&eacute;s de la liste.</li>

<li>S&eacute;lectionnez un style de puce ou de num&eacute;ro dans la liste d&eacute;roulante. Pour les listes num&eacute;rot&eacute;es, vous pouvez &eacute;galement sp&eacute;cifier un num&eacute;ro de d&eacute;but. Pour les listes &agrave; puces, vous pouvez modifier le style de puce.</li>
</ol>

<p><strong>Astuce&nbsp;</strong>: Vous pouvez &eacute;galement double-cliquer sur une puce ou un num&eacute;ro dans une liste pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de la liste.</p>

<p>Pour aligner un paragraphe ou un texte dans la page, par exemple le centrer ou l'aligner &agrave; gauche ou &agrave; droite&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur dans le paragraphe ou la ligne de texte &agrave; aligner.</li>

<li>Ouvrez le menu Format et choisissez Aligner, puis une option d'alignement.</li>
</ol>

<p><strong>Remarque</strong>&nbsp;: Vous pouvez &eacute;galement utiliser la barre d'outils de formatage pour aligner du texte.</p>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:working_with_listsIDX"></a> <a name="lists"></a>

<h2>Manipulation de listes</h2>

<p>Pour mettre fin &agrave; une liste et continuer &agrave; taper le texte du corps&nbsp;:</p>

<ul>
<li>Cliquez pour placer le curseur &agrave; la fin du dernier &eacute;l&eacute;ment de la liste et appuyez deux fois sur Entr&eacute;e (Retour sous Macintosh) pour terminer la liste.</li>
</ul>

<p>Pour convertir un ou plusieurs &eacute;l&eacute;ments de liste en texte de corps&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur dans l'&eacute;l&eacute;ment de liste ou s&eacute;lectionnez les &eacute;l&eacute;ments voulus.</li>

<li>Cliquez sur le bouton de liste num&eacute;rot&eacute;e (pour une liste num&eacute;rot&eacute;e) ou sur le bouton de liste &agrave; puces (pour une liste &agrave; puces) dans la barre d'outils de formatage.</li>
</ol>

<p>Pour placer du texte en retrait sous un &eacute;l&eacute;ment de liste&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur dans l'&eacute;l&eacute;ment de liste.</li>

<li>Appuyez sur Maj-Entr&eacute;e pour cr&eacute;er le retrait en sommaire.</li>

<li>Entrez le texte &agrave; mettre en retrait.</li>

<li>Appuyez sur Maj-Entr&eacute;e pour cr&eacute;er un autre paragraphe en retrait ou sur Entr&eacute;e pour cr&eacute;er l'&eacute;l&eacute;ment de liste suivant.</li>
</ol>

<a name="outdentSDX"></a> <a name="indentSDX"></a>

<p><b>Astuce&nbsp;</b>: Vous pouvez augmenter ou diminuer le retrait des &eacute;l&eacute;ments de liste en cliquant dans un de ces &eacute;l&eacute;ments puis sur le bouton Mettre le texte en retrait n&eacute;gatif (&agrave; gauche) ou Mettre le texte en retrait (&agrave; droite) dans la barre d'outils de formatage. Ou bien, cliquez dans un &eacute;l&eacute;ment de liste et appuyez sur Tab pour augmenter le retrait d'un niveau. Appuyez sur Maj+Tab pour r&eacute;duire le retrait d'un niveau.</p>

<p>Pour fusionner deux listes adjacentes&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez les deux listes &agrave; fusionner. Veillez &agrave; s&eacute;lectionner tous les &eacute;l&eacute;ments des deux listes. Notez qu'un texte plac&eacute; &eacute;ventuellement entre les deux listes sera int&eacute;gr&eacute; dans la liste fusionn&eacute;e.</li>

<li>Cliquez sur le bouton de liste &agrave; puces ou de liste num&eacute;rot&eacute;e dans la barre d'outils de formatage pour fusionner les listes.</li>
</ol>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:changing_text_colorIDX"></a> <a name="Composer:changing_text_styleIDX"></a> <a name="Composer:changing_text_fontIDX"></a> <a name="fonts:changing_in_ComposerIDX"></a> <a name="HTML_color_codesSDX"></a> <a name="PROPERTIES_CHARACTER"></a>

<h2>Modification de la couleur, du style et de la police du texte</h2>

<p>Pour modifier le style, la couleur ou la police du texte s&eacute;lectionn&eacute;&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le texte &agrave; formater.</li>

<li>Ouvrez le menu Format et choisissez l'une des options suivantes&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>Police&nbsp;</b>: Permet de choisir une police. Pour utiliser les polices sp&eacute;cifi&eacute;es par le navigateur de l'utilisateur, s&eacute;lectionnez Vectorielle ou Chasse fixe.

<p><b>Remarque</b>&nbsp;: Toutes les polices install&eacute;es sur votre ordinateur ne sont pas affich&eacute;es. Plut&ocirc;t que de sp&eacute;cifier une police qui n'est peut-&ecirc;tre pas disponible &agrave; toutes les personnes visitant votre page Web, il est g&eacute;n&eacute;ralement pr&eacute;f&eacute;rable de s&eacute;lectionner l'une des polices du menu dans la mesure o&ugrave; elles sont prises en charge par tous les ordinateurs. Par exemple, les polices Helvetica, Arial, Times et Courier ont g&eacute;n&eacute;ralement une apparence identique sur tous les ordinateurs. Si vous en choisissez une autre, elle ne s'affichera peut-&ecirc;tre pas de la m&ecirc;me mani&egrave;re selon les syst&egrave;mes.</p>
</li>

<li><b>Taille&nbsp;</b>: Permet de s&eacute;lectionner une taille de police <i>relative</i> ou de r&eacute;duire ou diminuer la taille du texte (par rapport au texte avoisinant).</li>

<li><b>Style de texte&nbsp;</b>: Permet de s&eacute;lectionner un style, comme italique, gras ou soulign&eacute;, ou d'appliquer un style structur&eacute; tel que Code.</li>

<li><b>Couleur de texte&nbsp;</b>: Permet de s&eacute;lectionner une couleur dans la palette. Si vous connaissez les codes de couleur hexad&eacute;cimaux HTML, vous pouvez les entrer ou simplement saisir un nom de couleur en anglais (par exemple, "blue"). D&eacute;couvrez un convertisseur de codes de couleur pratique en cliquant <a href= "http://builder.cnet.com/webbuilding/pages/QuickReference/Color/converter.html?tag=st.bl.7650.ref_l.bl_converter"  target="_blank">ici</a>.</li>
</ul>
</li>
</ol>

<p>Pour changer la couleur de fond de la page :</p>

<ol>
<li>Cliquez &agrave; un endroit quelconque de la page.</li>

<li>Cliquez sur le bloc de couleur de fond dans la barre d'outils de formatage.</li>

<li>Choisissez une couleur de fond dans la bo&icirc;te de dialogue Couleur d'arri&egrave;re-plan de bloc.</li>

<li>Cliquez sur OK.</li>
</ol>

<p><b>Astuce&nbsp;</b>: Pour adopter rapidement la derni&egrave;re couleur de texte utilis&eacute;e, s&eacute;lectionnez le texte, puis appuyez sur Maj et cliquez sur le bloc de couleur de texte dans la barre d'outils de formatage. Cela peut &ecirc;tre utile pour utiliser une couleur pour diff&eacute;rentes lignes de texte.</p>

<p>Vous pouvez &eacute;galement utiliser une image comme fond. Voir <a href= "#DOCUMENT_PROPERTIES_APPEARANCE">D&eacute;finition des couleurs et du fond de la page</a>.</p>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:removing_text_stylesIDX"></a> <a name="style_remove"></a>

<h2>Suppression ou interruption de styles de texte</h2>

<p>Pour supprimer tous les styles (gras, italique, etc.) du texte s&eacute;lectionn&eacute;&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le texte.</li>

<li>Ouvrez le menu Format et choisissez Supprimer tous les styles.</li>

<li>Continuez &agrave; taper.</li>
</ol>

<p>Pour continuer &agrave; taper du texte avec tous les styles supprim&eacute;s&nbsp;:</p>

<ol>
<li>Placez le curseur l&agrave; o&ugrave; vous souhaitez supprimer les styles.</li>

<li>Ouvrez le menu Format et choisissez Annuler tous les styles de texte.</li>

<li>Continuez &agrave; taper.</li>
</ol>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="searching_textSDX"></a> <a name="Composer:finding_replacing_textIDX"></a> <a name="FIND_TEXT"></a>

<h2>Recherche et remplacement de texte</h2>

<p>Pour rechercher du texte dans la page en cours&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur &agrave; l'endroit o&ugrave; vous souhaitez commencer la recherche.</li>

<li>Ouvrez le menu Edition et choisissez Rechercher et remplacer. La bo&icirc;te de dialogue Recherche et remplacement s'affiche.</li>

<li>Tapez le texte &agrave; rechercher dans le champ "Rechercher le texte". Pour limiter la recherche, s&eacute;lectionnez une ou plusieurs des options suivantes&nbsp;:
<p><br></p>
<ul>
<li><b>Respecter la casse&nbsp;</b>: Permet de sp&eacute;cifier si la recherche doit faire la distinction entre les minuscules et les majuscules.</li>

<li><b>Retour ligne auto&nbsp;</b>: Utilisez cette recherche jusqu'&agrave; la fin de la page et recommencez depuis le d&eacute;but ou la fin, selon que vous recherchiez vers l'avant ou l'arri&egrave;re.</li>

<li><b>En arri&egrave;re&nbsp;</b>: Permet d'effectuer une recherche depuis la position du curseur jusqu'au d&eacute;but de la page.</li>
</ul>
</li>

<li>Cliquez sur Rechercher suivant pour commencer. Lorsque Composer trouve la premi&egrave;re occurrence du texte, s&eacute;lectionnez Rechercher suivant pour rechercher l'occurrence suivante.</li>

<li>Cliquez sur Fermer lorsque vous avez termin&eacute;.</li>
</ol>

<p>Pour rechercher et remplacer du texte dans la page en cours&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur &agrave; l'endroit o&ugrave; vous souhaitez commencer la recherche.</li>

<li>Ouvrez le menu Edition et choisissez Rechercher et remplacer. La bo&icirc;te de dialogue Recherche et remplacement s'affiche.</li>

<li>Tapez le texte &agrave; rechercher, puis celui par lequel il doit &ecirc;tre remplac&eacute;.</li>

<li>Pour limiter la recherche, s&eacute;lectionnez une ou plusieurs des options suivantes&nbsp;:</li>

<ul>
<li><b>Respecter la casse&nbsp;</b>: Permet de sp&eacute;cifier si la recherche doit faire la distinction entre les minuscules et les majuscules. Si vous ne s&eacute;lectionnez pas cette option, la recherche trouvera tout texte correspondant, qu'il soit en majuscules ou en minuscules.</li>

<li><b>Retour ligne auto&nbsp;</b>: Cette option permet de rechercher jusqu'&agrave; la fin de la page, puis de recommencer &agrave; partir du d&eacute;but.</li>

<li><b>En arri&egrave;re&nbsp;</b>: Cette option permet d'effectuer une recherche de la fin de la page jusqu'&agrave; son d&eacute;but.</li>
</ul>
</li>

<li>Cliquez sur Rechercher suivant pour rechercher l'occurrence suivante. Composer trouve l'occurrence suivante du texte.</li>

<li>Cliquez sur Remplacer pour remplacer le texte s&eacute;lectionn&eacute; par le nouveau texte. Cliquez sur Remplacer et rechercher pour remplacer le texte s&eacute;lectionn&eacute; et trouver l'occurrence suivante. Cliquez sur Remplacer tout pour remplacer toutes les occurrences du texte dans le document.</li>

<li>Cliquez sur Fermer lorsque vous avez termin&eacute;.</li>
</ol>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:inserting_horizontal_linesIDX"></a> <a name="PROPERTIES_HRULE"></a>

<h2>Insertion de lignes horizontales</h2>

<p>Les lignes horizontales permettent g&eacute;n&eacute;ralement d'&eacute;tablir une s&eacute;paration visuelle entre diff&eacute;rentes sections d'un document. Pour ins&eacute;rer une ligne horizontale (&eacute;galement appel&eacute;e <i>filet</i>) dans votre page, &agrave; partir de la fen&ecirc;tre Composer&nbsp;:</p>

<ol>
<li>Placez le curseur &agrave; l'endroit o&ugrave; ins&eacute;rer la ligne.</li>

<li>Dans le menu Ins&eacute;rer, s&eacute;lectionnez Ligne horizontale.</li>
</ol>

<p>&nbsp;</p>

<a name="horiz_line"></a>

<h3>D&eacute;finition des propri&eacute;t&eacute;s de la ligne horizontale</h3>

<p>Vous pouvez personnaliser la hauteur, la longueur, la largeur, l'alignement et l'ombre de la ligne.</p>

<ol>
<li>Double-cliquez sur la ligne pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de la ligne horizontale.</li>

<li>Vous pouvez modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<ul>
<li><b>Largeur&nbsp;</b>: Entrez la largeur, puis choisissez "% de fen&ecirc;tre" ou "pixels". Si vous sp&eacute;cifiez la largeur sous la forme d'un pourcentage, la largeur de la ligne change en fonction de celle de la fen&ecirc;tre Composer ou du navigateur.</li>

<li><b>Hauteur&nbsp;</b>: Entrez la hauteur de la ligne (en pixels).</li>

<li><b>Ombrage 3 D </b>: Cette option ajoute de la profondeur &agrave; la ligne gr&acirc;ce &agrave; un ombrage en relief.</li>

<li><b>Alignement&nbsp;</b>: Sp&eacute;cifiez o&ugrave; placer la ligne (gauche, centre ou droite).</li>
</ul>
</li>

<li>Cliquez sur Utiliser comme d&eacute;faut pour utiliser ces param&egrave;tres par d&eacute;faut lors de la prochaine insertion d'une ligne horizontale.</li>

<li>Pour modifier manuellement les propri&eacute;t&eacute;s d'une ligne horizontale, cliquez sur Edition avanc&eacute;e. Voir la section <a href="#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a> pour plus de d&eacute;tails.</li>
</ol>

<p><b>Astuce&nbsp;:</b>Vous pouvez s&eacute;lectionner "Afficher toutes les &eacute;tiquettes" dans le menu Afficher pour afficher tous les &eacute;l&eacute;ments HTML dans des cadres jaunes. Cliquez sur un cadre jaune pour s&eacute;lectionner tout le contenu de l'&eacute;tiquette ou de l'&eacute;l&eacute;ment HTML. Double-cliquez sur un cadre jaune pour afficher la bo&icirc;te de dialogue <a href="#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a> pour l'&eacute;tiquette ou l'&eacute;l&eacute;ment HTML correspondant.</p>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="charactersSDX"></a> <a name="symbolsSDX"></a> <a name="Composer:special_charactersIDX"></a> <a name="SPECIAL_CHARACTERS"></a>

<h2>Insertion de caract&egrave;res sp&eacute;ciaux</h2>

<p>Pour ins&eacute;rer des caract&egrave;res sp&eacute;ciaux tels que des caract&egrave;res accentu&eacute;s, de copyright ou des symboles de devise&nbsp;:</p>

<ol>
<li>Placez le curseur &agrave; l'endroit o&ugrave; ins&eacute;rer le caract&egrave;re sp&eacute;cial.</li>

<li>Ouvrez le menu Ins&eacute;rer et choisissez Caract&egrave;res et symboles. La bo&icirc;te de dialogue Ins&eacute;rer des caract&egrave;res s'affiche.</li>

<li>Choisissez une cat&eacute;gorie de caract&egrave;res.</li>

<ul>
<li>Si vous choisissez Majuscules accentu&eacute;es ou Minuscules accentu&eacute;es, ouvrez la liste d&eacute;roulante Lettre et s&eacute;lectionnez la lettre &agrave; accentuer. Remarque&nbsp;: toutes les lettres n'ont pas de forme accentu&eacute;e. S&eacute;lectionnez Symboles courants pour ins&eacute;rer des caract&egrave;res sp&eacute;ciaux tels que le symbole de copyright ou les fractions.</li>
</ul>
</li>

<li>Dans la liste d&eacute;roulante Caract&egrave;res, s&eacute;lectionnez le caract&egrave;re &agrave; ins&eacute;rer.</li>

<li>Cliquez sur Ins&eacute;rer.

<p>Vous pouvez continuer &agrave; r&eacute;diger votre document (ou &agrave; travailler dans une fen&ecirc;tre de composition de message) en gardant cette bo&icirc;te de dialogue ouverte, au cas o&ugrave; vous en auriez encore besoin.</p>
</li>

<li>Cliquez sur Fermer lorsque vous avez fini d'ins&eacute;rer des caract&egrave;res sp&eacute;ciaux.</li>
</ol>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="javascript_in_HTML_documentsSDX"></a> <a name="source_codeSDX"></a> <a name="HTML:using_in_ComposerIDX"></a> <a name="Composer:HTML_elements_and_attributesIDX"></a> <a name="HTML_TAG"></a>

<h2>Insertion d'&eacute;l&eacute;ments et d'attributs HTML</h2>

<p>Si vous &ecirc;tes familiaris&eacute; avec le code source HTML, vous pouvez ins&eacute;rer d'autres &eacute;tiquettes, attributs de style et codes JavaScript dans votre page. Dans le cas contraire, il est pr&eacute;f&eacute;rable de ne pas les modifier. Pour travailler avec du code HTML, utilisez l'une des deux m&eacute;thodes suivantes&nbsp;:</p>

<ul>
<li>Placez le curseur l&agrave; o&ugrave; vous souhaitez ins&eacute;rer le code HTML ou s&eacute;lectionnez le texte &agrave; modifier, puis ouvrez le menu Ins&eacute;rer et choisissez HTML. Dans la bo&icirc;te de dialogue Ins&eacute;rer HTML, entrez des &eacute;tiquettes HTML et du texte, puis cliquez sur Ins&eacute;rer.</li>

<li>S&eacute;lectionnez un &eacute;l&eacute;ment tel qu'un tableau, un marqueur nomm&eacute;, une image, un lien ou une ligne horizontale. Double-cliquez sur l'&eacute;l&eacute;ment pour ouvrir la bo&icirc;te de dialogue Propri&eacute;t&eacute;s correspondante. Cliquez sur Edition avanc&eacute;e pour ouvrir l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es. Vous pouvez utiliser l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es pour ajouter des attributs HTML, des codes JavaScript et des styles CSS &agrave; des objets.</li>

<li>Ouvrez le menu Afficher, et s&eacute;lectionnez Source HTML, ou cliquez sur l'onglet &lt;HTML&gt; source dans la barre d'outils de modification au bas de la fen&ecirc;tre Composer. Si cette barre d'outils n'est pas affich&eacute;e, ouvrez le menu Afficher et choisissez Afficher/Masquer, puis v&eacute;rifiez que la barre d'outils de modification est s&eacute;lectionn&eacute;e.</li>
</ul>

<p>&nbsp;</p>

<a name="Composer:Advanced_Property_EditorIDX"></a> <a name="PROPERTY_EDITOR"></a>

<h3>Utilisation de l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es</h3>

<p>Pour ajouter des attributs HTML et des &eacute;v&eacute;nements JavaScript &agrave; des objets tels que des tableaux, images et lignes horizontales, vous pouvez utiliser l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es&nbsp;:</p>

<p><b>Remarque</b>&nbsp;: A moins de comprendre parfaitement comment ajouter, supprimer ou modifier des attributs HTML et les valeurs associ&eacute;es, il est pr&eacute;f&eacute;rable de s'en abstenir.</p>

<p>Si la bo&icirc;te de dialogue Editeur des propri&eacute;t&eacute;s avanc&eacute;es n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Afficher (ou la barre d'outils de modification), s&eacute;lectionnez Afficher toutes les &eacute;tiquettes.</li>

<li>Double-cliquez sur l'objet &agrave; modifier pour ouvrir la bo&icirc;te de dialogue Propri&eacute;t&eacute;s correspondante.</li>

<li>Cliquez sur Edition avanc&eacute;e pour ouvrir l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es de l'objet. L'Editeur de propri&eacute;t&eacute;s avanc&eacute;es comprend trois onglets, affichant chacun les propri&eacute;t&eacute;s de l'objet s&eacute;lectionn&eacute;&nbsp;:</li>

<ul>
<li><b>Attributs HTML&nbsp;</b>: Cliquez sur cet onglet pour afficher ou entrer des attributs HTML.</li>

<li><b>Style incorpor&eacute;&nbsp;</b>: Cliquez sur cet onglet pour afficher ou entrer des propri&eacute;t&eacute;s CSS (cascading style sheet) &agrave; l'aide de l'attribut &lt;style&gt;. Pour plus d'informations sur l'utilisation des styles CSS dans Composer, voir <a href="#PREFERENCES_EDITOR_GENERAL">Pr&eacute;f&eacute;rences de Composer - Composer</a>.</li>

<li><b>Ev&eacute;nements JavaScript</b>: Cliquez sur cet onglet pour afficher ou entrer des &eacute;v&eacute;nements JavaScript.</li>
</ul>
</li>

<li>Pour modifier une propri&eacute;t&eacute; ou un attribut dans l'une des trois listes, s&eacute;lectionnez-le. Vous pouvez alors modifier le nom ou la valeur de l'attribut &agrave; l'aide des champs modifiables Nom et Valeur au bas de la bo&icirc;te de dialogue. Pour ajouter un attribut, tapez-le dans le champ Attribut au bas de la bo&icirc;te de dialogue. Le nouvel attribut est automatiquement ajout&eacute; lorsque vous cliquez dans le champ Valeur. Pour supprimer un attribut, s&eacute;lectionnez-le dans la liste et cliquez sur Supprimer l'attribut.

<p><b>Remarque</b>&nbsp;: Les attributs obligatoires sont mis en surbrillance dans la liste.</p>
</li>

<li>Cliquez sur OK pour appliquer les modifications de la bo&icirc;te de dialogue Editeur de propri&eacute;t&eacute;s avanc&eacute;es.</li>

<li>Cliquez de nouveau sur OK pour quitter la bo&icirc;te de dialogue Propri&eacute;t&eacute;s.</li>
</ol>

<p>Composer place automatiquement le texte d'attribut entre guillemets.</p>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:checking_spellingIDX"></a> <a name="SPELL_CHECK"></a>

<h2>V&eacute;rification orthographique</h2>

<p>Composer v&eacute;rifie toujours l'orthographe depuis le d&eacute;but du document, quel que soit l'endroit o&ugrave; vous avez plac&eacute; le curseur.</p>

<p>Pour v&eacute;rifier l'orthographe de la page&nbsp;:</p>

<ol>
<li>Cliquez sur le bouton Orthographe de la barre d'outils ou choisissez Orthographe dans le menu Edition.</li>

<li>Utilisez la bo&icirc;te de dialogue Orthographe pour corriger les fautes et modifier ou ajouter des entr&eacute;es au dictionnaire utilisateur en cours. Cliquez sur Fermer lorsque vous avez termin&eacute;.</li>

<li style="list-style: none">
<ul>
<li><b>Rev&eacute;rifier la page&nbsp;</b>: Cliquez pour recommencer la v&eacute;rification orthographique et rev&eacute;rifier les mots. Cette fonction est g&eacute;n&eacute;ralement utile lorsque vous changez de langue et souhaitez rev&eacute;rifier l'orthographe du document.</li>

<li><b>V&eacute;rifier le mot&nbsp;</b>: Ce bouton permet de v&eacute;rifier l'orthographe du mot entr&eacute; dans le champ "Nouveau mot".</li>

<li><b>Remplacer</b> et <b>Remplacer tout&nbsp;</b>: Cliquez pour remplacer le mot ou toutes ses occurrences.</li>

<li><b>Ignorer</b> et <b>Ignorer tout&nbsp;</b>: Cliquez pour continuer la v&eacute;rification sans modifier le mot ou pour ignorer toutes ses occurrences.</li>

<li><b>Ajouter le mot&nbsp;</b>: Cliquez pour ajouter le mot &agrave; votre dictionnaire personnel afin que Composer le reconnaisse au lieu de le d&eacute;signer comme un mot mal orthographi&eacute;.</li>

<li><b>Modifier&nbsp;</b>: Cliquez pour ajouter, remplacer et supprimer des mots du dictionnaire utilisateur.</li>

<li><b>Langue&nbsp;</b>: Choisissez la langue &agrave; utiliser par le v&eacute;rificateur d'orthographe.</li>
</ul>
</li>
</ol>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="HTML_formattingSDX"></a> <a name="validate_html_in_a_documentSDX"></a> <a name="Composer:checking_htmlIDX"></a> <a name="HTML_VALIDATE"></a>

<h2>Validation du code HTML</h2>

<p>Avant de placer votre document sur un serveur Web pour permettre &agrave; d'autres utilisateurs de le consulter, il convient d'en v&eacute;rifier le formatage HTML pour s'assurer qu'il est conforme aux standards Web. Les documents contenant du code HTML valid&eacute; sont moins susceptibles de causer des probl&egrave;mes lors de leur consultation &agrave; l'aide de diff&eacute;rents navigateurs. La simple v&eacute;rification de vos pages Web dans Navigator ne garantit pas que votre document s'affichera correctement dans d'autres navigateurs Web.</p>

<p>Composer offre un moyen pratique de v&eacute;rifier que votre document est conforme aux standards HTML W3C (World Wide Web Consortium). Composer utilise le service de validation HTML W3C, qui v&eacute;rifie que la syntaxe HTML de votre document est conforme aux standards HTML 4.01. Ce service fournit &eacute;galement des informations sur la fa&ccedil;on de corriger les erreurs.</p>

<p><b>Remarque</b>&nbsp;: Il est indispensable d'&ecirc;tre connect&eacute; &agrave; Internet pour utiliser cette fonction.</p>

<p>Pour valider la syntaxe HTML de votre document :</p>

<ol>
<li>Dans le menu Outils, choisissez Valider HTML. Si des modifications n'ont pas &eacute;t&eacute; enregistr&eacute;es, Composer affiche un message vous invitant &agrave; les enregistrer avant de continuer.</li>

<li>Lorsque la page du service de validation HTML W3C appara&icirc;t, cliquez sur Choisir et localisez le fichier que vous souhaitez valider sur votre disque dur.</li>

<li>Cliquez sur "Valider ce document".</li>
</ol>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:editing_modesIDX"></a> <a name="Edit_modes"></a>

<h2>S&eacute;lection du mode d'&eacute;dition correct</h2>

<p>Il n'est g&eacute;n&eacute;ralement pas n&eacute;cessaire de changer le mode d'&eacute;dition par d&eacute;faut (Normal). Toutefois, si vous souhaitez travailler avec le code source HTML du document, vous devrez changer de mode d'&eacute;dition.</p>

<p>Composer permet d'alterner rapidement entre quatre modes d'&eacute;dition ou vues. Chaque mode d'&eacute;dition permet de continuer &agrave; travailler sur le document, en affichant diff&eacute;rents niveaux d'&eacute;tiquettes HTML (et d'ic&ocirc;nes d'&eacute;tiquettes).</p>

<p>Avant de s&eacute;lectionner un mode d'&eacute;dition&nbsp;:</p>

<ul>
<li>Ouvrez le menu Afficher, choisissez Afficher/Masquer et v&eacute;rifiez que l'option Barre d'outils de modification est s&eacute;lectionn&eacute;e.</li>
</ul>

<p>La barre d'outils de modification comprend quatre onglets&nbsp;:</p>

<ul>
<li><b>Normal&nbsp;</b>: Choisissez ce mode d'&eacute;dition pour voir de quoi aura l'air le document en ligne pendant que vous le cr&eacute;ez. S&eacute;lectionnez ce mode pour afficher les bordures de tableau et les ic&ocirc;nes de marqueurs nomm&eacute;s. Toutes les autres ic&ocirc;nes d'&eacute;tiquettes HTML sont masqu&eacute;es.</li>

<li><b>Afficher toutes les &eacute;tiquettes&nbsp;</b>: S&eacute;lectionnez ce mode pour afficher toutes les ic&ocirc;nes d'&eacute;tiquettes HTML.</li>

<li><b>&lt;HTML&gt; source</b>&nbsp;: Choisissez ce mode pour afficher et modifier le document sous forme de code source HTML non format&eacute;. Lorsque vous enregistrez le document, le mode Normal r&eacute;appara&icirc;t.</li>

<li><b>Test&nbsp;</b>: Choisissez ce mode pour afficher le document exactement tel qu'il appara&icirc;trait dans une fen&ecirc;tre de navigateur et le modifier, &agrave; ceci pr&egrave;s que les liens et les fonctions JavaScript ne seront pas actifs.</li>
</ul>

<p><b>Remarque</b>&nbsp;: Les fonctions JavaScript, cadres, liens et fichiers gif anim&eacute;s ne sont activ&eacute;s dans aucun des modes d'&eacute;dition. Pour afficher ces &eacute;l&eacute;ments &agrave; l'&eacute;tat activ&eacute;, cliquez sur le bouton Parcourir dans la barre d'outils de r&eacute;daction pour charger la page dans une fen&ecirc;tre de navigateur.</p>

<p>[&nbsp;<a href="#page_change">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:adding_tablesIDX"></a> <a name="Composer:editing_tablesIDX"></a>

<hr> <a name="page_table"></a>
<h1>Ajout de tableaux &agrave; votre page Web</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#Inserting_a_table">Insertion d'un tableau</a></p>

<p><a href="#Setting_table_properties">Modification des propri&eacute;t&eacute;s d'un tableau</a></p>

<p><a href="#addtable">Ajout et suppression de lignes, colonnes et cellules</a></p>

<p><a href="#TABLE_SELECTION">S&eacute;lection d'&eacute;l&eacute;ments de tableau</a></p>

<p><a href="#select_table">D&eacute;placement, copie et suppression de tableaux</a></p>

<p><a href="#tableize">Conversion de texte en tableau</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="Inserting_a_table"></a>

<h2>Insertion d'un tableau</h2>

<p>Les tableaux sont utiles pour organiser du texte, des images et des donn&eacute;es en les pr&eacute;sentant dans des lignes et colonnes format&eacute;es. Pour ins&eacute;rer un tableau&nbsp;:</p>

<ol>
<li>Placez le curseur &agrave; l'endroit o&ugrave; ins&eacute;rer le tableau.</li>

<li>Cliquez sur le bouton Tableau <img src="images/table.gif" width="25" height="26" alt="" border="0"> dans la barre d'outils de r&eacute;daction. La bo&icirc;te de dialogue Ins&eacute;rer un tableau s'affiche.</li>

<li>Entrez le nombre de lignes et de colonnes d&eacute;sir&eacute;.</li>

<ul>
<li>(Facultatif) Entrez la largeur du tableau, en pixels ou pourcentage de la fen&ecirc;tre.</li>
</ul>
</li>

<li>Entrez l'&eacute;paisseur de la bordure (en pixels, z&eacute;ro pour ne pas avoir de bordure).

<p><b>Remarque</b>&nbsp;: Composer utilise une ligne rouge discontinue pour repr&eacute;senter les tableaux sans bordure&nbsp;; cette ligne dispara&icirc;t lors de l'affichage de la page dans un navigateur.</p>
</li>

<li>Pour appliquer d'autres attributs de tableau ou codes JavaScript, cliquez sur Edition avanc&eacute;e pour afficher l'<a href="#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a>.</li>

<li>Cliquez sur OK pour confirmer les param&egrave;tres et afficher le nouveau tableau.</li>
</ol>

<p>Pour modifier d'autres propri&eacute;t&eacute;s du tableau, voir <a href= "#Setting_table_properties">Modification des propri&eacute;t&eacute;s d'un tableau</a>.</p>

<p><strong>Astuce&nbsp;</strong>: Pour ins&eacute;rer un tableau dans un tableau, ouvrez le menu Ins&eacute;rer et choisissez Tableau.</p>

<p>[&nbsp;<a href="#page_table">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Setting_table_properties"></a>

<h2>Modification des propri&eacute;t&eacute;s d'un tableau</h2>

<p>Cette section d&eacute;crit comment modifier l'ensemble des propri&eacute;t&eacute;s d'un tableau, ainsi que de ses diff&eacute;rentes lignes, colonnes ou cellules. Si la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du tableau n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le tableau ou cliquez dedans.</li>

<li>Cliquez sur le bouton Tableau <img src="images/table.gif" width="25" height="26" alt="" border="0"> de la barre d'outils ou s&eacute;lectionnez Propri&eacute;t&eacute;s du tableau dans le menu Tableau. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s du tableau contient deux onglets&nbsp;: Tableau et Cellules.</li>

<li>Cliquez sur l'onglet Tableau pour modifier les propri&eacute;t&eacute;s&nbsp;:</li>

<ul>
<li><b>Taille&nbsp;</b>: Permet de sp&eacute;cifier le nombre de lignes et de colonnes. Entrez la largeur du tableau, puis choisissez "% de fen&ecirc;tre" ou "pixels." Si vous sp&eacute;cifiez la largeur sous la forme d'un pourcentage, les dimensions du tableau se modifient en fonction de celles de la fen&ecirc;tre Composer ou du navigateur.</li>

<li><b>Bordures et espacement&nbsp;</b>: Permet de sp&eacute;cifier, en pixels, la largeur de la bordure, l'espacement entre les cellules et le remplissage (espacement entre le contenu de la cellule et sa bordure).

<p><b>Remarque</b>&nbsp;: Composer utilise un contour discontinu pour repr&eacute;senter les tableaux sans bordure&nbsp;; cette ligne dispara&icirc;t lors de l'affichage de la page &agrave; l'aide d'un navigateur.</p>
</li>

<li><b>Alignement&nbsp;du tableau&nbsp;</b>: Permet d'aligner le tableau dans la page. S&eacute;lectionnez une option dans la liste d&eacute;roulante.</li>

<li><b>L&eacute;gende&nbsp;</b>: Permet de s&eacute;lectionner l'emplacement de la l&eacute;gende dans la liste d&eacute;roulante.</li>

<li><b>Arri&egrave;re-plan&nbsp;</b>: Permet de s&eacute;lectionner une couleur de fond pour le tableau ou de le laisser transparent.</li>
</ul>
</li>

<li>Pour appliquer d'autres attributs ou &eacute;v&eacute;nements JavaScript, cliquez sur Edition avanc&eacute;e pour afficher l'<a href="#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a>.</li>

<li>Cliquez sur Appliquer pour pr&eacute;visualiser les modifications sans fermer la bo&icirc;te de dialogue ou sur OK pour les confirmer.</li>
</ol>

<p>Pour afficher, modifier ou ajouter des propri&eacute;t&eacute;s pour une ou plusieurs cellules&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez la ligne, la colonne ou la cellule, puis ouvrez le menu Tableau et s&eacute;lectionnez Propri&eacute;t&eacute;s du tableau. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s du tableau s'affiche.</li>

<li>Cliquez sur l'onglet Cellules pour modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<ul>
<li><b>S&eacute;lection&nbsp;</b>: Choisissez Cellule, Ligne ou Colonne dans la liste d&eacute;roulante. Cliquez sur Pr&eacute;c&eacute;dent ou Suivant pour vous d&eacute;placer dans les lignes, colonnes ou cellules.</li>

<li><b>Taille&nbsp;</b>: Entrez un nombre pour Hauteur et Largeur, puis choisissez "% de la table" ou "pixels."</li>

<li><b>Alignement du contenu&nbsp;</b>: S&eacute;lectionnez un type d'alignement vertical et horizontal des donn&eacute;es ou du texte dans chaque cellule.</li>

<li><b>Style de cellule&nbsp;</b>: S&eacute;lectionnez En-t&ecirc;te dans la liste d&eacute;roulante pour les en-t&ecirc;tes de colonne ou de ligne (ce qui centre le texte de la cellule et le met en gras)&nbsp;; dans le cas contraire, choisissez Normal.</li>

<li><b>Retour auto&nbsp;</b>: S&eacute;lectionnez "Pas de retour auto" dans la liste d&eacute;roulante pour emp&ecirc;cher le retour du texte &agrave; la ligne &agrave; moins d'ins&eacute;rer un retour chariot. Dans les autres cas, s&eacute;lectionnez Retour ligne auto.</li>

<li><b>Arri&egrave;re-plan&nbsp;</b>: Permet de s&eacute;lectionner une couleur de fond de la cellule ou de la laisser transparente.</li>
</ul>

<p><b>Remarque</b>&nbsp;: Pour appliquer d'autres attributs ou &eacute;v&eacute;nements JavaScript, cliquez sur Edition avanc&eacute;e pour afficher l'<a href= "#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a>.</p>
</li>

<li>Cliquez sur Appliquer pour pr&eacute;visualiser les modifications sans fermer la bo&icirc;te de dialogue ou sur OK pour les confirmer.</li>
</ol>

<p><b>Astuce&nbsp;</b>: Pour modifier la couleur de texte ou de fond d'une ou plusieurs cellules s&eacute;lectionn&eacute;es ou de l'ensemble du tableau, s&eacute;lectionnez les cellules ou cliquez en un point quelconque du tableau puis cliquez sur l'ic&ocirc;ne de couleur de texte ou de fond dans la barre d'outils de formatage.</p>

<p><b>Astuce&nbsp;</b>: Pour adopter la derni&egrave;re couleur de cellule utilis&eacute;e, s&eacute;lectionnez la cellule, puis appuyez sur Maj et cliquez sur la palette de couleurs de fond. Cela peut &ecirc;tre utile pour s&eacute;lectionner une couleur pour diff&eacute;rentes cellules.</p>

<p>[&nbsp;<a href="#page_table">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="adding:table_elementsIDX"></a> <a name="addtable"></a>

<h2>Ajout et suppression de lignes, colonnes et cellules</h2>

<p>Composer permet d'ajouter ou de supprimer rapidement une ou plusieurs cellules, colonnes ou lignes dans le tableau. En outre, vous pouvez d&eacute;finir des options permettant de conserver la structure rectangulaire originale ou la pr&eacute;sentation du tableau pendant la modification.</p>

<p>Pour ajouter une cellule, une ligne ou une colonne au tableau&nbsp;:</p>

<ol>
<li>Cliquez dans le tableau &agrave; l'endroit o&ugrave; ins&eacute;rer la ou les cellules.</li>

<li>Ouvrez le menu Tableau, puis choisissez Ins&eacute;rer.</li>

<li>S&eacute;lectionnez l'un des groupes de cellules. Vous pouvez &eacute;galement ins&eacute;rer un nouveau tableau dans une cellule.</li>
</ol>

<p>Pour supprimer une cellule, une ligne ou une colonne&nbsp;:</p>

<ol>
<li>Cliquez sur une ligne, une colonne ou une cellule pour placer le curseur. Vous pouvez &eacute;galement s&eacute;lectionner des cellules voisines pour en supprimer plusieurs &agrave; la fois. Pour s&eacute;lectionner des cellules voisines, faites glisser le curseur sur les cellules &agrave; s&eacute;lectionner. Pour s&eacute;lectionner des cellules individuelles, maintenez la touche Ctrl (Windows et Linux) ou Commande (Macintosh) enfonc&eacute;e tout en cliquant sur les cellules &agrave; s&eacute;lectionner.</li>

<li>Ouvrez le menu Tableau et choisissez Supprimer.</li>

<li>Cliquez sur l'&eacute;v&eacute;nement &agrave; supprimer.</li>
</ol>

<p>Pour fusionner une cellule avec celle situ&eacute;e &agrave; sa droite&nbsp;:</p>

<ul>
<li>Cliquez dans la cellule de gauche, ouvrez le menu Tableau et choisissez Fusionner &agrave; droite.</li>
</ul>

<p>Pour fusionner des cellules adjacentes&nbsp;:</p>

<ul>
<li>S&eacute;lectionnez des cellules adjacentes en faisant glisser le curseur dessus.</li>

<li>Ouvrez le menu Tableau et choisissez Fusionner les cellules s&eacute;lectionn&eacute;es.</li>
</ul>

<p>Pour scinder une cellule fusionn&eacute;e&nbsp;:</p>

<ul>
<li>Cliquez dans la cellule fusionn&eacute;e, ouvrez le menu Tableau, puis choisissez Scinder la cellule. Composer place tout le contenu de la cellule fusionn&eacute;e dans la premi&egrave;re des deux cellules.</li>
</ul>

<p>Voir <a href="#TABLE_SELECTION">S&eacute;lection d'&eacute;l&eacute;ments de tableau</a> pour plus d'informations sur la s&eacute;lection de cellules, lignes et colonnes non adjacentes.</p>

<p>&nbsp;</p>

<a name="table_editing_default"></a>

<h3>Modification du comportement de modification de tableaux par d&eacute;faut</h3>

<p>Par d&eacute;faut, lorsque vous supprimez une ou plusieurs cellules, Composer pr&eacute;serve la structure du tableau en ajoutant des cellules en fin de ligne, au besoin. Vous pouvez ainsi supprimer une ou plusieurs cellules tout en conservant la structure rectangulaire originale ou la pr&eacute;sentation du tableau. Dans le cas contraire, la suppression de cellules peut entra&icirc;ner la formation d'espaces dans le tableau ou de contours irr&eacute;guliers en raison d'un nombre irr&eacute;gulier de cellules.</p>

<p>Pour modifier le comportement de modification de tableaux par d&eacute;faut, &agrave; partir de la fen&ecirc;tre Composer :</p>

<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences, puis Composer.</li>

<li>Sous Modification de tableaux, r&eacute;glez la pr&eacute;f&eacute;rence suivante&nbsp;:</li>

<ul>
<li>Veillez &agrave; cocher "Conserver la disposition du tableau lors de l'insertion ou de la suppression de cellules" pour que le tableau ne devienne pas irr&eacute;gulier.</li>
</ul>
</li>

<li>Cliquez sur OK.</li>
</ol>

<p>Voir &eacute;galement <a href="#PREFERENCES_EDITOR_GENERAL">D&eacute;finition des pr&eacute;f&eacute;rences g&eacute;n&eacute;rales de Composer</a>.</p>

<p>[&nbsp;<a href="#page_table">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="TABLE_SELECTION"></a>

<h2>S&eacute;lection d'&eacute;l&eacute;ments de tableau</h2>

<p>Proc&eacute;dez comme suit pour s&eacute;lectionner rapidement un tableau, une cellule ou un groupe de cellules&nbsp;:</p>

<ul>
<li>Cliquez dans le tableau, ouvrez le menu Tableau, choisissez S&eacute;lectionner et s&eacute;lectionnez une option du sous-menu. Par exemple, pour s&eacute;lectionner un tableau, cliquez en un point quelconque de ce dernier, ouvrez le menu Tableau et choisissez S&eacute;lectionner, puis Tableau.</li>

<li>Vous pouvez &eacute;galement utiliser la souris comme outil de s&eacute;lection :</li>

<li style="list-style: none">
<ul>
<li>Pour s&eacute;lectionner un groupe de cellules adjacentes&nbsp;: cliquez dans une cellule, puis faites glisser le curseur pour s&eacute;lectionner les cellules d&eacute;sir&eacute;es. Faites glisser la souris vers la gauche ou la droite pour s&eacute;lectionner une ligne&nbsp;; vers le haut ou le bas pour une colonne.</li>

<li>Pour s&eacute;lectionner des cellules non adjacentes&nbsp;: appuyez sur Ctrl (Windows ou Linux) ou Commande (Macintosh) et cliquez dans une cellule. Maintenez la touche Ctrl (Windows ou Linux) ou Commande (Macintosh) enfonc&eacute;e en cliquant sur les cellules.</li>

<li>Pour &eacute;tendre la s&eacute;lection aux cellules adjacentes&nbsp;: cliquez dans une cellule, puis faites glisser le curseur sur les autres cellules de mani&egrave;re &agrave; &eacute;tendre la s&eacute;lection.</li>

<li>Pour s&eacute;lectionner une ou plusieurs lignes ou colonnes adjacentes&nbsp;: faites glisser le curseur vers le haut ou le bas pour s&eacute;lectionner la premi&egrave;re colonne ou ligne, puis vers la gauche ou la droite pour s&eacute;lectionner d'autres colonnes ou lignes adjacentes. Appuyez sur Maj et faites glisser le curseur vers la droite pour s&eacute;lectionner une ligne enti&egrave;re. Appuyez sur Maj et faites glisser le curseur vers le haut ou le bas pour s&eacute;lectionner une colonne enti&egrave;re.</li>
</ul>
</li>
</ul>

<p>[&nbsp;<a href="#page_table">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="select_table"></a>

<h2>D&eacute;placement, copie et suppression de tableaux</h2>

<p>Pour d&eacute;placer un tableau&nbsp;:</p>

<ol>
<li>Cliquez dans le tableau.</li>

<li>Dans le menu Tableau, choisissez S&eacute;lectionner, puis Tableau.</li>
</ol>

<ul>
<li>Pour copier ou d&eacute;placer le tableau&nbsp;: Utilisez les options Couper, Copier et Coller du menu Edition.</li>

<li>Pour supprimer le tableau&nbsp;: Dans le menu Tableau, choisissez Supprimer, puis Tableau.</li>
</ul>

<p>&nbsp;</p>

<a name="tableize"></a>

<h2>Conversion de texte en tableau</h2>

<p>Pour convertir du texte en tableau&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le texte &agrave; convertir en tableau. N'oubliez pas que Composer cr&eacute;e une ligne de tableau pour chaque paragraphe de la s&eacute;lection.</li>

<li>Dans le menu Tableau, choisissez Cr&eacute;er un tableau &agrave; partir de la s&eacute;lection. La bo&icirc;te de dialogue Convertir en tableau s'affiche.</li>

<li>Choisissez le caract&egrave;re &agrave; utiliser par Composer pour diviser la s&eacute;lection en colonnes ou sp&eacute;cifiez-en un autre. Si vous choisissez Espace comme s&eacute;parateur pour les colonnes, pr&eacute;cisez si vous souhaitez que Composer ignore les espaces multiples et les traite comme un seul espace.</li>

<li>Laissez la case "Supprimer le caract&egrave;re de s&eacute;paration" coch&eacute;e pour que Composer supprime le caract&egrave;re de s&eacute;paration lors de la conversion de texte en tableau. Pour que Composer ne supprime pas le caract&egrave;re de s&eacute;paration, d&eacute;s&eacute;lectionnez cette option.</li>

<li>Cliquez sur OK.</li>
</ol>

<p><strong>Remarque</strong>&nbsp;: Le formatage du texte est perdu lorsque le texte s&eacute;lectionn&eacute; est converti en tableau.</p>

<p>[&nbsp;<a href="#page_table">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>



<hr> <a name="page_picture"></a> <a name="adding:images_to_web_pagesIDX"></a>

<h1>Ajout d'images &agrave; votre page Web</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#Insert_an_image">Insertion d'une image dans la page</a></p>

<p><a href="#PROPERTIES_IMAGE">Modification des propri&eacute;t&eacute;s d'image</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="GIFSDX"></a> <a name="JPEGSDX"></a> <a name="JPGSDX"></a> <a name="PNGSDX"></a> <a name="BMPSDX"></a> <a name="Composer:inserting_imagesIDX"></a> <a name="Insert_an_image"></a>

<h2>Insertion d'une image dans la page</h2>

<p>Vous pouvez ins&eacute;rer des images GIF, JPEG, BMP et PNG (Portable Network Graphics) dans la page Web. Vous pouvez &eacute;galement les utiliser pour <a href="#Linking_images">cr&eacute;er des liens</a>. Lorsque vous ins&eacute;rez une image, Composer enregistre une r&eacute;f&eacute;rence &agrave; cette derni&egrave;re dans la page.</p>

<p><strong>Remarque</strong>&nbsp;: Si vous pr&eacute;voyez de publier vos pages sur le Web, mieux vaut ne pas utiliser d'images BMP.</p>

<p><strong>Astuce&nbsp;</strong>: Il est pr&eacute;f&eacute;rable de commencer par enregistrer ou publier votre page avant d'y ins&eacute;rer des images. Cela permet &agrave; Composer d'utiliser automatiquement des r&eacute;f&eacute;rences relatives aux images lorsque vous les ins&eacute;rez.</p>

<p>Pour ins&eacute;rer une image&nbsp;:</p>

<ol>
<li>Placez le curseur &agrave; l'endroit o&ugrave; ins&eacute;rer l'image.</li>

<li>Cliquez sur le bouton Image <img src="images/image.gif" width="23" height="25" alt="" border="0"> de la barre d'outils ou ouvrez le menu Ins&eacute;rer et choisissez Image. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s de l'image s'affiche.</li>

<li>Entrez le nom et l'emplacement du fichier image ou cliquez sur Choisir le fichier pour le rechercher sur le disque dur ou le r&eacute;seau.</li>

<li>Tapez une description simple de l'image &agrave; afficher comme texte alternatif dans les navigateurs en texte seul (ainsi que dans d'autres navigateurs) lorsqu'une image est en cours de chargement ou que le chargement des images est d&eacute;sactiv&eacute;.

<p>Vous pouvez aussi choisir de ne pas inclure de texte alternatif.</p>
</li>

<li>Au besoin, cliquez sur d'autres onglets pour d&eacute;finir les param&egrave;tres de la bo&icirc;te de dialogue <a href="#PROPERTIES_IMAGE">Propri&eacute;t&eacute;s de l'image</a> (l'alignement, par exemple).</li>
</ol>

<p><b>Astuce&nbsp;</b>: Pour ins&eacute;rer rapidement une image&nbsp;: Glissez-d&eacute;placez-la sur la page.</p>

<p><b>Astuce&nbsp;</b>: Pour ins&eacute;rer un saut de ligne apr&egrave;s toutes les images dans un paragraphe, choisissez Saut sous les images dans le menu Ins&eacute;rer.</p>

<p>[&nbsp;<a href="#page_picture">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="PROPERTIES_IMAGE"></a> <a name="Composer:editing_image_propertiesIDX"></a>

<h2>Modification des propri&eacute;t&eacute;s d'image</h2>

<p>Une fois une image ins&eacute;r&eacute;e dans la page, vous pouvez modifier ses propri&eacute;t&eacute;s et personnaliser la pr&eacute;sentation de la page, comme la hauteur, la largeur, l'espacement et l'alignement du texte. Si la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de l'image n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:</p>

<p>Pour modifier les propri&eacute;t&eacute;s de l'image s&eacute;lectionn&eacute;e&nbsp;:</p>

<ol>
<li>Double-cliquez sur l'image ou s&eacute;lectionnez-la et cliquez sur le bouton Image <img src="images/image.gif" width="23" height="25" alt="" border= "0"> de la barre d'outils pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de l'image.</li>

<li>Cliquez sur l'onglet Emplacement pour modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<ul>
<li><b>Emplacement de l'image&nbsp;</b>: Entrez le nom et l'emplacement du fichier image. Cliquez sur Choisir le fichier pour rechercher un fichier image sur le disque dur ou le r&eacute;seau.</li>

<li><b>L'URL est relative &agrave; l'emplacement de la page </b>: Si cette option est s&eacute;lectionn&eacute;e, Composer convertit l'adresse URL de sorte qu'elle soit relative &agrave; l'emplacement de la page. Cela s'av&egrave;re particuli&egrave;rement utile si vous comptez publier vos pages sur un serveur Web pour que d'autres personnes puissent les consulter. L'utilisation d'adresses URL relatives permet de conserver tous les fichiers li&eacute;s au m&ecirc;me endroit les uns par rapport aux autres, quel que soit leur emplacement sur votre disque dur ou sur un serveur Web.

<p>Lorsque cette case est d&eacute;sactiv&eacute;e, Composer convertit l'adresse URL en une adresse URL compl&egrave;te (absolue). Les adresses URL absolues s'utilisent g&eacute;n&eacute;ralement lors de la liaison &agrave; des images situ&eacute;es sur d'autres serveurs Web (non stock&eacute;es localement sur votre disque dur).</p>

<p>Si n'avez pas encore enregistr&eacute; ni publi&eacute; la page, vous devez commencer par l'enregistrer pour pouvoir cocher cette case. La case &agrave; cocher n'est pas disponible si vous ouvrez la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de l'image dans une fen&ecirc;tre de composition de message.</p>
</li>

<li><b>Texte alternatif&nbsp;</b>: Entrez le texte &agrave; afficher au lieu de l'image originale&nbsp;; par exemple, une l&eacute;gende ou une br&egrave;ve description de l'image. Il est utile de sp&eacute;cifier un texte alternatif pour les utilisateurs utilisant des navigateurs Web texte seulement ou ayant d&eacute;sactiv&eacute; le chargement des images.</li>

<li><strong>Ne pas utiliser le texte alternatif </strong>: Choisissez cette option si l'image n'a pas besoin d'un texte alternatif ou si vous ne souhaitez pas en inclure un.</li>
</ul>
</li>

<li>Cliquez sur l'onglet Dimensions pour modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<ul>
<li><b>Taille r&eacute;elle&nbsp;</b>: S&eacute;lectionnez cette option pour annuler toutes les modifications apport&eacute;es aux dimensions de l'image et en r&eacute;tablir la taille d'origine.</li>

<li><b>Taille personnalis&eacute;e&nbsp;</b>: S&eacute;lectionnez cette option et sp&eacute;cifiez la nouvelle hauteur et la nouvelle largeur, en pixels ou sous la forme d'un pourcentage. Ce param&egrave;tre n'affecte pas le fichier image original, mais uniquement l'image ins&eacute;r&eacute;e dans la page.</li>

<li><b>Contrainte&nbsp;</b>: Si vous modifiez la taille de l'image, il est utile de s&eacute;lectionner cette option pour conserver ses proportions (et &eacute;viter ainsi toute distorsion). Si vous s&eacute;lectionnez cette option, il suffit de modifier la hauteur ou la largeur, mais pas les deux.</li>
</ul>
</li>

<li>Cliquez sur l'onglet Aspect pour modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<ul>
<li><b>Espacement&nbsp;</b>: Sp&eacute;cifiez la taille de l'espacement entre l'image et le texte voisin, tout autour de l'image. Vous pouvez &eacute;galement entourer l'image d'une bordure noire unie et sp&eacute;cifier son &eacute;paisseur en pixels. Indiquez z&eacute;ro pour ne pas avoir de bordure.</li>

<li><b>Aligner le texte sur l'image&nbsp;</b>: Si vous avez plac&eacute; l'image &agrave; proximit&eacute; d'un texte, s&eacute;lectionnez une ic&ocirc;ne d'alignement pour indiquer le positionnement du texte par rapport &agrave; l'image.</li>

<li><b>Corresp. image&nbsp;</b>: Cliquez sur Supprimer pour supprimer des param&egrave;tres de correspondance d'image.</li>
</ul>
</li>

<li>Cliquez sur l'onglet Lien pour modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<ul>
<li><b>Entrez une adresse de page Web</b> : Si vous souhaitez d&eacute;finir un lien pour cette image, entrez l'adresse URL d'une page distante ou locale, ou s&eacute;lectionnez un marqueur nomm&eacute; ou un titre dans la liste d&eacute;roulante. Cliquez sur Choisir le fichier pour rechercher un fichier image sur le disque dur ou le r&eacute;seau.</li>

<li><b>L'URL est relative &agrave; l'emplacement de la page </b>: Si cette option est s&eacute;lectionn&eacute;e, Composer convertit l'adresse URL de sorte qu'elle soit relative &agrave; l'emplacement de la page. Cela s'av&egrave;re particuli&egrave;rement utile si vous comptez publier vos pages sur un serveur Web pour que d'autres personnes puissent les consulter. L'utilisation d'adresses URL relatives permet de conserver tous les fichiers li&eacute;s au m&ecirc;me endroit les uns par rapport aux autres, quel que soit leur emplacement sur votre disque dur ou sur un serveur Web.

<p>Lorsque cette case est d&eacute;sactiv&eacute;e, Composer convertit l'adresse URL en une adresse URL compl&egrave;te (absolue). Les adresses URL absolues s'utilisent g&eacute;n&eacute;ralement lors de la liaison &agrave; des images situ&eacute;es sur d'autres serveurs Web (non stock&eacute;es localement sur votre disque dur).</p>

<p>Si des modifications n'ont pas &eacute;t&eacute; enregistr&eacute;es, vous devez enregistrer la page avant de pouvoir cocher cette case. La case &agrave; cocher n'est pas disponible si vous ouvrez la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de l'image dans une fen&ecirc;tre de composition de message.</p>
</li>

<li><strong>Afficher une bordure autour de l'image li&eacute;e </strong>: Si cette option est coch&eacute;e, l'image est entour&eacute;e de la couleur de mise en surbrillance des liens.</li>
</ul>
</li>

<li>Pour appliquer d'autres attributs ou &eacute;v&eacute;nements JavaScript, cliquez sur Edition avanc&eacute;e pour afficher l'<a href="#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a>.</li>

<li>Cliquez sur OK pour confirmer vos modifications.</li>
</ol>

<p>[&nbsp;<a href="#page_picture">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>


<hr> <a name="page_properties"></a>
<h1>R&eacute;glage des propri&eacute;t&eacute;s de page</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="370" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#DOCUMENT_PROPERTIES_GENERAL">D&eacute;finition des propri&eacute;t&eacute;s de la page et des m&eacute;ta-&eacute;tiquettes</a></p>

<p><a href="#DOCUMENT_PROPERTIES_APPEARANCE">D&eacute;finition des couleurs et du fond de la page</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="Composer:setting_page_propertiesIDX"></a> <a name="Composer:setting_meta_tagsIDX"></a> <a name="DOCUMENT_PROPERTIES_GENERAL"></a>

<h2>D&eacute;finition des propri&eacute;t&eacute;s de la page et des m&eacute;ta-&eacute;tiquettes</h2>

<p>Utilisez la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de la page pour entrer des propri&eacute;t&eacute;s telles que le titre, l'auteur et la description du document en cours. Ces informations sont utiles si vous comptez utiliser la page sur un site Web, dans la mesure o&ugrave; les moteurs de recherche les utilisent pour indexer la page. Vous pouvez afficher ces informations dans la fen&ecirc;tre du navigateur en s&eacute;lectionnant Infos page dans le menu Afficher.</p>

<ol>
<li>Ouvrez le menu Format et s&eacute;lectionnez Titre et propri&eacute;t&eacute;s de la page.</li>

<li>Vous pouvez modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>Titre&nbsp;</b>: Entrez le texte &agrave; afficher comme titre de la fen&ecirc;tre lors de l'affichage de la page dans un navigateur. C'est de cette mani&egrave;re que la plupart des outils de recherche Web localisent les pages, choisissez donc un titre explicite.</li>

<li><b>Auteur&nbsp;</b>: Entrez le nom de la personne qui a cr&eacute;&eacute; le document. Ces informations sont importantes pour permettre aux utilisateurs qui trouvent votre document &agrave; l'aide d'un outil de recherche Web de rechercher votre nom.

<blockquote>
<p><b>Astuce&nbsp;</b>: Si vous entrez le nom de l'auteur dans les <a href= "#PREFERENCES_NEWPAGE">pr&eacute;f&eacute;rences</a> de Composer, vous ne devrez plus l'indiquer &agrave; chaque cr&eacute;ation d'une page.</p>
</blockquote>
</li>

<li><b>Description&nbsp;</b>: Entrez une br&egrave;ve description du contenu du document.</li>
</ul>
</li>
</ol>

<p>[&nbsp;<a href="#page_properties">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Composer:setting_page_colorsIDX"></a> <a name="Composer:setting_page_backgroundIDX"></a> <a name="DOCUMENT_PROPERTIES_APPEARANCE"></a>

<h2>D&eacute;finition des couleurs et du fond de la page</h2>

<p>Vous pouvez modifier la couleur de fond ou sp&eacute;cifier une image d'arri&egrave;re-plan pour la page en cours. Ces options influencent la pr&eacute;sentation du texte et des liens lors de son affichage dans un navigateur.</p>

<p>Pour d&eacute;finir les couleurs et le fond de la page en cours, &agrave; partir de la fen&ecirc;tre Composer&nbsp;:</p>

<ol>
<li>Ouvrez le menu Format et s&eacute;lectionnez Couleurs et fond de page.</li>

<li>Vous pouvez modifier les propri&eacute;t&eacute;s suivantes&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>Couleurs par d&eacute;faut du lecteur&nbsp;</b>: S&eacute;lectionnez cette option pour que la page utilise les param&egrave;tres de couleur du navigateur de l'utilisateur pour le texte et les liens.</li>

<li><b>Couleurs personnalis&eacute;es&nbsp;</b>: S&eacute;lectionnez cette option pour sp&eacute;cifier la couleur du texte et des liens. Pour chaque &eacute;l&eacute;ment, s&eacute;lectionnez une couleur dans la liste d&eacute;roulante. Un exemple pour chaque type de lien s'affiche &agrave; droite.</li>

<li><b>Image d'arri&egrave;re-plan&nbsp;</b>: S&eacute;lectionnez cette option pour utiliser une image d'arri&egrave;re-plan pour la page. Entrez le nom du fichier image ou cliquez sur Choisir le fichier pour localiser le fichier image sur le disque dur ou le r&eacute;seau.

<p><b>Remarque</b>&nbsp;: Les images d'arri&egrave;re-plan sont plac&eacute;es sous forme de mosa&iuml;que et remplacent les options de couleur d'arri&egrave;re-plan.</p>
</li>

<li><b>L'URL est relative &agrave; l'emplacement de la page </b>: Si cette option est s&eacute;lectionn&eacute;e, Composer convertit l'adresse URL de sorte qu'elle soit relative &agrave; l'emplacement de la page. Cela s'av&egrave;re particuli&egrave;rement utile si vous comptez publier vos pages sur un serveur Web pour que d'autres personnes puissent les consulter.

<p>L'utilisation d'adresses URL relatives permet de conserver tous les fichiers li&eacute;s au m&ecirc;me endroit les uns par rapport aux autres, quel que soit leur emplacement sur votre disque dur ou sur un serveur Web.</p>

<p>Lorsque cette case est d&eacute;sactiv&eacute;e, Composer convertit l'adresse URL en une adresse URL compl&egrave;te (absolue). Les adresses URL absolues s'utilisent g&eacute;n&eacute;ralement lors de la liaison &agrave; des images situ&eacute;es sur d'autres serveurs Web (non stock&eacute;es localement sur votre disque dur).</p>

<p>Si des modifications n'ont pas &eacute;t&eacute; enregistr&eacute;es, vous devez enregistrer la page avant de pouvoir cocher cette case.</p>
</li>
</ul>
</li>
</ol>

<p><b>Remarque</b>&nbsp;: Pour appliquer d'autres attributs ou &eacute;v&eacute;nements JavaScript, cliquez sur Edition avanc&eacute;e pour afficher l'<a href= "#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a>.</p>

<p>Vous pouvez &eacute;galement d&eacute;finir les <a href="#PREFERENCES_NEWPAGE">couleurs et le fond de page par d&eacute;faut</a> pour chaque nouvelle page cr&eacute;&eacute;e dans Composer.</p>

<p>[&nbsp;<a href="#page_properties">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Composer:creating_linksIDX"></a>

<hr> <a name="page_link"></a>
<h1>Cr&eacute;ation de liens dans Composer</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#PROPERTIES_TARGET">Cr&eacute;ation de liens internes &agrave; la page</a></p>

<p><a href="#creating_links">Cr&eacute;ation de liens vers d'autres pages</a></p>

<p><a href="#Linking_images">Utilisation d'images comme liens</a></p>

<p><a href="#Linking_remove">Suppression ou interruption de liens</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="PROPERTIES_TARGET"></a>

<h2>Cr&eacute;ation de liens internes &agrave; la page</h2>

<p>Pour cr&eacute;er un lien interne &agrave; la page, utilisable, par exemple, pour passer d'une section &agrave; une autre, vous devez cr&eacute;er un <i>marqueur</i> (emplacement de destination), puis un lien qui pointe vers lui. Ils sont &eacute;galement appel&eacute;s <i>marqueurs nomm&eacute;s</i>.</p>

<ol>
<li>Placez le curseur au d&eacute;but de la ligne dans laquelle cr&eacute;er un marqueur ou s&eacute;lectionnez du texte.</li>

<li>Dans le menu Ins&eacute;rer, choisissez Marqueur nomm&eacute;. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s du marqueur nomm&eacute; s'affiche.</li>

<li>Entrez un nom unique pour le marqueur dans le champ Nom du marqueur (30 caract&egrave;res maximum). Si vous y placez des espaces, ils seront convertis en caract&egrave;res de soulignement (_). Si vous avez s&eacute;lectionn&eacute; du texte &agrave; l'&eacute;tape 1, cette zone contient d&eacute;j&agrave; un nom.</li>

<li>Cliquez sur OK. Une ic&ocirc;ne de marqueur s'affiche dans le document pour marquer son emplacement&nbsp;:  <img src="images/anchor-in-doc.gif" width="20" height="17" alt="" border="0"></li>
</ol>

<p>Pour cr&eacute;er le lien permettant aux utilisateurs de passer au marqueur&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le texte ou l'image &agrave; lier au marqueur.</li>

<li>Cliquez sur le bouton Lien ou ouvrez le menu Ins&eacute;rer et s&eacute;lectionnez Lien. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s du lien s'affiche.</li>

<ul>
<li>Si vous cr&eacute;ez un lien vers un fichier HTML de votre ordinateur, cliquez sur Choisir le fichier pour le localiser.</li>

<li>Si vous cr&eacute;ez un lien vers un marqueur nomm&eacute; (cible), s&eacute;lectionnez-le dans la liste des marqueurs de la page.</li>

<li>Si vous cr&eacute;ez un lien vers un en-t&ecirc;te de niveau (par exemple, En-t&ecirc;te 1 - En-t&ecirc;te 6), s&eacute;lectionnez-le dans la liste des en-t&ecirc;tes de la page.</li>
</ul>
</li>

<li>Cliquez sur OK.</li>
</ol>

<p><b>Remarque</b>&nbsp;: Pour tester le lien cr&eacute;&eacute;, ouvrez le menu Fichier et choisissez Aper&ccedil;u dans le navigateur, puis cliquez sur le lien.</p>

<p><b>Astuce&nbsp;</b>: Si vous n'avez pas encore cr&eacute;&eacute; de marqueurs, vous pouvez utiliser la bo&icirc;te de dialogue de lien pour cr&eacute;er des liens vers les en-t&ecirc;tes de la page.</p>

<p>[&nbsp;<a href="#page_link">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="creating_links"></a>

<h2>Cr&eacute;ation de liens vers d'autres pages</h2>

<p>Vous pouvez cr&eacute;er des liens de votre page vers des pages locales sur votre ordinateur, le r&eacute;seau de votre entreprise ou des pages distantes sur Internet.</p>

<p><strong>Astuce&nbsp;</strong>: Il est pr&eacute;f&eacute;rable de commencer par enregistrer ou publier votre page avant de cr&eacute;er des liens vers d'autres pages. Cela permet &agrave; Composer d'utiliser automatiquement des r&eacute;f&eacute;rences relatives aux liens lorsque vous les cr&eacute;ez.</p>

<a name="PROPERTIES_LINK"></a>

<p>Pour cr&eacute;er un lien vers une autre page&nbsp;:</p>

<ol>
<li>Cliquez pour placer le curseur &agrave; l'endroit o&ugrave; cr&eacute;er le lien ou s&eacute;lectionnez le texte ou l'image &agrave; lier au marqueur.</li>

<li>Cliquez sur le bouton Lien. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s du lien s'affiche.</li>

<li>D&eacute;finissez votre lien :</li>

<ul>
<li><b>Texte du lien&nbsp;</b>: Si vous avez d&eacute;j&agrave; s&eacute;lectionn&eacute; un fichier image ou du texte avant de cliquer sur le bouton Lien, le texte ou fichier s&eacute;lectionn&eacute; y appara&icirc;tra. Dans le cas contraire, vous devez entrer le texte &agrave; utiliser comme lien.</li>

<li><b>Adresse du lien&nbsp;</b>: Entrez le chemin local et le nom du fichier ou l'URL distante de la page &agrave; laquelle vous lier. Si vous n'&ecirc;tes pas certain du chemin ou du nom d'un fichier local, cliquez sur Choisir le fichier pour le rechercher sur votre disque dur ou r&eacute;seau. Pour les URL distants, vous pouvez les copier &agrave; partir de la zone d'adresse du navigateur. Vous pouvez &eacute;galement s&eacute;lectionner un marqueur nomm&eacute; ou un en-t&ecirc;te dans la page en cours avec lequel cr&eacute;er un lien.</li>

<li><b>L'URL est relative &agrave; l'emplacement de la page </b>: Si cette option est s&eacute;lectionn&eacute;e, Composer convertit l'adresse URL de sorte qu'elle soit relative &agrave; l'emplacement de la page. Cela s'av&egrave;re particuli&egrave;rement utile si vous comptez publier vos pages sur un serveur Web pour que d'autres personnes puissent les consulter. L'utilisation d'adresses URL relatives permet de conserver tous les fichiers li&eacute;s au m&ecirc;me endroit les uns par rapport aux autres, quel que soit leur emplacement sur votre disque dur ou sur un serveur Web.

<p>Lorsque cette case est d&eacute;sactiv&eacute;e, Composer convertit l'adresse URL en une adresse URL compl&egrave;te (absolue). Les adresses URL absolues s'utilisent g&eacute;n&eacute;ralement lors de la liaison &agrave; des pages situ&eacute;es sur d'autres serveurs Web (non stock&eacute;es localement sur votre disque dur).</p>

<p>Si des modifications n'ont pas &eacute;t&eacute; enregistr&eacute;es, vous devez enregistrer la page avant de pouvoir cocher cette case.</p>
</li>
</ul>
</li>

<li>Pour appliquer d'autres attributs ou &eacute;v&eacute;nements JavaScript, cliquez sur Edition avanc&eacute;e pour afficher l'<a href="#PROPERTY_EDITOR">Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a>.</li>

<li>Cliquez sur OK.</li>

<li>Pour tester le lien que vous venez de cr&eacute;er, cliquez sur le bouton Choisir, puis sur le lien pour vous assurer qu'il fonctionne comme pr&eacute;vu.</li>
</ol>

<p><b>Astuce&nbsp;</b>: Vous pouvez copier rapidement un lien en cliquant dessus et en le faisant glisser sur votre page &agrave; partir d'une autre fen&ecirc;tre. Par exemple, vous pouvez faire glisser un lien &agrave; partir d'une page Web, d'un signet ou d'une fen&ecirc;tre de courrier &eacute;lectronique et le d&eacute;poser sur votre page. Vous pouvez &eacute;galement cliquer avec le bouton droit (Contr&ocirc;le+cliquer sous Macintosh) sur un lien apparaissant sur une page Web et choisir Copier l'adresse du lien dans le menu. Vous pouvez alors coller l'adresse du lien dans le champ Adresse du lien de la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du lien.</p>

<p>[&nbsp;<a href="#page_link">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Linking_images"></a>

<h2>Utilisation d'images comme liens</h2>

<p>Vous pouvez utiliser des images, notamment aux formats JPEG, GIF ou PNG, comme liens sur vos pages. Lorsque l'utilisateur clique sur une image utilis&eacute;e comme lien, la fen&ecirc;tre du navigateur affiche la page correspondante.</p>

<ol>
<li>S&eacute;lectionnez une image dans votre page.</li>

<li>Cliquez sur le bouton Lien <img src="images/link.gif" width="22" height="20" alt="" border="0"> de la barre d'outils ou ouvrez le menu Ins&eacute;rer et s&eacute;lectionnez Lien.</li>

<li>Utilisez la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du lien pour lier l'image &agrave; un <a href="#PROPERTIES_TARGET">marqueur nomm&eacute; ou en-t&ecirc;te de la page</a> ou &agrave; une <a href="#creating_links">page locale ou distante distincte</a>.</li>
</ol>

<p><b>Astuce&nbsp;</b>: Glissez-d&eacute;placez une image servant de lien de la fen&ecirc;tre Navigator vers une fen&ecirc;tre Composer pour copier l'image et le lien.</p>

<p><b>Remarque</b>&nbsp;: Pour supprimer la bordure bleue des images utilis&eacute;es comme liens, ouvrez la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du lien, cliquez sur l'onglet Lien et d&eacute;s&eacute;lectionnez Afficher une bordure autour de l'image li&eacute;e.</p>

<p>[&nbsp;<a href="#page_link">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Linking_remove"></a>

<h2>Suppression ou interruption de liens</h2>

<p>Pour supprimer un lien&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le texte (g&eacute;n&eacute;ralement bleu et soulign&eacute;) ou l'image du lien.</li>

<li>Ouvrez le menu Format et choisissez Supprimer les liens.</li>
</ol>

<p>Pour interrompre un lien, afin que le texte que vous tapez &agrave; la suite ne soit pas inclus dans le lien&nbsp;:</p>

<ol>
<li>Placez le curseur &agrave; l'endroit o&ugrave; interrompre le lien.</li>

<li>Ouvrez le menu Format et choisissez Annuler les liens.</li>
</ol>

<p>[&nbsp;<a href="#page_link">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="web_pages:publishingIDX"></a> <a name="Composer:publishing_pagesIDX"></a> <a name="publishing_pagesIDX"></a> <a name="uploading_pagesIDX"></a> <a name="uploading_web_pagesSDX"></a>
<hr> <a name="publish_top"></a>
<h1>Publication de vos pages sur le Web</h1>

<p>Si vos pages n'existent que sur votre disque dur local, vous seul pouvez les consulter. Composer vous permet de publier vos pages sur un ordinateur distant appel&eacute; serveur Web.</p>

<p>Lorsque vous publiez vos pages sur un serveur Web, Composer les copie sur un ordinateur o&ugrave; d'autres internautes pourront les visualiser. La plupart des FAI offrent de l'espace pour la publication de pages Web sur leurs serveurs Web. Pour trouver un serveur Web o&ugrave; vous pouvez publier vos pages, interrogez votre FAI, service d'assistance ou administrateur syst&egrave;me.</p>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="370" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#publish_prepare">Publication d'un document</a></p>

<p><a href="#publish_update">Mise &agrave; jour d'un document publi&eacute;</a></p>

<p><a href="#publish_as">Changement de nom de fichier ou d'adresse de publication</a></p>

<p><a href="#site_new">Cr&eacute;ation d'un site de publication</a></p>

<p><a href="#site_default">Changement de site de publication par d&eacute;faut</a></p>

<p><a href="#site_delete">Suppression d'un site de publication</a></p>

<p><a href="#pub_problems">R&eacute;solution de probl&egrave;mes courants li&eacute;s &agrave; la publication</a></p>

<p><a href="#edit_site">Param&egrave;tres de publication</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="publish_prepare"></a>

<h2>Publication d'un document</h2>

<p><strong>Astuce&nbsp;</strong>: Il est pr&eacute;f&eacute;rable de commencer par enregistrer ou publier votre page avant d'y ins&eacute;rer des images ou des liens. Cela permet &agrave; Composer d'utiliser automatiquement des r&eacute;f&eacute;rences relatives pour les liens et images lorsque vous les ins&eacute;rez.</p>

<p>Pour publier un document&nbsp;:</p>

<ol>
<li>Ouvrez le document HTML que vous souhaitez publier ou cr&eacute;ez un document Composer.</li>

<li>Lorsque vous &ecirc;tes pr&ecirc;t &agrave; publier le document &agrave; distance, cliquez sur le bouton Publier.</li>

<p>Si vous avez d&eacute;j&agrave; publi&eacute; ce document pr&eacute;c&eacute;demment, Composer se rappelle les param&egrave;tres de publication du document et commence &agrave; le publier. Pendant la publication, Composer affiche une bo&icirc;te de dialogue d'&eacute;tat de publication.</p>

<ul>
<li>Si vous n'avez jamais publi&eacute; ce document, Composer affiche l'onglet Param&egrave;tres dans la bo&icirc;te de dialogue Publier la page, pour vous permettre de fournir des informations concernant l'adresse de publication distante du document. Pour plus d'informations, voir <a href="#settings_tab">Publier la page - Param&egrave;tres</a>. Lorsque vous avez fini d'introduire ces informations, cliquez sur Publier.</li>

<li>Si vous n'avez jamais enregistr&eacute; le document, Composer affiche l'onglet Publier dans la bo&icirc;te de dialogue Publier la page, qui vous permet d'introduire le nom de fichier du document. Pour plus d'informations, voir <a href="#publish_tab">Publier la page - Publier</a>. Apr&egrave;s avoir entr&eacute; le nom de fichier, cliquez sur Publier.</li>
</ul>
</li>

<li>Pour acc&eacute;der &agrave; la page publi&eacute;e, cliquez sur Choisir. Testez les liens de la page et assurez-vous qu'aucune image ne manque.</li>

<li>Continuez &agrave; modifier la page s'il y a lieu. Lorsque vous &ecirc;tes pr&ecirc;t &agrave; mettre &agrave; jour la page distante avec vos modifications, cliquez sur le bouton Publier.</li>
</ol>

<p>Lorsque vous publiez un document pour la premi&egrave;re fois, Composer remplace l'adresse URL <tt>file:///</tt> du document par une adresse <tt>http://</tt> pour indiquer que vous &ecirc;tes en train de modifier le document publi&eacute;. Si vous souhaitez enregistrer le document localement (sur le disque dur de votre ordinateur), cliquez sur le bouton Enregistrer. Vous serez invit&eacute; &agrave; choisir un nom de fichier et un emplacement sur votre disque dur.</p>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="publish_tips"></a> <a name="web_pages:publishing_tipsIDX"></a> <a name="publishing_pages:tipsIDX"></a>

<h3>Astuces pour &eacute;viter les liens rompus et images manquantes</h3>

<p><br>
</p>

<ul>
<li>Assurez-vous que vos noms de fichiers Composer se terminent par .html ou .htm. Veillez &agrave; ce que vos noms de fichiers image se terminent par .JPG, .GIF ou .PNG. N'utilisez pas d'espaces ni d'autres symboles sp&eacute;ciaux dans vos noms de fichiers. Utilisez des noms de fichiers courts, compos&eacute;s uniquement de lettres majuscules et minuscules et de nombres.</li>

<li>Si vos images apparaissent sous la forme de liens rompus lorsque vous acc&eacute;dez &agrave; un document sur le serveur Web, il se peut que vous ayez oubli&eacute; d'inclure les images lors de la publication. Dans le menu Fichier, choisissez Publier sous pour afficher la bo&icirc;te de dialogue Publier la page. Dans l'onglet Publier, assurez-vous que l'option "Inclure les images et les autres fichiers" est coch&eacute;e, puis cliquez sur Publier.</li>
</ul>

<p>Pour d'autres astuces de d&eacute;pannage, voir  <a href= "#pub_problems">R&eacute;solution de probl&egrave;mes courants li&eacute;s &agrave; la publication</a>.</p>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="publish_update"></a> <a name="web_pages:updatingIDX"></a>

<h2>Mise &agrave; jour d'un document publi&eacute;</h2>

<p>Pour mettre &agrave; jour un document publi&eacute;&nbsp;:</p>

<ol>
<li>Dans une fen&ecirc;tre Composer, ouvrez le menu Fichier et choisissez Pages r&eacute;centes, puis s&eacute;lectionnez le document dans la liste.</li>

<p>Ou bien, acc&eacute;dez &agrave; l'adresse du document &agrave; mettre &agrave; jour en entrant son adresse HTTP (adresse Web) dans le champ d'adresse de Navigator.</p>
</li>

<li>Dans le menu Fichier, choisissez Modifier la page.</li>

<li>Modifiez le document au besoin.</li>

<li>Lorsque vous &ecirc;tes pr&ecirc;t &agrave; mettre &agrave; jour la page distante avec vos modifications, cliquez sur Publier dans la barre d'outils de Composer.</li>
</ol>

<a name="ftp_and_publishingSDX"></a> <a name="delete_published_pagesSDX"></a> <a name="web_pages:ftpIDX"></a>

<p><strong>Astuce&nbsp;</strong>: Pour supprimer une page ou une image que vous avez publi&eacute;e sur un serveur Web, vous devez utiliser un programme FTP (File Transfer Protocol). Vous devez &eacute;galement utiliser ce type de programme pour cr&eacute;er des sous-r&eacute;pertoires ou renommer des fichiers sur le serveur Web. Demandez &agrave; votre fournisseur d'acc&egrave;s s'il recommande un programme FTP en particulier. Vous trouverez g&eacute;n&eacute;ralement des informations sur les programmes FTP dans les sections d'aide ou d'assistance du site Web de votre FAI. Des programmes FTP sont &eacute;galement disponibles sur des sites de sharewares tels que ZDNet Downloads.</p>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="publish_as"></a>

<h2>Changement de nom de fichier ou d'adresse de publication</h2>

<p>Pour modifier le nom de fichier ou l'adresse de publication d'un document :</p>

<ol>
<li>Dans une fen&ecirc;tre Composer, ouvrez le menu Fichier et choisissez Pages r&eacute;centes, puis s&eacute;lectionnez le document dans la liste.</li>

<p>Ou bien, acc&eacute;dez &agrave; l'adresse du document &agrave; mettre &agrave; jour en entrant son adresse HTTP (adresse Web) dans le champ d'adresse de Navigator.</p>
</li>

<li>Dans le menu Fichier, choisissez Modifier la page.</li>

<li>Modifiez le document au besoin.</li>

<li>Dans le menu Fichier de Composer, choisissez Publier sous. Composer affiche l'onglet Publier dans la bo&icirc;te de dialogue Publier la page.</li>

<li>Entrez un autre titre de page si vous le souhaitez.</li>

<li>Entrez &eacute;ventuellement un autre nom de fichier pour la page.</li>

<li>Dans la liste Nom du site, choisissez l'adresse de publication &agrave; utiliser. Pour configurer une nouvelle adresse de publication, cliquez sur Nouveau site. Pour plus d'informations, voir <a href="#settings_tab">Publier la page - Param&egrave;tres</a>.</li>

<li>Cliquez sur Publier pour enregistrer le document &agrave; la nouvelle adresse.</li>
</ol>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="site_new"></a>

<h2>Cr&eacute;ation d'un site de publication</h2>

<p>Si vous pr&eacute;voyez de publier des documents &agrave; plusieurs adresses distantes, vous pouvez configurer Composer pour qu'il enregistre les informations de publication correspondant &agrave; chaque site distant que vous utilisez, de mani&egrave;re &agrave; ne pas devoir les entrer chaque fois que vous souhaitez publier vos documents.</p>

<p>Pour cr&eacute;er un site de publication, &agrave; partir d'une fen&ecirc;tre Composer&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Param&egrave;tres du site de publication. Composer affiche la bo&icirc;te de dialogue Param&egrave;tres de publication.</li>

<li>Cliquez sur Nouveau site.</li>

<li>Dans la zone "Nom du site", entrez le pseudonyme par lequel vous souhaitez d&eacute;signer ce site de publication.

<p>Par exemple, si le nouveau site doit servir &agrave; publier des documents relatifs au projet "M&eacute;t&eacute;ore", vous pouvez appeler le site "M&eacute;t&eacute;ore". Le nom d'un site doit rappeler les types de documents que vous y publiez.</p>
</li>

<li>Dans la zone "Adresse de publication", entrez l'adresse URL compl&egrave;te fournie par votre FAI, administrateur syst&egrave;me ou service d'h&eacute;bergement Web. Cette adresse doit commencer par <tt>ftp://</tt> ou <tt>http://</tt>.

<p>L'adresse de publication sp&eacute;cifie l'emplacement o&ugrave; sont publi&eacute;s les documents sur ce site. Si vous ne savez pas quelle adresse indiquer, contactez votre FAI ou votre administrateur syst&egrave;me.</p>
</li>

<li>Sous "Adresse HTTP de votre page d'accueil", entrez l'adresse URL compl&egrave;te &agrave; introduire dans Navigator pour visualiser les pages de ce site. Cette adresse ne doit pas inclure de nom de fichier ni de sous-r&eacute;pertoire.


<p>Elle doit toujours commencer par <tt>http://</tt>. Dans certains cas, cette adresse est la m&ecirc;me que l'adresse de publication. Si vous ne savez pas quelle adresse indiquer, contactez votre FAI ou votre administrateur syst&egrave;me ou laissez le champ vide.</p>
</li>

<li>Comme nom d'utilisateur, entrez le nom d'utilisateur que vous employez pour vous connecter &agrave; votre FAI ou service d'h&eacute;bergement Web.</li>

<li>Comme mot de passe, entrez le mot de passe correspondant &agrave; votre nom d'utilisateur.</li>

<li>S&eacute;lectionnez "Enregistrer le mot de passe" pour enregistrer votre mot de passe de mani&egrave;re s&eacute;curis&eacute;e avec le Gestionnaire de mots de passe et vous &eacute;viter de devoir le retaper chaque fois que vous publiez des pages sur ce site.</li>

<li>Cliquez sur OK.</li>
</ol>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="site_default"></a>

<h2>Choix du site de publication par d&eacute;faut</h2>

<p>Si vous avez configur&eacute; plusieurs sites de publication, mais n'en utilisez g&eacute;n&eacute;ralement qu'un seul pour la plupart de vos besoins de publication, vous pouvez d&eacute;signer le site que vous utilisez le plus souvent comme site de publication par d&eacute;faut. Composer utilisera ce site par d&eacute;faut pour tous les documents que vous publiez, sauf si vous en choisissez sp&eacute;cifiquement un autre.</p>

<p>Quel que soit le nombre de sites configur&eacute;s, vous pouvez toujours publier un document sur un autre site en choisissant Publier sous dans le menu Fichier de Composer. Voir <a href="#publish_as">Changement de nom de fichier ou d'adresse de publication</a> pour plus d'informations.</p>

<p>Pour choisir le site de publication par d&eacute;faut, &agrave; partir d'une fen&ecirc;tre Composer&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Param&egrave;tres du site de publication. Composer affiche la bo&icirc;te de dialogue Param&egrave;tres de publication.</li>

<li>S&eacute;lectionnez un site de publication dans la liste.

<p>Si vous n'avez configur&eacute; qu'un seul site de publication, Composer l'utilise comme site par d&eacute;faut.</p>
</li>

<li>Cliquez sur D&eacute;finir par d&eacute;faut.</li>

<li>Cliquez sur OK pour confirmer vos modifications.</li>
</ol>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="site_delete"></a>

<h2>Suppression d'un site de publication</h2>

<p>La suppression d'un site de publication supprime les param&egrave;tres correspondants de Composer. Si, plus tard, vous souhaitez de nouveau publier sur ce site, vous devrez en r&eacute;introduire les param&egrave;tres.</p>

<p>Pour supprimer les param&egrave;tres d'un site de publication, &agrave; partir d'une fen&ecirc;tre Composer&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Param&egrave;tres du site de publication. Composer affiche la bo&icirc;te de dialogue Param&egrave;tres de publication.</li>

<li>S&eacute;lectionnez un site de publication dans la liste.</li>

<li>Cliquez sur Supprimer le site.</li>

<p>Composer supprime uniquement les param&egrave;tres du site ; le site distant proprement dit n'est pas affect&eacute;.</p>
</li>

<li>Cliquez sur OK pour confirmer vos modifications.</li>
</ol>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="pub_problems"></a>

<h2>R&eacute;solution de probl&egrave;mes courants li&eacute;s &agrave; la publication</h2>

<p>Si la publication d'un ou plusieurs de vos fichiers &eacute;choue, la bo&icirc;te de dialogue Etat de publication affiche un message d'erreur qui peut vous aider &agrave; d&eacute;terminer ce qui s'est pass&eacute; et comment corriger l'erreur. Cliquez sur le bouton D&eacute;pannage dans la bo&icirc;te de dialogue Etat de publication pour obtenir de l'aide pour la r&eacute;solution de votre probl&egrave;me de publication.</p>

<p>Si vous ne parvenez toujours pas &agrave; publier un fichier, enregistrez le fichier sur votre disque dur en ouvrant le menu Fichier de Composer, puis en choisissant Enregistrer. Vous pourrez alors rouvrir le fichier plus tard pour essayer de le publier. Pour ensuite localiser rapidement le fichier, ouvrez le menu Fichier de Composer et choisissez Pages r&eacute;centes.</p>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#general_tips">V&eacute;rification de vos param&egrave;tres de publication</a></p>

<p><a href="#file_tips">V&eacute;rification de vos noms de fichiers</a></p>

<p><a href="#pub_errors">Correction d'erreurs de publication</a></p>
</td>
</tr>
</table>

<hr>
<p>&nbsp;</p>

<a name="general_tips"></a>

<h3>V&eacute;rification de vos param&egrave;tres de publication</h3>

<p>Pour v&eacute;rifier vos param&egrave;tres de publication :</p>

<ol>
<li>Le cas &eacute;ch&eacute;ant, fermez la bo&icirc;te de dialogue Etat de publication.</li>

<li>Dans le menu Edition, choisissez Param&egrave;tres du site de publication.</li>

<li>Dans la bo&icirc;te de dialogue Param&egrave;tres de publication, v&eacute;rifiez que les param&egrave;tres du site sur lequel vous tentez de publier sont corrects. En cas de doute, consultez votre FAI ou service d'h&eacute;bergement Web.</li>

<li style="list-style: none">
<ul>
<li><strong>V&eacute;rifiez que vous avez correctement introduit les param&egrave;tres de publication.</strong> Vous avez peut-&ecirc;tre mal tap&eacute; un des param&egrave;tres.</li>

<li><strong>V&eacute;rifiez que vous avez introduit l'adresse de publication correcte.</strong> Les services d'h&eacute;bergement Web ou FAI peuvent d&eacute;signer l'adresse de publication par les termes "nom de serveur", "nom d'h&ocirc;te" ou "serveur/h&ocirc;te". Souvent, ils sp&eacute;cifient l'adresse de publication sous la forme <tt>ftp.monfai.com/utilisateur</tt>, o&ugrave; <tt>utilisateur</tt> est votre nom d'utilisateur.

<p>Pour que l'adresse de publication soit correcte, vous devez la faire pr&eacute;c&eacute;der de <tt>ftp://</tt> ou <tt>http://</tt>. Par exemple, l'adresse de publication correcte pour le site susmentionn&eacute; serait <tt>ftp://ftp.monfai.com/utilisateur</tt>.</p>
</li>
</ul>
</li>
</ol>

<p><br>
</p>

<a name="file_tips"></a>

<h3>V&eacute;rification de vos noms de fichiers</h3>

<p>Examinez le nom des fichiers dont la publication a &eacute;chou&eacute;. V&eacute;rifiez les points suivants :</p>

<ul>
<li>Les noms de fichiers ne peuvent utiliser que des chiffres ou des lettres minuscules ou majuscules. S'il est admis de cr&eacute;er des noms de fichiers utilisant des majuscules, vous &eacute;viterez des erreurs potentielles dans la localisation du fichier publi&eacute; en n'utilisant que des minuscules dans les noms de fichiers.

<p>Lorsque vous publiez des fichiers sur un serveur Web, une distinction est faite entre les majuscules et les minuscules dans les noms de fichiers y r&eacute;sidant. Il peut &ecirc;tre plus difficile de se rappeler les noms qui utilisent des majuscules uniquement ou en combinaison avec des minuscules.</p>

<p>Par exemple, lorsque vous tentez de localiser un fichier publi&eacute; en tapant son adresse Web dans le champ d'adresse de Navigator, vous devez entrer le nom de fichier exactement tel que vous l'avez cr&eacute;&eacute;, avec la m&ecirc;me combinaison de majuscules et de minuscules.</p>
</li>

<li>N'utilisez pas de caract&egrave;res de ponctuation ni d'espaces. Les traits de soulignement ( _ ) et tirets ( - ) sont admis.</li>

<li>Le nom de fichier doit se terminer par .html ou .htm (pour Composer).</li>

<li>Un nom de fichier est limit&eacute; &agrave; 32 caract&egrave;res.</li>
</ul>

<p><br>
</p>

<a name="pub_errors"></a>

<h3>Correction d'erreurs de publication</h3>

<p>Si la publication d'un ou plusieurs de vos fichiers &eacute;choue, consultez les messages que Composer affiche dans la zone Etat de publication de la bo&icirc;te de dialogue Publication. Vous pouvez utiliser ces messages d'erreur pour d&eacute;terminer ce qui s'est pass&eacute; et la fa&ccedil;on de corriger le probl&egrave;me.</p>

<p><br>
</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors">
<p>Messages d'erreur :</p>

<p><a href="#file_not_found"><tt><em>Nom de fichier</em> introuvable</tt></a></p>

<p><a href="#file_not_found"><tt><em>X</em> fichiers sur <em>Y</em> n'ont pas pu &ecirc;tre publi&eacute;s</tt></a></p>

<p><a href="#subdir_not_found"><tt>Le sous-r&eacute;pertoire <em>nom de r&eacute;pertoire</em> n'existe pas sur ce site ou le nom de fichier <em>nom de fichier</em> est d&eacute;j&agrave; utilis&eacute; par un autre sous-r&eacute;pertoire</tt></a></p>

<p><a href="#subdir_not_found"><tt>Le nom <em>nom de fichier</em> est d&eacute;j&agrave; utilis&eacute; par un autre sous-r&eacute;pertoire</tt></a></p>

<p><a href="#server_not_found"><tt>Le serveur n'est pas disponible. V&eacute;rifiez votre connexion et r&eacute;essayez plus tard..</tt></a></p>

<p><a href="#no_permission"><tt>Vous n'&ecirc;tes pas autoris&eacute; &agrave; publier &agrave; cette adresse.</tt></a></p>

<p><a href="#offline_error"><tt>Vous &ecirc;tes actuellement hors ligne. Cliquez sur l'ic&ocirc;ne proche de l'angle inf&eacute;rieur droit d'une fen&ecirc;tre pour passer en ligne.</tt></a></p>

<p><a href="#no_disk_space"><tt>L'espace disque est insuffisant pour enregistrer le fichier <em>nom de fichier</em>.</tt></a></p>

<p><a href="#name_too_long"><tt>Le nom du fichier ou du sous-r&eacute;pertoire est trop long.</tt></a></p>
</td>
</tr>
</table>

<hr>
<p><strong>Message d'erreur :</strong></p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors"><a name="file_not_found"></a> <tt><em>Nom de fichier</em> introuvable</tt>

<p>ou</p>

<tt><em>X</em> fichiers sur <em>Y</em> n'ont pas pu &ecirc;tre publi&eacute;s</tt></td>
</tr>
</table>

<p><strong>Description&nbsp;de l'erreur :</strong> Un ou plusieurs fichiers image ou CSS n'ont pas &eacute;t&eacute; publi&eacute;s parce que Composer ne les trouvait pas. Voici certaines raisons courantes :</p>

<ul>
<li>L'emplacement de fichier introduit est incorrect.</li>

<li>L'emplacement du fichier sur le Web n'est pas accessible.</li>

<li>L'emplacement du fichier a &eacute;t&eacute; modifi&eacute; ou le fichier a &eacute;t&eacute; supprim&eacute; ou d&eacute;plac&eacute;.</li>
</ul>

<p><strong>Solutions possibles :</strong></p>

<ul>
<li>Cherchez d'&eacute;ventuelles images rompues dans la page que vous tentez de publier. Ces images sont remplac&eacute;es par l'ic&ocirc;ne  <img src= "images/broken.gif" width="20" height="20" alt="" border="0"> dans la page. Pour corriger l'adresse de l'image, double-cliquez sur l'image rompue pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de l'image o&ugrave; vous pourrez introduire l'adresse correcte.</li>

<li>Supprimez l'image rompue de la page en la s&eacute;lectionnant (cliquez une fois sur l'image), puis en appuyant sur la touche Retour arri&egrave;re ou Suppression (Suppr) de votre clavier.</li>

<li>Si l'image n'est pas disponible parce que le serveur o&ugrave; elle r&eacute;side est inaccessible, essayez de publier la page plus tard.</li>

<li>Si le fichier manquant est un fichier CSS, vous devez d'abord v&eacute;rifier son emplacement correct. Pour corriger l'adresse du fichier dans Composer, cliquez sur l'onglet HTML source et modifiez l'emplacement du fichier dans le code source HTML. Ne modifiez la source HTML que si vous &ecirc;tes familiaris&eacute; avec les &eacute;tiquettes HTML.</li>
</ul>

<hr>
<p><strong>Message d'erreur :</strong></p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors"><a name="subdir_not_found"></a> <tt>Le sous-r&eacute;pertoire <em>nom de r&eacute;pertoire</em> n'existe pas sur ce site ou le nom de fichier <em>nom de fichier</em> est d&eacute;j&agrave; utilis&eacute; par un autre sous-r&eacute;pertoire</tt>

<p>ou</p>

<tt>Le nom <em>nom de fichier</em> est d&eacute;j&agrave; utilis&eacute; par un autre sous-r&eacute;pertoire</tt></td>
</tr>
</table>

<p><strong>Description&nbsp;de l'erreur :</strong> Vous avez sp&eacute;cifi&eacute; le nom d'un sous-r&eacute;pertoire distant qui n'existe pas sur le site de publication. Composer ne peut publier que dans un sous-r&eacute;pertoire distant qui existe d&eacute;j&agrave; &agrave; l'adresse de publication. Ou bien, vous avez sp&eacute;cifi&eacute; un nom de fichier identique celui d'un sous-r&eacute;pertoire existant sur le site de publication.</p>

<p>Par exemple, dans la bo&icirc;te de dialogue Publier la page, onglet Publier :</p>

<ul>
<li>sous "Sous-r&eacute;pertoire du site pour cette page", vous avez peut-&ecirc;tre tap&eacute; le nom d'un sous-r&eacute;pertoire qui n'existe pas &agrave; l'adresse de publication.</li>

<li>vous avez coch&eacute; "Inclure les images et les autres fichiers", puis tap&eacute; le nom d'un sous-r&eacute;pertoire qui n'existe pas &agrave; l'adresse de publication.</li>

<li>un des fichiers que vous tentez de publier a le m&ecirc;me nom qu'un sous-r&eacute;pertoire du site de publication.</li>
</ul>

<p><strong>Solutions possibles :</strong></p>

<ul>
<li>Utilisez un programme FTP s&eacute;par&eacute; si vous souhaitez cr&eacute;er, renommer ou supprimer des sous-r&eacute;pertoires sur le site de publication. Demandez &agrave; votre fournisseur d'acc&egrave;s s'il recommande un programme FTP en particulier. Vous trouverez g&eacute;n&eacute;ralement des informations sur les programmes FTP dans les sections d'aide ou d'assistance du site Web de votre FAI. Des programmes FTP sont &eacute;galement disponibles sur des sites de sharewares tels que ZDNet Downloads.</li>

<li>N'utilisez pas de noms de sous-r&eacute;pertoire se terminant par ".html" ou ".htm". Seuls les noms de fichiers Composer peuvent se terminer par ".html" ou ".htm".</li>

<li>Les noms des sous-r&eacute;pertoires sont sensibles aux minuscules et aux majuscules&nbsp;; veillez &agrave; entrer un nom de sous-r&eacute;pertoire exactement tel qu'il appara&icirc;t &agrave; l'adresse de publication.</li>
</ul>

<hr>
<p><strong>Message d'erreur :</strong></p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors"><a name="server_not_found"></a> <tt>Le serveur n'est pas disponible. V&eacute;rifiez votre connexion et r&eacute;essayez plus tard..</tt></td>
</tr>
</table>

<p><strong>Description&nbsp;de l'erreur :</strong> Cette erreur peut avoir de nombreuses causes. Par exemple :</p>

<ul>
<li>Les param&egrave;tres de votre site de publication ne sont pas peut-&ecirc;tre pas corrects.</li>

<li>Votre connexion Internet a peut-&ecirc;tre &eacute;t&eacute; perdue.</li>

<li>Votre modem ou l'&eacute;quipement que vous utilisez pour vous connecter &agrave; Internet ne fonctionne peut-&ecirc;tre pas correctement.</li>

<li>Le serveur Web sur lequel vous tentez de publier est peut-&ecirc;tre indisponible en raison d'un probl&egrave;me technique ou d'une circonstance inconnue.</li>

<li>Votre FAI ou service d'h&eacute;bergement Web conna&icirc;t peut-&ecirc;tre des probl&egrave;mes techniques.</li>
</ul>

<p><strong>Solutions possibles :</strong></p>

<ul>
<li>V&eacute;rifiez que vos param&egrave;tres de publication sont corrects et que vous les avez introduits correctement. Pour plus d'informations, voir <a href="#general_tips">V&eacute;rification de vos param&egrave;tres de publication</a>.</li>

<li>Assurez-vous votre connexion Internet fonctionne en tentant de visualiser une page Web avec Navigator. Par exemple, v&eacute;rifiez que vous pouvez afficher la page <tt>http://home.netscape.com</tt>.</li>

<li>Si votre connexion Internet ne fonctionne pas, v&eacute;rifiez que tout le mat&eacute;riel, les connexions t&eacute;l&eacute;phoniques, les modems et les connexions r&eacute;seau fonctionnent correctement.</li>

<li>Utilisez Navigator pour tenter d'afficher une page sur le site Web o&ugrave; vous tentez la publication. Si vous parvenez &agrave; afficher d'autres sites Web mais ne pouvez afficher une page au site de publication, votre FAI ou service d'h&eacute;bergement Web conna&icirc;t peut-&ecirc;tre des probl&egrave;mes techniques.</li>

<li>R&eacute;essayez la publication plus tard. Votre FAI, service d'h&eacute;bergement Web ou le serveur Web conna&icirc;t peut-&ecirc;tre des difficult&eacute;s techniques temporaires.</li>
</ul>

<hr>
<p><strong>Message d'erreur :</strong></p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors"><a name="no_permission"></a> <tt>Vous n'&ecirc;tes pas autoris&eacute; &agrave; publier &agrave; cette adresse.</tt></td>
</tr>
</table>

<p><strong>Description&nbsp;de l'erreur :</strong> Vous tentez de publier sur un emplacement que vous n'&ecirc;tes pas autoris&eacute; &agrave; utiliser. Vous ne pouvez publier que sur des sites auxquels votre FAI ou service d'h&eacute;bergement Web vous a donn&eacute; acc&egrave;s.</p>

<p><strong>Solutions possibles :</strong></p>

<ul>
<li>V&eacute;rifiez que vous avez introduit le nom d'utilisateur et le mot de passe corrects dans la bo&icirc;te de dialogue Param&egrave;tres du site de publication ou dans l'onglet Publier de la bo&icirc;te de dialogue de publication.</li>

<li>Contactez votre FAI pour savoir o&ugrave; vous pouvez publier vos pages.</li>

<li>Trouvez un service d'h&eacute;bergement Web que vous pouvez utiliser pour publier vos pages. Dans Navigator, cherchez "Web hosting".</li>

<li>Utilisez Netscape My Webpage  <a href= "http://mywebpage.netscape.com/" target= "_blank"><tt>http://mywebpage.netscape.com/</tt></a> pour h&eacute;berger gratuitement vos pages Web (jusqu'&agrave; 20 m&eacute;ga-octets).</li>
</ul>

<hr>
<p><strong>Message d'erreur :</strong></p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors"><a name="offline_error"></a> <tt>Vous &ecirc;tes actuellement hors ligne. Cliquez sur l'ic&ocirc;ne proche de l'angle inf&eacute;rieur droit d'une fen&ecirc;tre pour passer en ligne.</tt></td>
</tr>
</table>

<p><strong>Description&nbsp;de l'erreur :</strong> Vous tentez de publier, mais votre connexion Internet Netscape est actuellement en &eacute;tat "hors ligne". Elle doit &ecirc;tre en &eacute;tat "en ligne" (connect&eacute;e &agrave; Internet) pour que vous puissiez publier vos pages.</p>

<p>V&eacute;rifiez que votre connexion Internet est actuellement hors ligne en examinant l'ic&ocirc;ne en ligne/hors ligne dans l'angle inf&eacute;rieur droit d'un fen&ecirc;tre Netscape. Si vous &ecirc;tes actuellement hors ligne, l'ic&ocirc;ne <img src="images/offline.gif"> appara&icirc;t.</p>

<p><strong>Solutions possibles :</strong></p>

<ul>
<li>Cliquez sur l'ic&ocirc;ne en ligne/hors ligne pour passer en ligne. Dans l'&eacute;tat en ligne, l'ic&ocirc;ne doit &ecirc;tre :  <img src= "images/online.gif">.</li>

<li>Assurez-vous que votre connexion Internet fonctionne en tentant de visualiser une page Web avec Navigator. Par exemple, v&eacute;rifiez que vous pouvez afficher la page <tt>http://home.netscape.com</tt>.</li>
</ul>

<hr>
<p><strong>Message d'erreur :</strong></p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors"><a name="no_disk_space"></a> <tt>L'espace disque est insuffisant pour enregistrer le fichier <em>nom de fichier</em>.</tt></td>
</tr>
</table>

<p><strong>Description&nbsp;de l'erreur :</strong> Le disque dur du serveur Web distant est satur&eacute; ou vous avez peut-&ecirc;tre d&eacute;pass&eacute; l'espace disque que vous a allou&eacute; votre FAI ou service d'h&eacute;bergement Web.</p>

<p><strong>Solutions possibles :</strong></p>

<ul>
<li>Utilisez un programme FTP s&eacute;par&eacute; pour supprimer les fichiers inutiles sur votre site de publication. Demandez &agrave; votre fournisseur d'acc&egrave;s s'il recommande un programme FTP en particulier. Vous trouverez g&eacute;n&eacute;ralement des informations sur les programmes FTP dans les sections d'aide ou d'assistance du site Web de votre FAI. Des programmes FTP sont &eacute;galement disponibles sur des sites de sharewares tels que ZDNet Downloads.</li>

<li>Consultez votre FAI ou votre service d'h&eacute;bergement Web pour savoir comment augmenter l'espace disque allou&eacute;, ou optez pour un autre service pouvant satisfaire vos besoins.</li>

<li>Si le serveur Web est situ&eacute; dans votre entreprise ou votre &eacute;cole, contactez l'administrateur r&eacute;seau pour savoir si vous pouvez publier &agrave; un autre endroit disposant d'un plus grand espace disque, ou si vous pouvez demander qu'un espace disque suppl&eacute;mentaire soit allou&eacute; &agrave; votre adresse de publication actuelle.</li>
</ul>

<hr>
<p><strong>Message d'erreur :</strong></p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#EBEBEB">
<tr>
<td class="errors"><a name="name_too_long"></a> <tt>Le nom du fichier ou du sous-r&eacute;pertoire est trop long.</tt></td>
</tr>
</table>

<p><strong>Description&nbsp;de l'erreur :</strong> Le serveur Web o&ugrave; vous tentez de publier n'admet pas des noms de fichiers ou de sous-r&eacute;pertoires aussi longs.</p>

<p><strong>Solutions possibles :</strong></p>

<ul>
<li>Limitez la longueur de vos noms de fichiers et de sous-r&eacute;pertoires &agrave; moins de 32 caract&egrave;res. Certains syst&egrave;mes d'exploitation n'admettent pas les noms de plus de 32 caract&egrave;res.</li>
</ul>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<hr>
<p>&nbsp;</p>

<a name="publishing_pages:settingsIDX"></a> <a name="edit_site"></a>

<h2>Param&egrave;tres de publication</h2>

<p>Cette section d&eacute;crit les param&egrave;tres de publication de Composer. Pour des informations sur les param&egrave;tres g&eacute;n&eacute;raux et de nouvelle page de Composer, voir  <a href="#Set_Comp_prefs">Pr&eacute;f&eacute;rences de Composer</a>.</p>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#publish_tab">Publier la page - Publier</a></p>

<p><a href="#settings_tab">Publier la page - Param&egrave;tres</a></p>

<p><a href="#site_settings">Param&egrave;tres de publication</a></p>
</td>
</tr>
</table>

<hr>
<p>&nbsp;</p>

<a name="site_subdirectorySDX"></a> <a name="publish_tab"></a>

<h3>Publier la page - Publier</h3>

<p>L'onglet Publier la page - Publier permet de sp&eacute;cifier o&ugrave; vous souhaitez publier un document. Ces param&egrave;tres s'appliquent au document en cours.</p>

<p>Si l'onglet Publier la page - Publier n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Fichier, choisissez Publier sous. La bo&icirc;te de dialogue Publier la page s'affiche.</li>

<li>Cliquez sur l'onglet Publier.</li>
</ol>

<ul>
<li><b>Nom du site :</b> Enum&egrave;re tous les sites de publication que vous avez cr&eacute;&eacute;s, pour vous permettre de choisir le site o&ugrave; vous souhaitez publier. Pour cr&eacute;er un site, cliquez sur Nouveau site.</li>

<li><b>Titre de la page&nbsp;:</b> Sp&eacute;cifie le titre de page du document tel qu'il appara&icirc;t dans la barre de titre de la fen&ecirc;tre du navigateur lorsque vous l'y affichez. Le titre de la page appara&icirc;t &eacute;galement dans votre liste de signets, le cas &eacute;ch&eacute;ant.</li>

<li><b>Nom de fichier :</b> Sp&eacute;cifie le nom de fichier du document. Veillez &agrave; inclure l'extension .html ou .htm dans le nom du fichier.</li>

<li style="list-style: none">
<p><strong>Avertissement</strong> : Si le site distant o&ugrave; vous publiez contient un fichier de m&ecirc;me nom que celui que vous t&eacute;l&eacute;chargez, ce dernier remplacera le fichier existant. Cet &eacute;crasement se fait sans demande de confirmation.</p>
</li>

<li><b>Sous-r&eacute;pertoire du site pour cette page :</b> Si vous laissez ce champ vide, Composer publie la page dans le r&eacute;pertoire de publication principal (root) du site. Si vous souhaitez publier la page dans un sous-r&eacute;pertoire distant du r&eacute;pertoire de publication principal du site, entrez le nom du sous-r&eacute;pertoire ou choisissez-le dans la liste. Composer m&eacute;morise les emplacements que vous tapez ici, pour vous permettre de s&eacute;lectionner un site parmi une liste des emplacements distants que vous avez utilis&eacute;s pr&eacute;c&eacute;demment. N'oubliez pas que les noms de sous-r&eacute;pertoires sont sensibles aux minuscules et majuscules.</li>

<li style="list-style: none">
<p><strong>Remarque&nbsp;:</strong> Le sous-r&eacute;pertoire que vous choisissez doit exister sur le serveur distant.</p>
</li>

<li><strong>Inclure les images et les autres fichiers</strong>: Si cette option est coch&eacute;e, Composer publie les images et autres fichiers r&eacute;f&eacute;renc&eacute;s sur cette page. Vous pouvez choisir de publier ces fichiers &agrave; la m&ecirc;me adresse que la page ou dans un sous-r&eacute;pertoire distant du r&eacute;pertoire de publication principal.</li>
</ul>

<p><strong>Astuce&nbsp;</strong>: Pour cr&eacute;er des sous-r&eacute;pertoires distants ou supprimer des pages ou images publi&eacute;es, vous devez utiliser un programme FTP (File Transfer Protocol). Demandez &agrave; votre fournisseur d'acc&egrave;s s'il recommande un programme FTP en particulier. Vous trouverez g&eacute;n&eacute;ralement des informations sur les programmes FTP dans les sections d'aide ou d'assistance du site Web de votre FAI. Des programmes FTP sont &eacute;galement disponibles sur des sites de sharewares tels que ZDNet Downloads.</p>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="publishing_URLSDX"></a> <a name="HTTP_addressSDX"></a> <a name="settings_tab"></a>
<h3>Publier la page - Param&egrave;tres</h3>

<p>L'onglet Publier la page - Param&egrave;tres permet de sp&eacute;cifier les informations de connexion au site de publication distant, ainsi que les param&egrave;tres de publication de ce site. Ces param&egrave;tres s'appliquent au document courant ainsi qu'&agrave; tout autre fichier que vous publiez &agrave; cet emplacement.</p>

<p>Si l'onglet Publier la page - Param&egrave;tres n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Fichier, choisissez Publier sous. La bo&icirc;te de dialogue Publier la page s'affiche.</li>

<li>Cliquez sur l'onglet Param&egrave;tres.</li>
</ol>

<ul>
<li><b>Nom du site</b> : Sp&eacute;cifie le pseudonyme que vous souhaitez utiliser pour ce site de publication. Entrez un nom court qui vous aidera &agrave; identifier ce site de publication.</li>

<a name="host_name_for_publishingSDX"></a>
<li><b>Adresse de publication&nbsp;</b>: Sp&eacute;cifie l'adresse URL compl&egrave;te que vous a communiqu&eacute;e votre FAI ou administrateur syst&egrave;me. Cette adresse doit commencer par <tt>ftp://</tt> ou <tt>http://</tt>. Ce nom est souvent appel&eacute; "nom d'h&ocirc;te" ou "nom de serveur h&ocirc;te".</li>

<li style="list-style: none">
<p>L'adresse de publication sp&eacute;cifie l'emplacement o&ugrave; sont publi&eacute;s les documents sur ce site. Si vous ne savez pas quelle adresse indiquer, contactez votre FAI ou votre administrateur syst&egrave;me.</p>
</li>

<li><b>Adresse HTTP de votre page d'accueil&nbsp;</b>: Sp&eacute;cifie l'adresse compl&egrave;te de votre r&eacute;pertoire de publication principal. C'est l'adresse Web de la page d'accueil de votre site. Cette adresse ne doit pas inclure de nom de fichier ni de sous-r&eacute;pertoire.</li>

<li style="list-style: none">
<p>Elle doit toujours commencer par <tt>http://</tt>. Dans certains cas, cette adresse est la m&ecirc;me que l'adresse de publication. Si vous ne savez pas quelle adresse indiquer, contactez votre FAI ou votre administrateur syst&egrave;me ou laissez le champ vide.</p>
</li>

<li><b>Nom d'utilisateur</b> : Sp&eacute;cifie le nom d'utilisateur que vous utilisez pour vous connecter au FAI ou au r&eacute;seau.</li>

<li><b>Mot de passe</b>&nbsp;: Sp&eacute;cifie le mot de passe associ&eacute; &agrave; votre nom d'utilisateur.</li>

<li><strong>Enregistrer le mot de passe</strong>&nbsp;: S&eacute;lectionnez cette option pour chiffrer et enregistrer votre mot de passe de mani&egrave;re s&eacute;curis&eacute;e avec le Gestionnaire de mots de passe et vous &eacute;viter de devoir le retaper chaque fois que vous publiez des pages sur ce site.</li>
</ul>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="site_settings"></a>

<h3>Param&egrave;tres de publication</h3>

<p>La bo&icirc;te de dialogue Param&egrave;tres de publication permet de cr&eacute;er, modifier et supprimer des param&egrave;tres de site de publication et de d&eacute;finir le site de publication par d&eacute;faut.</p>

<p>Si la bo&icirc;te de dialogue Param&egrave;tres de publication n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Param&egrave;tres du site de publication. Composer affiche la bo&icirc;te de dialogue Param&egrave;tres de publication.</li>
</ol>

<ul>
<li><b>Nouveau site</b>&nbsp;: Permet de sp&eacute;cifier des param&egrave;tres pour un nouveau site de publication. Composer ajoute le nom du nouveau site de publication &agrave; la liste des sites de publication disponibles.</li>

<li><b>D&eacute;finir par d&eacute;faut</b>&nbsp;: D&eacute;finit le site de publication s&eacute;lectionn&eacute; comme site de publication par d&eacute;faut. G&eacute;n&eacute;ralement, le site de publication par d&eacute;faut est l'emplacement distant que vous utilisez le plus souvent pour la publication de documents. Tous les documents que vous cr&eacute;ez ou modifiez seront publi&eacute;s sur le site de publication par d&eacute;faut, sauf si vous choisissez sp&eacute;cifiquement un autre site dans la bo&icirc;te de dialogue Publier la page.</li>

<li style="list-style: none">
<p>Pour publier un document &agrave; un autre emplacement distant, ouvrez le menu Fichier et choisissez Publier sous afin de choisir une autre destination de publication.</p>
</li>

<li><b>Supprimer le site</b>&nbsp;: Supprime le site s&eacute;lectionn&eacute; et ses param&egrave;tres de Composer.</li>

<li><b>Nom du site</b> : Sp&eacute;cifie le nom par lequel vous souhaitez d&eacute;signer ce site de publication.</li>

<li><b>Adresse de publication&nbsp;</b>: Sp&eacute;cifie l'adresse URL compl&egrave;te que vous a communiqu&eacute;e votre FAI ou administrateur syst&egrave;me. Cette adresse doit commencer par <tt>ftp://</tt> ou <tt>http://</tt>.</li>

<li style="list-style: none">
<p>L'adresse de publication sp&eacute;cifie l'emplacement o&ugrave; sont publi&eacute;s les documents sur ce site. Si vous ne savez pas quelle adresse indiquer, contactez votre FAI ou votre administrateur syst&egrave;me.</p>***
</li>

<li><b>Adresse HTTP de votre page d'accueil&nbsp;</b>: Sp&eacute;cifie l'adresse HTTP de votre r&eacute;pertoire de publication principal. Cette adresse ne doit pas inclure de nom de fichier ni de sous-r&eacute;pertoire.</li>

<li style="list-style: none">
<p>Elle doit toujours commencer par <tt>http://</tt>. Dans certains cas, cette adresse est la m&ecirc;me que l'adresse de publication. Si vous ne savez pas quelle adresse indiquer, contactez votre FAI ou votre administrateur syst&egrave;me ou laissez le champ vide.</p>
</li>

<li><b>Nom d'utilisateur</b> : Sp&eacute;cifie le nom d'utilisateur que vous utilisez pour vous connecter au FAI ou au r&eacute;seau.</li>

<li><b>Mot de passe</b>&nbsp;: Sp&eacute;cifie le mot de passe associ&eacute; &agrave; votre nom d'utilisateur.</li>

<li><strong>Enregistrer le mot de passe</strong>&nbsp;: S&eacute;lectionnez cette option pour enregistrer votre mot de passe de mani&egrave;re s&eacute;curis&eacute;e avec le Gestionnaire de mots de passe et vous &eacute;viter de devoir le retaper chaque fois que vous publiez des pages sur ce site.</li>
</ul>

<p>[&nbsp;<a href="#publish_top">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Composer_settingsSDX"></a> <a name="Composer:general_preferencesIDX"></a>

<hr> <a name="Set_Comp_prefs"></a>
<h1>Pr&eacute;f&eacute;rences de Composer</h1>

<p>Cette section d&eacute;crit les param&egrave;tres du panneau de pr&eacute;f&eacute;rences Composer. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<p>(Mac OS X) Dans le menu Netscape, choisissez Pr&eacute;f&eacute;rences.</p>
</li>

<li>Double-cliquez sur la cat&eacute;gorie Composer afin de d&eacute;velopper la liste.</li>
</ol>

<p>Pour plus d'informations sur les param&egrave;tres de publication de Composer, voir  <a href= "#edit_site">Param&egrave;tres de publication</a>.</p>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>

<p><a href="#PREFERENCES_EDITOR_GENERAL">Composer</a></p>

<p><a href="#PREFERENCES_NEWPAGE">Param&egrave;tres des nouvelles pages</a></p>
</td>
</tr>
</table>

<hr> <a name="Composer:css_stylesIDX"></a> <a name="PREFERENCES_EDITOR_GENERAL"></a>

<h2>Pr&eacute;f&eacute;rences de Composer - Composer</h2>

<p>Les pr&eacute;f&eacute;rences de Composer permettent de sp&eacute;cifier des param&egrave;tres pour l'enregistrement de fichiers et la modification de tableaux. Ces param&egrave;tres s'appliquent &agrave; tous les documents cr&eacute;&eacute;s.</p>

<p>Si les pr&eacute;f&eacute;rences de Composer ne sont pas encore affich&eacute;es, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Cliquez sur la cat&eacute;gorie Composer.</li>
</ol>

<ul>
<li><b>Nombre maximum de pages list&eacute;es :</b> Sp&eacute;cifie le nombre maximal de pages &agrave; afficher sous l'option Pages r&eacute;centes dans le menu Fichier.</li>

<li><b>Conserver le formatage source original </b>: Cette option pr&eacute;serve les sauts de ligne et le formatage original de la page pour le code source HTML. Cochez cette case pour que Composer ne supprime pas les espaces (lignes suppl&eacute;mentaires, tabulations, etc.) qui rendent le code HTML plus lisible. Cette pr&eacute;f&eacute;rence n'influence pas l'affichage des pages dans une fen&ecirc;tre de navigateur.</li>

<li><b>Reformater la source HTML </b>: Cette option reformate le code source HTML pour le rendre plus lisible, en ins&eacute;rant des sauts de ligne et des retraits. Cette pr&eacute;f&eacute;rence n'influence pas l'affichage des pages dans une fen&ecirc;tre de navigateur.</li>

<li><b>Enregistrer les images et les autres fichiers associ&eacute;s lors de l'enregistrement des pages</b>&nbsp;: Si cette option est s&eacute;lectionn&eacute;e, toutes les images, les scripts JavaScript (JS), les styles CSS et autres fichiers associ&eacute;s sont enregistr&eacute;s au m&ecirc;me endroit que le document lorsque celui-ci est enregistr&eacute; la premi&egrave;re fois ou lorsqu'il est enregistr&eacute; dans un nouvel emplacement. Sinon, seul le fichier HTML est enregistr&eacute;.</li>

<li style="list-style: none">
<p>Par exemple, lorsque vous modifiez une page distante, ce param&egrave;tre veille &agrave; ce que tous les fichiers associ&eacute;s &agrave; la page distante soient enregistr&eacute;s localement au moment o&ugrave; vous enregistrez la page sur votre disque dur.</p>
</li>

<li><b>Toujours afficher la bo&icirc;te de dialogue de publication lors de la publication de pages</b>&nbsp;: Si cette option est s&eacute;lectionn&eacute;e, Composer affiche toujours la bo&icirc;te de dialogue Publier la page lorsque vous cliquez sur le bouton Publier ou que vous choisissez Publier dans le menu Fichier. Sinon, Composer n'affiche la bo&icirc;te de dialogue Publier la page que s'il a besoin de davantage d'informations pour publier la page.</li>

<li><b>Conserver la disposition du tableau lors de l'insertion ou de la suppression de cellules&nbsp;</b>: Cochez cette case pour que Composer conserve toujours la disposition du tableau (c'est-&agrave;-dire une forme rectangulaire) en ajoutant des cellules au besoin. Si vous la d&eacute;s&eacute;lectionnez, lorsque vous supprimez une ou plusieurs cellules, Composer en supprime &eacute;galement la bordure, ce qui peut entra&icirc;ner l'affichage d'espaces vides ou un contour irr&eacute;gulier en raison du nombre variable de cellules.</li>

<li style="list-style: none"> <a name="style_sheetsSDX"></a> <a name="generating_html_or_cssSDX"></a></li>

<li><strong>Utiliser des styles CSS plut&ocirc;t que des &eacute;l&eacute;ments et des attributs HTML</strong>&nbsp;: Permet l'utilisation de styles CSS dans vos documents Composer. Lorsque cette pr&eacute;f&eacute;rence est s&eacute;lectionn&eacute;e, Composer g&eacute;n&egrave;re un formatage HTML 4.01 avec des styles CSS int&eacute;gr&eacute;s.</li>

<li style="list-style: none">

<p>Sinon, Composer g&eacute;n&egrave;re un formatage HTML 4.01 mais n'utilise pas de styles CSS.</p>

<p>Compar&eacute; &agrave; HTML, le code HTML avec un formatage CSS est plus portable, plus facile &agrave; mettre &agrave; jour et plus compatible avec diff&eacute;rents navigateurs. Si vous activez cette pr&eacute;f&eacute;rence et modifiez un document cr&eacute;&eacute; sans CSS, Composer remplace les &eacute;l&eacute;ments modifi&eacute;s par des styles CSS.</p>

<p>Si vous activez les styles CSS, vous pouvez choisir une couleur de mise en surbrillance du texte s&eacute;lectionn&eacute; avec le bouton ad hoc de la barre d'outils de formatage. Vous pouvez &eacute;galement choisir un arri&egrave;re-plan de couleur pour tout &eacute;l&eacute;ment de la page. Ces fonctions ne sont pas disponibles si cette pr&eacute;f&eacute;rence n'est pas activ&eacute;e.</p>
</li>
</ul>

<p>[&nbsp;<a href="#Set_Comp_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="PREFERENCES_NEWPAGE"></a>

<h2>Pr&eacute;f&eacute;rences de Composer - Param&egrave;tres nouvelles pages</h2>

<p>Ces pr&eacute;f&eacute;rences permettent de d&eacute;finir des param&egrave;tres relatifs aux couleurs et aux images d'arri&egrave;re-plan pour tout document que vous cr&eacute;ez.</p>

<p>Si les param&egrave;tres des nouvelles pages ne sont pas encore affich&eacute;s, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Double-cliquez sur la cat&eacute;gorie Composer et cliquez sur Param&egrave;tres nouvelles pages.</li>
</ol>

<ul>
<li><strong>Auteur&nbsp;</strong>: Entrez votre nom. Il sera ajout&eacute; au code source HTML de chaque page que vous cr&eacute;erez.</li>

<li><strong>Couleurs par d&eacute;faut du lecteur&nbsp;</strong>: S&eacute;lectionnez cette option pour que les pages utilisent toujours les param&egrave;tres de couleur du navigateur de l'utilisateur pour le texte et les liens.</li>

<li><strong>Couleurs personnalis&eacute;es&nbsp;</strong>: S&eacute;lectionnez cette option pour toujours sp&eacute;cifier la couleur du texte et des liens. Ensuite, pour chaque &eacute;l&eacute;ment, s&eacute;lectionnez une couleur en cliquant sur le bouton de couleur correspondant.</li>

<li><strong>Image d'arri&egrave;re-plan&nbsp;</strong>: Entrez le nom et l'emplacement d'un fichier image ou cliquez sur Choisir le fichier pour le localiser sur le disque dur ou le r&eacute;seau.

<p><b>Remarque</b>&nbsp;: Les images d'arri&egrave;re-plan sont plac&eacute;es sous forme de mosa&iuml;que et remplacent les options de couleur d'arri&egrave;re-plan.</p>
</li>
</ul>

<p>Pour modifier le nom de l'auteur pour une seule page&nbsp;: Dans le menu Format, choisissez Titre et propri&eacute;t&eacute;s de la page.</p>

<p>Pour modifier les couleurs et l'image d'arri&egrave;re-plan d'une seule page&nbsp;: Ouvrez le menu Format et s&eacute;lectionnez Couleurs et fond de page.</p>

<p>[&nbsp;<a href="#Set_Comp_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<hr>
<p><i><!-- #BeginDate format:Sw1 -->20 juin 2002<!-- #EndDate --> </i></p>

<hr>
<p>Copyright &copy; 1994-2000 Netscape Communications Corporation.</p>
</body>
</html>

