<html>
<head>
<title>Aide des pr&eacute;f&eacute;rences avanc&eacute;es de Netscape</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">
<!-- <link rel="stylesheet" href="../style.css" type="text/css"> -->

</head>

<body bgcolor="white"> <a name="preferences:advancedIDX"></a> <a NAME="top"></a>
<h1>Pr&eacute;f&eacute;rences avanc&eacute;es</h1>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Avanc&eacute;. Si le panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Cliquez sur la cat&eacute;gorie Avanc&eacute;.</p>
<table summary="list of tables" CELLSPACING=2 CELLPADDING=4 WIDTH="324" BGCOLOR="#CCCCCC" >
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:
      <p><a href="#Advanced">Avanc&eacute;</a>

<p><a href="#Scripts">Scripts et  plugins</a>
<p><a href="#Cache">Cache</a>

<p><a href="#Proxies">Proxies</a>
<p><a href="#HTTP_Networking">R&eacute;seau HTTP </a>
<p><a href="#Software_Installation">Installation de logiciels </a>
      <p><a href="#Mouse_Wheel">Roulette de la souris </a>
      <p><a href="#system">Syst&egrave;me</a>
    </td>
</tr>
</table>

<p>&nbsp;</p> <a NAME="Advanced"></a> <a name="JavaSDX"></a> <a name="JavaSDX"></a> <a name="Quick_Launch:preferenceIDX"></a> <a name="QuickLaunchSDX"></a> <a name="disable_QuickLaunchSDX"></a> <a name="enable_QuickLaunchSDX"></a> <a name="memorySDX"></a>

<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - Avanc&eacute;</h2>
<p>Cette section explique comment utiliser le panneau de pr&eacute;f&eacute;rences Avanc&eacute; principal. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Cliquez sur la cat&eacute;gorie Avanc&eacute;.</p>
<p> Le panneau de pr&eacute;f&eacute;rences Avanc&eacute; principal permet de personnaliser Java, les mots de passe FTP et Quick Launch :</p>
<ul>
<li><b>Activer Java&nbsp;:</b>Autorise Netscape &agrave; interpr&eacute;ter les pages contenant du code Java. Java est utilis&eacute; sur certaines page Web pour incorporer du contenu interactif et multim&eacute;dia.
<li><b>Activer XSLT</b>&nbsp;: Permet &agrave; Netscape d'utiliser XSLT. XSLT (eXtensible Stylesheet Language/Transform) est un langage utilis&eacute; pour transformer un document XML en d'autres documents XML. Pour plus d'informations concernant XSLT, voir le document en ligne <a href="http://developer.netscape.com/evangelism/docs/articles/xslt/netscapexsltTOC.html" target="_blank">Transforming XML: Netscape and XSLT</a>.
<li><b>Envoyer cette adresse &eacute;lectronique comme mot de passe FTP anonyme&nbsp;</b>: Entrez une adresse &eacute;lectronique &agrave; utiliser comme mot de passe lors de la connexion anonyme &agrave; un site FTP.
<li><b>Activer Quick Launch&nbsp;</b>: Permet de r&eacute;duire le temps n&eacute;cessaire pour d&eacute;marrer Netscape. Voir "<a href="nav_help.html#nav_quicklaunch">Utilisation de Quick Launch</a>" pour plus d'informations sur l'utilisation de Quick Launch.<br>
<p><b>Remarque</b>&nbsp;: Quick Launch n'appara&icirc;t que sur les plates-formes Windows.</p>
</ul>
<p>&nbsp;</p>
<hr> <a name="Scripts"></a> <a name="preferences:JavaScriptIDX"></a> <a name="JavaScript:preferencesIDX"></a> <a name="disable_JavaScriptSDX"></a> <a name="JavaScriptSDX"></a>
<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - Scripts et plugins</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Scripts et plugins. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Avanc&eacute;, cliquez sur Scripts et plugins. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Scripts et plugins permet de contr&ocirc;ler la fa&ccedil;on dont JavaScript et les plugins sont utilis&eacute;s dans Netcape :</p>
<ul>
<li><b>Activer JavaScript pour</b>&nbsp;: S&eacute;lectionnez les cases &agrave; cocher suivantes pour activer JavaScript :
<ul>
<li><b>Navigator</b> : Active ou d&eacute;sactive JavaScript pour les pages Web ouvertes dans Navigator.</li>
<li><b>Messagerie & forums</b> : Active ou d&eacute;sactive JavaScript pour les pages Web ouvertes dans Messagerie & forums.</li>
</ul>
</li>
<li><b>Autoriser les pages Web &agrave; :</b> S&eacute;lectionnez les cases &agrave; cocher suivantes pour contr&ocirc;ler la fa&ccedil;on dont JavaScript peut &ecirc;tre utilis&eacute;&nbsp;:
<ul>
<li><b>Ouvrir un lien dans une nouvelle fen&ecirc;tre</b> : Permet d'ouvrir dans une nouvelle fen&ecirc;tre les liens sur lesquels vous cliquez. Certains liens sont configur&eacute;s pour s'ouvrir dans une nouvelle fen&ecirc;tre plut&ocirc;t que dans la m&ecirc;me fen&ecirc;tre. Une fois modifi&eacute;, ce contr&ocirc;le exige le red&eacute;marrage de Netscape pour &ecirc;tre pris en compte.</li>
<li><b>D&eacute;placer ou redimensionner des fen&ecirc;tres existantes</b> : Permet de redimensionner ou d&eacute;placer des fen&ecirc;tres ouvertes.</li>
<li><b>Monter ou descendre des fen&ecirc;tres</b>: Permet de placer des fen&ecirc;tres devant ou derri&egrave;re les autres.</li>
<li><b>Masquer la barre d'&eacute;tat</b> : Permet de masquer la barre d'&eacute;tat.</li>
<li><b>Modifier le texte de la barre d'&eacute;tat</b> : Permet de modifier le texte de la barre d'&eacute;tat, par exemple pour y faire d&eacute;filer du texte.</li>
<li><b>Modifier des images</b> : Permet de modifier ou d'animer des images, par exemple pour faire changer l'image lorsque le curseur de la souris passe dessus.</li>
<li><b>Cr&eacute;er ou modifier des cookies</b> : Permet de modifier ou cr&eacute;er des cookies avec JavaScript.</li>
<li><b>Lire des cookies</b> : Permet la lecture de cookies avec JavaScript.</li>
</ul>
</li>
<li><b>Activer les plugins pour</b>: Cochez cette case pour contr&ocirc;ler la fa&ccedil;on dont les plugins sont utilis&eacute;s :</li>
<ul>
<li><b>Messagerie & forums</b> : Permet l'utilisation de plugins dans Messagerie et forums.</li>
</ul>
</ul>
<p>Pour plus d'informations sur les plugins, voir <a href="file:///C:/Program%20Files/Netscape/MachVbranch/chrome/help/nav_help.html#nav_helperapps">Gestion de diff&eacute;rents types de fichiers</a>.</p>
<p>&nbsp;</p>

<hr> <a name="Cache"></a> <a name="preferences:cacheIDX"></a> <a name="cache:preferencesIDX"></a> <a name="clear_cacheSDX"></a> <a name="cacheSDX"></a>
<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - Cache</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Cache. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. S&eacute;lectionnez la cat&eacute;gorie Avanc&eacute;, cliquez sur Cache. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Cache permet d'ajuster le cache de Netscape en m&eacute;moire et sur disque :</p>
<ul>
<li><b>Cache en m&eacute;moire&nbsp;: </b>Entrez la quantit&eacute; de cache en m&eacute;moire &agrave; attribuer &agrave; Netscape. Le cache est effac&eacute; lorsque vous red&eacute;marrez l'ordinateur.</li>
<li><b>Cache sur disque</b>&nbsp;: Entrez la quantit&eacute; de cache sur disque &agrave; attribuer &agrave; Netscape. Le cache sur disque est enregistr&eacute; sur disque dur et peut &ecirc;tre r&eacute;utilis&eacute; m&ecirc;me si vous avez &eacute;teint l'ordinateur entre-temps.</li>
<li><b>Dossier de cache sur disque </b>: Affiche l'emplacement actuel du dossier de cache sur disque
<ul>
<li><b>Choisir un dossier </b>: Permet de choisir un emplacement pour le dossier de cache sur disque. </li>
</ul>
</li>
<li><b>Vider le cache en m&eacute;moire&nbsp;: </b>Permet de vider le cache en m&eacute;moire.</li>
<li><b>Vider le cache sur disque</b>&nbsp;: Permet de vider le cache sur disque.</li>
<li><b>Le document du cache est compar&eacute; &agrave; celui sur le r&eacute;seau&nbsp;:</b>
<ul>
<li><b>Chaque fois que je visualise la page&nbsp;</b>: Pour que Netscape compare une page Web au cache &agrave; chaque visualisation.</li>
<li><b>Lorsque la page est p&eacute;rim&eacute;e </b>: Indique &agrave; Netscape de comparer une page Web au cache lorsque la page est d&eacute;termin&eacute;e comme ayant expir&eacute; par le serveur.</li>
<li><b>Une fois par session&nbsp;</b>: Indique &agrave; Netscape de comparer une page Web au cache &agrave; chaque d&eacute;marrage de Netscape.</li>
<li><b>Jamais</b>&nbsp;: Indique &agrave; Netscape de ne jamais comparer les informations du cache au r&eacute;seau.</li>
</ul>
</li>
</ul>
<p>&nbsp;</p>

<hr> <a name="Proxies"></a> <a name="SOCKSSDX"></a> <a name="preferences:proxiesIDX"></a> <a name="proxies:preferencesIDX"></a>
<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - Proxies</h2>
<p>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Proxies. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;: </p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Avanc&eacute;, cliquez sur Proxies. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Proxies permet de configurer Netscape pour l'utilisation d'un proxy :</p>
<p><b>Avant de commencer&nbsp;: </b>Demandez &agrave; l'administrateur r&eacute;seau si vous avez un fichier de configuration de proxy ou le nom et le num&eacute;ro de port du proxy.</p>
<ul>
<li><b>Connexion directe &agrave; Internet</b>&nbsp;: S&eacute;lectionnez cette option si vous ne souhaitez pas utiliser de proxy.</li>
<li><b>Configuration manuelle du Proxy</b>&nbsp;: S&eacute;lectionnez cette option si vous ne poss&eacute;dez pas d'adresse de proxy (URL).
<ul>
<li><b>Proxy HTTP</b>, <b>Proxy SSL</b>, <b>Proxy FTP, Proxy Gopher</b>:<b> </b>Entrez le nom ou l'adresse IP num&eacute;rique du serveur proxy. Entrez le port dans le champ Port.</li>
<li><b>H&ocirc;te SOCKS </b>: Entrez le nom ou l'adresse IP num&eacute;rique du serveur proxy. Entrez le port dans le champ Port.
<ul>
<li><b>SOCKS v4, SOCKS v5 </b>: Lorsque vous entrez un h&ocirc;te SOCK, s&eacute;lectionnez "SOCKS v4" ou "SOCKS v5", selon la version de SOCKS utilis&eacute;e pour le proxy.
</li>
</ul>
</li>
</ul>
</li>
<ul>
<li><b>Pas de proxy pour </b>: Entrez les domaines pour lesquels vous ne souhaitez pas utiliser de proxy. S&eacute;parez les domaines par des virgules. Exemple : .votreentreprise.com, .votreentreprise.fr.</li>
</ul>
<li><b>Adresse de configuration automatique des proxies</b>&nbsp;: Choisissez cette option si vous avez un fichier de configuration ou une URL de proxy, puis entrez l'URL de configuration.</li>
</ul>
<p>&nbsp;</p>

<hr> <a name="HTTP_Networking"></a> <a name="keep-aliveSDX"></a> <a name="pipeliningSDX"></a> <a name="keep-aliveSDX"></a> <a name="HTTP_Networking:preferencesIDX"></a> <a name="preferences:HTTP_NetworkingIDX"></a>
<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - R&eacute;seau HTTP</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences R&eacute;seau HTTP. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Avanc&eacute;, cliquez sur R&eacute;seau HTTP. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences R&eacute;seau HTTP permet de configurer la mise en r&eacute;seau bas&eacute;e sur HTTP :</p>
<ul>
<li><b>Options de connexion directe, Options de connexion par proxy : </b>Choisissez la version HTTP et les options de connexion directe et par proxy.
<ul>
<li><b>Utiliser HTTP 1.0 </b>: Choisissez cette option pour utiliser la version originale de HTTP, standardis&eacute;e en 1996.</li>
<li><b>Utiliser HTTP 1.1 </b>: Choisissez cette option pour utiliser la nouvelle version de HTTP, qui apporte des am&eacute;liorations de performances, dont une utilisation plus efficace des connexions HTTP, un meilleur support de la mise en cache c&ocirc;t&eacute; client, la prise en charge de requ&ecirc;tes HTTP multiples (pipelines) et un contr&ocirc;le affin&eacute; des politiques d'expiration et de remplacement des caches.</li>
<li><b>Activer les diagnostics</b>: S&eacute;lectionnez cette option pour maintenir une connexion ouverte en vue d'autres requ&ecirc;tes HTTP, ce qui permet un gain de rapidit&eacute;.</li>
<li><b>Activer les pipelines </b>:<b> </b>S&eacute;lectionnez cette option pour activer les pipelines, qui permettent d'envoyer au serveur plusieurs requ&ecirc;tes HTTP &agrave; la fois, r&eacute;duisant ainsi le d&eacute;lai de chargement des pages Web.<br> <b>Remarque</b>&nbsp;: Les pipelines ne sont disponibles qu'avec HTTP 1.1.</li>
</ul>
</li>
</ul>
<p>&nbsp;</p>

<hr><a name="Software_Installation"></a> <a name="software_installation:preferencesIDX"></a> <a name="preferences:software_installationIDX"></a>
<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - Installation de logiciels</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Installation du logiciel. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Avanc&eacute;, cliquez sur Installation du logiciel. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Installation du logiciel permet d'activer l'installation de logiciels et la notification des mises &agrave; jour :</p>
<ul>
  <li><b>Activer l'installation de logiciels&nbsp;</b>: S&eacute;lectionnez cette option pour que Netscape affiche une invite lors de l'installation et de l'utilisation de nouveaux logiciels avec Netscape.</li>
  <li><b>Recherche de mises &agrave; jour </b>: S&eacute;lectionnez cette option pour recevoir une notification lorsqu'une nouvelle version de Netscape est disponible. Votre donn&eacute;es personnelles ne sont pas transmises &agrave; Netscape lors de la v&eacute;rification de votre version de Netscape.
    <ul>
      <li><b>hebdomadaire </b>: Choisissez cette option pour que Netscape v&eacute;rifie une fois par semaine si une nouvelle version de Netscape est disponible.</li>
      <li><b>mensuelle </b>: Choisissez cette option pour que Netscape v&eacute;rifie une fois par mois si une nouvelle version de Netscape est disponible.</li>
    </ul>
  </li>
</ul>
<p>&nbsp;</p>

<hr><a name="Mouse_Wheel"></a> <a name="mouse_wheel:preferencesIDX"></a> <a name="preferences:mouse_wheelIDX"></a>
<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - Roulette de la souris</h2>

<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Roulette de la souris. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;: </p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Avanc&eacute;, cliquez sur Roulette de la souris. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Roulette de la souris permet de contr&ocirc;ler l'utilisation de la roulette de la souris (entre les boutons de votre souris) dans Netscape :</p>
<ul>

<li><b>Touche de modification</b> : S&eacute;lectionnez dans la liste d&eacute;roulante une touche &agrave; utiliser en m&ecirc;me temps que la roulette de la souris pour effectuer une des op&eacute;rations suivantes.
<ul>

<li><b>Faire d&eacute;filer le document </b>: Fait d&eacute;filer le document du nombre de lignes sp&eacute;cifi&eacute; dans le champ.

<ul>

<li><b>Utiliser la valeur par d&eacute;faut du syst&egrave;me </b>: Ignore le nombre de lignes introduit et utilise &agrave; la place la valeur par d&eacute;faut du syst&egrave;me.</li>
</ul>
</li>
<li><b>Faire d&eacute;filer une page vers le haut ou vers le bas </b>: Fait d&eacute;filer le document d'une page &agrave; la fois vers le haut ou vers le bas. Ce param&egrave;tre permet un d&eacute;filement plus rapide, mais moins pr&eacute;cis, de la page avec la roulette de la souris.</li>
<li><b>Historique </b>: Effectue un d&eacute;placement vers l'arri&egrave;re ou vers l'avant dans les pages visit&eacute;es pr&eacute;c&eacute;demment.</li>
<li><b>Agrandir ou r&eacute;duire le texte </b>: Augmente ou r&eacute;duit la taille du texte sur une page Web. Ce param&egrave;tre permet de faciliter la lecture d'une page ou de faire tenir le texte sur l'&eacute;cran.</li>
</ul>
<p><b>Remarque</b>&nbsp;: Une fonction diff&eacute;rente peut &ecirc;tre affect&eacute;e &agrave; chaque touche de modification.</p>
</li>
</ul>


<p>&nbsp;</p>

<hr><a name="system"></a> <a name="System:preferencesIDX"></a> <a name="preferences:SystemIDX"></a>
<h2>Pr&eacute;f&eacute;rences avanc&eacute;es - Syst&egrave;me</h2>

<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Syst&egrave;me. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;: </p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Avanc&eacute;, cliquez sur Syst&egrave;me. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</p>
<p><b>Remarque</b>&nbsp;: Le panneau de pr&eacute;f&eacute;rences Syst&egrave;me n'appara&icirc;t que sur les plates-formes Windows.</p>
<p><br></p>
<p>Ce panneau permet de sp&eacute;cifier les fichiers et protocoles ouverts avec Netscape :</p>
<ul>

<li><b>Windows doit utiliser Netscape pour ouvrir ces types de fichiers </b>: S&eacute;lectionnez les types de fichiers &agrave; ouvrir par d&eacute;faut avec Netscape.</li>
<li><b>Windows doit utiliser Netscape pour g&eacute;rer ces protocoles </b>: S&eacute;lectionnez les protocoles &agrave; ouvrir par d&eacute;faut avec Netscape.</li>
<li><b>Avertissez-moi si d'autres applications modifient ces param&egrave;tres&nbsp;: </b>S&eacute;lectionnez cette option pour que Netscape vous pr&eacute;vienne si d'autres applications ont modifi&eacute; vos param&egrave;tres de fichier et de protocole Netscape par d&eacute;faut. </li>
</ul>
<p><b>Astuce&nbsp;</b>: Pour faire facilement de Netscape le navigateur par d&eacute;faut, voir <a href="cs_nav_prefs_navigator.html#Navigator">Pr&eacute;f&eacute;rences de Navigator - Navigator</a>. S&eacute;lectionnez &eacute;galement "Avertissez-moi si d'autres applications modifient ces param&egrave;tres" afin de savoir quand d'autres programmes deviennent les programmes par d&eacute;faut au lieu de Netscape.</p>
<hr>
<p><i> 19 juin 2002</i></p>
<hr>
<p>Copyright 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>
