<html>
<head>
<title>Aide des pr&eacute;f&eacute;rences de Netscape Navigator</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">
<!-- <link rel="stylesheet" href="../style.css" type="text/css"> -->

</head>

<body bgcolor="white"> <a NAME="nav_settings"></a> <a name="Navigator:preferencesIDX"></a> <a name="preferences:NavigatorIDX"></a>
<h1>Pr&eacute;f&eacute;rences de Navigator</h1>
<p>Cette section d&eacute;crit l'utilisation de la fen&ecirc;tre de pr&eacute;f&eacute;rences de Navigator. Si le panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Choisissez Navigator.</p>
<table summary="list of headings" CELLSPACING=2 CELLPADDING=4 WIDTH="324" BGCOLOR="#CCCCCC" >
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:
      <p><a href="#Navigator">Navigator</a>
      <p><a href="#History">Historique</a>
      <p><a href="#Languages">Langues</a>
      <p><a href="#Helper">Applications auxiliaires</a>
      <p><a href="#Smart">Assistants de navigation</a>

<p><a href="#Internet">Recherche sur Internet</a>
<p><a href="#Tabbed">Navigation par onglets</a>
<p><a href="#downloads">T&eacute;l&eacute;chargements </a>
</td>
</tr>
</table>

<p>&nbsp;</p> <a name="preferences:NavigatorIDX"></a> <a name="preferences:default_browserIDX"></a> <a name="default_browser_preferencesIDX"></a> <a name="default_browser_preferencesSDX"></a> <a name="home_pageSDX"></a> <a name="buttonsSDX"></a> <a NAME="Navigator"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - Navigator</h2>
<p>Cette section explique comment utiliser le panneau de pr&eacute;f&eacute;rences Navigator principal. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Cliquez sur la cat&eacute;gorie Navigator.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Navigator permet de personnaliser trois aspects du navigateur.
</p>
<ul>
<li><b>Navigator d&eacute;marre avec&nbsp;</b>: Choisissez un des boutons suivant pour d&eacute;terminer ce que Netscape affiche au d&eacute;marrage :
<ul>
<li> <b>Page vierge </b>: Fait d&eacute;marrer Navigator sans charger automatiquement une page Web.<br>
</li>
<li><b>Page d'accueil</b> : Charge votre page d'accueil (sp&eacute;cifi&eacute;e plus bas) &agrave; chaque d&eacute;marrage.<br>
</li>
<li><b>Derni&egrave;re page consult&eacute;e </b>: Charge la page qui &eacute;tait affich&eacute;e lorsque vous avez quitt&eacute; Netscape la derni&egrave;re fois.</li>
</ul>
<li><b> Navigateur par d&eacute;faut :</b> Permet de d&eacute;finir Netscape comme navigateur par d&eacute;faut ou indique que c'est le cas.
<ul>
<li><b>D&eacute;finir comme navigateur par d&eacute;faut : </b>Si elle est disponible, cliquez sur cette option pour faire de Netscape votre navigateur par d&eacute;faut.</li>
</ul>

<li><b>Page d'accueil</b>&nbsp;: Entrez l'adresse de la page Web &agrave; choisir comme page d'accueil ou cliquez sur "Utiliser la page courante" pour choisir la page Web en cours dans Navigator. Cliquez sur "Choisir le fichier" pour rechercher sur le disque un fichier &agrave; charger comme page d'accueil.
<li><b>S&eacute;lectionnez les boutons que vous souhaitez voir dans les barres d'outils&nbsp;</b>: Cochez les cases disponibles de votre choix pour les afficher dans les barres d'outils.<br> <br> Les boutons Atteindre, Rechercher et Imprimer apparaissent dans la barre de navigation, pr&egrave;s de l'angle sup&eacute;rieur droit de la fen&ecirc;tre Navigator. Tous les autres boutons apparaissent dans la barre d'outils personnelle. Pour plus d'informations sur l'ajout de signets &agrave; cette barre d'outils, reportez-vous &agrave; <a href="file:///C:/Documents%20and%20Settings/jatin/Desktop/Work%20Projects/machvhelp/machv/customize_help.html#cust_personal">Barre d'outils personnelle</a>.<br>
</ul>
<p>&nbsp;</p><hr> <a name="preferences:historyIDX"></a> <a NAME="History"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - Historique</h2>
<p>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Historique. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Navigator, cliquez sur Historique. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Navigator pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Historique permet de configurer trois param&egrave;tres d'historique dans Navigator.</p>
<ul>

<li><b>Historique de Navigation&nbsp;</b>:
<ul>
<li><b>M&eacute;moriser les pages visit&eacute;es pour les derniers __ jours </b>: Entrez le nombre de jours pendant lequel Netscape doit garder la trace des pages Web visit&eacute;es. Par exemple, si vous r&eacute;glez cette valeur sur 10 jours, les pages visit&eacute;es les dix derniers jours seront conserv&eacute;es dans l'historique. </li>
</ul>
</li>
<ul>
<li><b>Effacer l'historique </b>: Permet de supprimer la liste des sites visit&eacute;s.</li>
</ul>
<li><b>Historique de la barre d'outils d'adresse</b>&nbsp;:
<ul>
<li><b>Effacer la barre d'outils d'adresse </b>: Permet d'effacer la liste des sites dans le menu de la barre d'adresses.</li>
</ul>
</li>
<li><b>Historique de session&nbsp;</b>:
<ul>
<li><b>Nombre de pages dans l'historique de session </b>: Entrez le nombre de pages Web dont Netscape garde la trace via les boutons Pr&eacute;c&eacute;dent et Suivant.</li>
</ul>
</li>
</ul>
<p>Pour plus d'informations sur l'historique dans Netscape, reportez-vous &agrave; <a href="nav_help.html#nav_retrace">Retour en arri&egrave;re</a>.<br>
  </p>
<p>&nbsp;</p><hr> <a NAME="languages:Navigator_preferences"></a> <a name="character_codingSDX"></a> <a name="preferences:languagesIDX"></a> <a name="Languages"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - Langues</h2>
<p>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Langues. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Navigator, cliquez sur Langues. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Navigator pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Langues permet de choisir les langues et le codage de caract&egrave;res pour l'affichage des pages Web :</p>
<ul>

<li><b>Langues pour les pages Web&nbsp;</b>:
<ul>
<li><b>Monter / Descendre </b>: Cliquez sur un de ces boutons pour d&eacute;placer une langue s&eacute;lectionn&eacute;e vers le haut ou vers le bas, afin de d&eacute;finir l'ordre de pr&eacute;f&eacute;rence des langues indiqu&eacute;es.</li>
<li><b>Ajouter </b>: Permet d'ajouter d'autres langues pour l'affichage de pages Web.</li>
<li><b>Supprimer </b>: Cliquez pour supprimer une langue s&eacute;lectionn&eacute;e.
    </li>
</ul>
</li>
<li><b>Codage des caract&egrave;res&nbsp;:</b>
<ul>
<li><b>Codage de caract&egrave;res par d&eacute;faut </b>: Utilisez la liste d&eacute;roulante pour s&eacute;lectionner le codage des caract&egrave;res pour l'affichage de pages Web. </li>
</ul>
</li>
</ul>
<p>&nbsp;</p><hr> <a name="opening_filesSDX"></a> <a name="downloadingSDX"></a> <a name="downloadSDX"></a> <a name="preferences:helper_applicationsIDX"></a> <a name="Helper"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - Applications auxiliaires</h2>
<p>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Applications auxiliaires. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Navigator, cliquez sur Applications auxiliaires. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Navigator pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Applications auxiliaires permet de configurer la fa&ccedil;on dont diff&eacute;rents types de fichiers sont ouverts par d'autres applications dans Netscape :</p>
<ul>
<li><b>Sp&eacute;cifiez quelle application doit traiter chaque type de fichier :</b>
<ul>
<li><b>Types de fichiers&nbsp;</b>: Affiche les types de fichiers utilis&eacute;s par Netscape. S&eacute;lectionnez un type pour afficher les informations suivantes :
<ul>
<li><b>Extension </b>: Affiche l'extension de fichier correspondant au type de fichier s&eacute;lectionn&eacute;.</li>
<li><b>Type MIME </b>: Affiche le type MIME du type de fichier s&eacute;lectionn&eacute;.</li>
<li><b>G&eacute;r&eacute; par </b>: Affiche le programme &agrave; utiliser pour ouvrir chaque fichier du type s&eacute;lectionn&eacute;.</li>
</ul>
</li>
<li><b>Nouveau type </b>: Permet d'ajouter un nouveau type de fichier. Tapez ou choisissez la description, l'extension de fichier, le type MIME et l'application.</li>
<li><b>Modifier&nbsp;</b>: Permet de modifier les informations de traitement de fichiers pour un type de fichier s&eacute;lectionn&eacute;.</li>
<li><b>Supprimer </b>: Permet de supprimer un type de fichier s&eacute;lectionn&eacute;.</li>
</ul>
</li>
<li><b>Plug-in Finder Service </b>: S&eacute;lectionnez cette option pour utiliser Plugin Finder Service (PFS) chaque fois que Netscape a besoin d'un nouveau module externe. Si cette option n'est pas s&eacute;lectionn&eacute;e, PFS n'est utilis&eacute; que lorsque l'emplacement d'un module externe n'est pas indiqu&eacute; par la page Web qui exige ce module externe.</li>
<li><b>Ouverture de fichiers </b>:
<ul>
<li><b>R&eacute;initialiser</b> : Cette option permet d'effacer toutes les pr&eacute;f&eacute;rences en mati&egrave;re d'ouverture de fichiers que vous avez &eacute;ventuellement d&eacute;finies en d&eacute;s&eacute;lectionnant la case &agrave; cocher "Toujours demander avant d'ouvrir ce type de fichier" dans la bo&icirc;te de dialogue de t&eacute;l&eacute;chargement.</li>
</ul>
</li>
</ul>
<p>Pour plus d'informations sur le traitement de diff&eacute;rents types de fichiers dans Netscape, reportez-vous &agrave; <a href="nav_help.html#nav_helperapps">Gestion de diff&eacute;rents types de fichiers</a>.</p>
<p>&nbsp;</p><hr>

<a name="internet_keywordsSDX"></a> <a name="keywordsSDX"></a> <a name="whats_relatedSDX"></a> <a name="autocompleteSDX"></a> <a name="preferences:smart_browsingIDX"></a> <a name="Smart"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - Assistants de navigation</h2>
<p>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Assistants de navigation. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Navigator, choisissez Assistants de navigation. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Navigator pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Assistants de navigation permet de mieux naviguer dans les pages Web avec Internet Keywords et le remplissage automatique de la barre d'adresses.</p>
<ul>
<li><b>Mots-cl&eacute;s Internet</b>&nbsp;:
<ul>
<li><b>Activer Internet Keywords </b>: Permet un acc&egrave;s rapide aux services tels que les cotations boursi&egrave;res, la recherche et d'autres informations de la barre d'adresses.</li>
<li><b>Plus d'informations </b>: Permet d'obtenir davantage d'informations sur l'utilisation des mots-cl&eacute;s Internet.</li>
</ul>
</li>
<li><b>Remplissage automatique de la barre d'adresses</b> :
<ul>
<li><b>Remplir automatiquement le texte tap&eacute; dans la barre d'adresses </b>: Permet de compl&eacute;ter automatiquement le texte pr&eacute;c&eacute;demment entr&eacute; dans la barre d'adresses. </li>
<li><b>Avanc&eacute;&nbsp;</b>: Cliquez sur cette option, puis s&eacute;lectionnez une ou plusieurs des options suivantes :
<ul>
<li><b>Remplissage auto meilleure correspondance en cours de saisie </b>: Lors de la saisie dans la barre d'adresses, Netscape compl&egrave;te automatiquement l'adresse Web en utilisant l'adresse d'un site Web visit&eacute; dont la correspondance est la plus proche.</li>
<li><b>Afficher une liste de correspondances </b>: Lors de la saisie dans la barre d'adresses, Netscape affiche une liste d&eacute;roulante d'adresses de sites Web visit&eacute;s correspondantes.</li>
<li><b>Afficher le moteur de recherche Internet </b>: Affiche une option de liste d&eacute;roulante permettant de rechercher, &agrave; l'aide du moteur de recherche par d&eacute;faut, des mots que vous saisissez .</li>
<li><b>Correspondance uniquement avec les sites Web que vous avez tap&eacute;s pr&eacute;c&eacute;demment </b>: N'affiche que les sites Web dont l'adresse a &eacute;t&eacute; entr&eacute;e dans la barre d'adresses, et non les sites ouverts d'une autre mani&egrave;re (p. ex., en cliquant sur un lien dans une page Web).</li>
</ul>
</li>
</ul>
</li>
</ul>
<p>&nbsp;</p><hr> <a name="search_engineSDX"></a> <a name="searchSDX"></a> <a name="preferences:internet_searchIDX"></a> <a name="Internet"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - Recherche sur Internet</h2>
<p>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Recherche sur Internet. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Navigator, cliquez sur Recherche sur Internet. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Navigator pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences Recherche sur Internet permet de d&eacute;finir la recherche &agrave; l'aide de Netscape :</p>
<ul>

<li><b>Moteur de recherche par d&eacute;faut&nbsp;</b>:
<ul>
<li><b>Rechercher avec </b>: Utilisez la liste d&eacute;roulante pour s&eacute;lectionner le moteur de recherche Web &agrave; utiliser.</li>
</ul>
</li>
<li><b>R&eacute;sultats de la recherche</b>&nbsp;:
<ul>
<li><b>Ouvrir l'onglet Recherche de la barre lat&eacute;rale lorsque des r&eacute;sultats de recherche sont disponibles </b>: Netscape ouvre la barre lat&eacute;rale et affiche les r&eacute;sultats de la recherche.</li>
</ul>
</li>
<li><b>Pr&eacute;f&eacute;rence de l'onglet Recherche de Ma barre lat&eacute;rale&nbsp;</b>:
<ul>
<li><b>De base </b>: Utilise un seul moteur de recherche pour les recherches dans Netscape. </li>
<li><b>Avanc&eacute; </b>:<b> </b>Permet de choisir un ou plusieurs moteurs de recherche dans une liste lors d'une recherche dans Netscape.</li>
</ul>
</li>
</ul>
<p>&nbsp;</p>
<hr> <a name="preferences:Tabbed_BrowsingIDX"></a> <a name="Tabbed"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - Navigation par onglets</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Navigation par onglets. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:
</p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Navigator, choisissez Navigation par onglets. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Navigator pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Ce panneau de pr&eacute;f&eacute;rences permet de configurer la navigation par onglets :</p>
<p><b>Remarque</b>&nbsp;: Sur Mac OS, lorsque vous &ecirc;tes invit&eacute; &agrave; appuyer sur Control (Ctrl), appuyez sur Commande.</p>
<ul>
<li><b>Affichage des onglets </b>:
<ul>
<li><b>Masque la barre d'onglets lorsqu'un seul onglet est ouvert </b>: S&eacute;lectionnez cette option pour n'afficher la barre Navigation par onglets que lorsque plusieurs onglets Navigator sont ouverts.</li>
<li><b>Charger les liens en arri&egrave;re-plan </b>: S&eacute;lectionnez cette option pour emp&ecirc;cher Netscape de basculer vers un nouvel onglet lorsque la fonction "Ouvrir dans un nouvel onglet" est utilis&eacute;e pour ouvrir un lien.</li>
</ul>
</li>
<li><b>Ouvrir des onglets plut&ocirc;t que des fen&ecirc;tres pour </b>:
<ul>
<li><b>Clic du bouton central ou Ctrl-clic des liens dans une page Web </b>: S&eacute;lectionnez cette option pour ouvrir des liens vers des pages Web dans un nouvel onglet lorsque vous cliquez sur un lien avec le bouton central de la souris ou appuyez sur Ctrl.</li>
<li><b>Ctrl+Entr&eacute;e dans la barre d'adresse </b>: S&eacute;lectionnez cette option pour ouvrir un lien de page Web dans un nouvel onglet lorsque vous tapez une adresse URL dans la barre d'adresses et appuyez sur Ctrl+Entr&eacute;e.</li>
</ul>
<p>&nbsp;</p>
</li>
</ul>
<hr> <a name="downloadSDX"></a> <a name="downloadingSDX"></a> <a name="Download_Manager:preferencesIDX"></a> <a name="preferences:DownloadsIDX"></a> <a name="downloads"></a>
<h2>Pr&eacute;f&eacute;rences de Navigator - T&eacute;l&eacute;chargements</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences T&eacute;l&eacute;chargements. Si ce panneau n&rsquo;est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;: </p>
<p> 1. Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.<br> 2. Dans la cat&eacute;gorie Navigator, cliquez sur T&eacute;l&eacute;charger. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Navigator pour d&eacute;velopper la liste.</p>
<p><br></p>
<p>Le panneau de pr&eacute;f&eacute;rences T&eacute;l&eacute;chargements permet de configurer la fa&ccedil;on dont Netscape traite les fichiers t&eacute;l&eacute;charg&eacute;s &agrave; partir de pages Web :</p>
<ul>
<li><b>Au d&eacute;marrage d'un t&eacute;l&eacute;chargement </b>:
<ul>
<li><b>Ouvrir le Gestionnaire de t&eacute;l&eacute;chargement </b>: Ouvre le Gestionnaire de t&eacute;l&eacute;chargement, qui affiche l'&eacute;tat du t&eacute;l&eacute;chargement en cours et des t&eacute;l&eacute;chargements pr&eacute;c&eacute;dents. L'&eacute;tat de tous les t&eacute;l&eacute;chargements est donn&eacute; dans une fen&ecirc;tre unique.</li>
<li><b>Ouvrir une bo&icirc;te de dialogue de progression </b>: Affiche une bo&icirc;te de dialogue de progression, indiquant l'&eacute;tat du t&eacute;l&eacute;chargement en cours. L'&eacute;tat de chaque t&eacute;l&eacute;chargement est donn&eacute; dans une fen&ecirc;tre s&eacute;par&eacute;e.</li>
<li><b>Ne rien ouvrir </b>: Permet de t&eacute;l&eacute;charger les fichiers de mani&egrave;re invisible. Aucun &eacute;tat n'est donn&eacute; pour tous les t&eacute;l&eacute;chargements.</li>
</ul>
</li>
</ul>
<p>Pour plus d'informations sur le t&eacute;l&eacute;chargement de fichiers &agrave; partir de pages Web, reportez-vous &agrave; <a href="nav_help.html#nav_helperapps">Gestion de diff&eacute;rents types de fichiers</a>.</p>
<p>&nbsp;</p>
<hr>
<p> <i> 19 juin 2002</i> </p>
<hr>
<p>Copyright 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>
