<html>
<head>
<title>Personnalisation de Netscape</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">
<!-- <link rel="stylesheet" href="../style.css" type="text/css"> -->

</head>

<body bgcolor="white">

<a name="cust_main"></a> <div class="boilerplate">Ce document est fourni par Netscape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>
<hr>
<h1>Personnalisation de Netscape</h1>
<p>Netscape s'accompagne de diverses fonctionnalit&eacute;s (telles que Ma barre lat&eacute;rale, les signets et la navigation par onglets) qui vous permettent de personnaliser le logiciel en fonction de vos besoins.</p>
<p>Cette section d&eacute;crit les options personnalisables du composant de navigation de Nestcape, &agrave; savoir&nbsp;: Navigator.</p>
<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#cust_sidebar">Ma barre lat&eacute;rale</a></p>
<p><a href="#cust_tabbed">Navigation par onglets</a></p>
<p><a href="#cust_font">Changement des polices, couleurs et th&egrave;mes</a></p>
<p><a href="#cust_toolbar">Barres d'outils</a></p>
<p><a href="#cust_bkmk">Signets</a></p>
<p><a href="#cust_page">Sp&eacute;cification du mode de d&eacute;marrage de Netscape</a></p>
<p><a href="cs_nav_prefs_appearance.html#nav_settings">Param&egrave;tres de Navigator</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p>
<hr><a name="cust_sidebar"></a>
<h1>Ma barre lat&eacute;rale</h1>
<p>&nbsp;</p>
<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=370>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#cust_sidebar_define">Fonction de Ma barre lat&eacute;rale</a></p>
<p><a href="#cust_sidebar_using">Utilisation de Ma barre lat&eacute;rale</a></p>
<p><a href="#cust_sidebar_adding">Ajout d'onglets &agrave; Ma barre lat&eacute;rale</a></p>
<p><a href="#cust_sidebar_indiv">Personnalisation d'onglets de Ma barre lat&eacute;rale</a></p>
<p><a href="#cust_sidebar_reorg">R&eacute;organisation des onglets de Ma barre lat&eacute;rale</a></p>
<p><a href="#cust_sidebar_removing">Suppression d'onglets de Ma barre lat&eacute;rale</a></p>
<p><a href="#cust_sidebar_openclose">Ouverture, fermeture et redimensionnement de Ma barre lat&eacute;rale</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p> <a name="My_Sidebar:descriptionIDX"></a> <a name="cust_sidebar_define"></a>
<h2>Fonction de Ma barre lat&eacute;rale</h2>
<p>Ma barre lat&eacute;rale est une zone personnalisable de votre navigateur, permettant de conserver les &eacute;l&eacute;ments dont vous avez besoin en permanence (l'actualit&eacute; et la m&eacute;t&eacute;o, votre carnet d'adresses ou liste d'amis, les cours de la bourse, un calendrier) et comportant de nombreuses autres options disponibles. Ma barre lat&eacute;rale vous pr&eacute;sente ces &eacute;l&eacute;ments dans des onglets mis &agrave; jour en permanence.</p>
<p>Netscape est fourni avec quelques onglets pr&eacute;d&eacute;finis dans Ma barre lat&eacute;rale, mais vous pouvez la personnaliser en ajoutant, supprimant et r&eacute;organisant des onglets.</p>
<p> [&nbsp;<A HREF="#cust_sidebar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp; </p> <a name="My_Sidebar:usingIDX"></a> <a name="cust_sidebar_using"></a>
<h2>Utilisation de Ma barre lat&eacute;rale</h2>
<p>A moins d'avoir <a href="#cust_sidebar_openclose">ferm&eacute;</a> Ma barre lat&eacute;rale, elle est toujours ouverte &agrave; gauche du navigateur. Pour afficher un onglet&nbsp;:</p>
<ul>
<li>Cliquez sur le titre d'un onglet&nbsp;; cliquez, par exemple, sur "Recherche". L'onglet Recherche s'ouvre. Il vous permet de rechercher des pages Web.
</ul>
<table summary="image table" cellpadding="5">
<tr>
<td width="140"> <img src="images/sidebarclosed_small.gif" hspace="0" vspace="0" alt="Ma barre lat&eacute;rale avec une poign&eacute;e">
</td>
<td valign="middle" width="820">
<p><b>Poign&eacute;e de<br> Ma barre lat&eacute;rale</b></p>
</td>
</tr>
<tr>
<td colspan="2">
<p>Si Ma barre lat&eacute;rale n'est pas visible, elle est peut-&ecirc;tre ferm&eacute;e. Pour l'ouvrir :</p>
<ol>
<li>D&eacute;placez le pointeur de la souris de haut en bas le long de la bordure gauche de la fen&ecirc;tre Netscape. Le pointeur se transforme en main lorsqu'il passe au-dessus de la poign&eacute;e de Ma barre lat&eacute;rale.
<li>Cliquez sur la poign&eacute;e pour ouvrir Ma barre lat&eacute;rale.
<p><b>Remarque</b>&nbsp;: Si Ma barre lat&eacute;rale n'est pas s&eacute;lectionn&eacute;e dans le menu Afficher de Navigator (sous-menu Afficher/Masquer), vous ne verrez ni le cadre, ni sa poign&eacute;e.</p>
</ol>
</td>
</tr>
</table>
<p><b>Astuce&nbsp;</b>: Pour recharger l'onglet Ma barre lat&eacute;rale, cliquez sur le titre de l'onglet avec le bouton droit de la souris, puis choisissez Recharger dans le menu contextuel. </p>
<p>[&nbsp;<A HREF="#cust_sidebar">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="My_Sidebar:adding_tabsIDX"></a> <a name="cust_sidebar_adding"></a>
<h2>Ajout d'onglets &agrave; Ma barre lat&eacute;rale</h2>
<p>Pour ajouter un onglet&nbsp;:
<ol>
<li>Cliquez sur "Onglets" en haut de Ma barre lat&eacute;rale et s&eacute;lectionnez Personnaliser ma barre lat&eacute;rale dans le menu.
<li>Dans la fen&ecirc;tre Personnaliser la barre lat&eacute;rale, s&eacute;lectionnez un onglet de la liste de gauche. Double-cliquez sur les dossiers pour les ouvrir ou les fermer.
<li>Cliquez sur Ajouter.
<li>Ajoutez autant d'onglets que vous le souhaitez.
<li>Cliquez sur OK pour terminer.
</ol>
<p><b>Remarque</b>&nbsp;: Si vous ajoutez plus de huit onglets &agrave; Ma barre lat&eacute;rale, Netscape masque les onglets restants afin de ne pas encombrer Ma barre lat&eacute;rale. Pour faire d&eacute;filer les onglets masqu&eacute;s, cliquez sur la fl&egrave;che vers le bas situ&eacute;e au bas de Ma barre lat&eacute;rale jusqu'&agrave; ce que vous acc&eacute;diez &agrave; l'onglet voulu. Cliquez sur la fl&egrave;che vers le haut pour faire d&eacute;filer la liste des onglets vers le haut.</p>
<p><b>Astuce</b>: </p>
<ul>
<li>Pour pr&eacute;visualiser un onglet de Ma barre lat&eacute;rale avant de l'ajouter, s&eacute;lectionnez un onglet dans la liste situ&eacute;e sur la gauche de la bo&icirc;te de dialogue Personnaliser Ma barre lat&eacute;rale et cliquez sur Test. Apr&egrave;s quelques secondes, l'onglet s'affiche dans la fen&ecirc;tre Pr&eacute;visualisation des onglets.</li>
<li>Pour afficher une liste compl&egrave;te et class&eacute;e des onglets disponibles pour Ma barre lat&eacute;rale, cliquez sur le bouton "Onglets" en haut de Ma barre lat&eacute;rale, puis sur contacts de la barre lat&eacute;rale.</li>
</ul>
<p>Vous pouvez &eacute;galement activer et d&eacute;sactiver des onglets de Ma barre lat&eacute;rale.</p>
<ol>
<li>Cliquez sur "Onglets" en haut de Ma barre lat&eacute;rale. Les onglets en cours s'affichent dans la partie inf&eacute;rieure du menu.
<li>S&eacute;lectionnez les onglets &agrave; afficher dans Ma barre lat&eacute;rale. Supprimez la marque de s&eacute;lection pour d&eacute;sactiver un onglet (il appara&icirc;tra toujours dans le menu).
</ol>
<p><b>Astuce&nbsp;: </b>Pour d&eacute;sactiver rapidement un onglet de Ma barre lat&eacute;rale, cliquez sur son nom avec le bouton droit et s&eacute;lectionnez Masquer l'onglet.</p>
<p> [&nbsp;<A HREF="#cust_sidebar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p> <a name="My_Sidebar:customizing_tabsIDX"></a> <a name="cust_sidebar_indiv"></a>
<h2>Personnalisation d'onglets de Ma barre lat&eacute;rale</h2>
<p><b>Remarque</b>&nbsp;: Tous les onglets ne peuvent pas &ecirc;tre personnalis&eacute;s. </p>
<ol>
<li>Cliquez sur "Onglets" en haut de Ma barre lat&eacute;rale et s&eacute;lectionnez Personnaliser Ma barre lat&eacute;rale dans le menu.
<li>S&eacute;lectionnez un onglet disponible dans la liste de droite.
<li>Cliquez sur Personnaliser l'onglet si ce bouton est activ&eacute;. Une fen&ecirc;tre s'affiche avec des informations et des options de personnalisation de l'onglet.
<p>Les instructions varient selon la source de l'onglet&nbsp;: outre Netscape, les onglets peuvent &ecirc;tre fournis par toute soci&eacute;t&eacute;, organisation ou personne utilisant Internet.</p>
<li>Apr&egrave;s avoir respect&eacute; les instructions du fournisseur de l'onglet, fermez la fen&ecirc;tre de personnalisation (ou respectez les instructions du fournisseur pour ce faire).
<li>Cliquez sur OK pour terminer.
</ol>
<p> [&nbsp;<A HREF="#cust_sidebar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p> <a name="My_Sidebar:reorganizing_tabsIDX"></a> <a name="cust_sidebar_reorg"></a>
<h2>R&eacute;organisation des onglets de Ma barre lat&eacute;rale</h2>
<p><br></p>
<ol>
<li>Cliquez sur "Onglets" en haut de Ma barre lat&eacute;rale et s&eacute;lectionnez Personnaliser Ma barre lat&eacute;rale dans le menu.
<li>S&eacute;lectionnez un onglet dans la liste de droite.
<li>Cliquez sur Haut et Bas pour d&eacute;placer l'onglet.
<li>R&eacute;p&eacute;tez les &eacute;tapes 1 et 2 pour continuer &agrave; r&eacute;organiser les onglets.
<li>Cliquez sur OK pour terminer.
</ol>
<p> [&nbsp;<A HREF="#cust_sidebar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p> <a name="My_Sidebar:removing_tabsIDX"></a> <a name="cust_sidebar_removing"></a>
<h2>Suppression d'onglets de Ma barre lat&eacute;rale</h2>
<p><br></p>
<ol>
<li>Cliquez sur "Onglets" en haut de Ma barre lat&eacute;rale et s&eacute;lectionnez Personnaliser Ma barre lat&eacute;rale dans le menu.
<li>S&eacute;lectionnez un onglet dans la liste de droite.
<li>Cliquez sur Supprimer.
<li>Supprimez autant d'onglets que vous le souhaitez.
<li>Cliquez sur OK pour terminer.
</ol>
<p> [&nbsp;<A HREF="#cust_sidebar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p> <a name="cust_sidebar_openclose"></a> <a name="close_sidebarSDX"></a>
<h2>Ouverture, fermeture et redimensionnement de Ma barre lat&eacute;rale</h2>
<table summary="image table" cellpadding="5">
<tr>
<td colspan="2">Utilisez les poign&eacute;es de Ma barre lat&eacute;rale pour l'ouvrir, la fermer et la redimensionner&nbsp;:</td>
</tr>
<tr valign="top">
<td><IMG SRC="images/sidebarclosed_small.gif" HSPACE="0" VSPACE="0" alt="image de la barre lat&eacute;rale avec une poign&eacute;e"></td>
<td valign="middle" width="820">
<p><b>Poign&eacute;e de<br> Ma barre lat&eacute;rale</b></p>
</td>
</tr>
<tr valign="top">
<td colspan="2">Si Ma barre lat&eacute;rale est ferm&eacute;e, sa poign&eacute;e est toujours visible. Si la poign&eacute;e n'appara&icirc;t pas, ouvrez le menu Afficher, choisissez Afficher/Masquer, puis cliquez sur Ma barre lat&eacute;rale. D&eacute;placez le pointeur de la souris de haut en bas le long de la bordure gauche de la fen&ecirc;tre Netscape. Le pointeur se transforme en main lorsqu'il touche la "poign&eacute;e" de Ma barre lat&eacute;rale, comme indiqu&eacute; dans l'illustration.
<p>&nbsp;</p>
<ul>
<li>Cliquez sur l'ic&ocirc;ne "Ouvrir Ma barre lat&eacute;rale" <img src="chrome://navigator/skin/sbar-open.gif" alt="ic&ocirc;ne Ouvrir Ma barre lat&eacute;rale"> dans la partie gauche de la barre d'outils personnelle.
<li>Cliquez sur la poign&eacute;e pour ouvrir et fermer Ma barre lat&eacute;rale.
<li>Cliquez-glissez sur la poign&eacute;e pour redimensionner Ma barre lat&eacute;rale.
</ul>
</td>
</tr>
</table>
<p>Pour supprimer Ma barre lat&eacute;rale, ainsi que la poign&eacute;e, effectuez l'une des op&eacute;rations suivantes&nbsp;:</p>
<ul>
<li>Cliquez sur l'ic&ocirc;ne "Fermer Ma barre lat&eacute;rale" <img src="chrome://navigator/skin/sbar-close.gif" alt="ic&ocirc;ne Fermer Ma barre lat&eacute;rale"> dans la partie gauche de la barre d'outils personnelle.
<li>Cliquez sur la croix situ&eacute;e dans l'angle sup&eacute;rieur droit de Ma barre lat&eacute;rale.
<li>Ouvrez le menu Afficher, choisissez Afficher/Masquer, puis d&eacute;s&eacute;lectionnez l'option Ma barre lat&eacute;rale.
<li>Appuyez sur&nbsp;F9.
</ul>
<p> [&nbsp;<A HREF="#cust_sidebar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p>

<hr> <a NAME="cust_tabbed"></a> <a NAME="multiple_windowsSDX"></a> <a NAME="multiple_pagesSDX"></a> <a NAME="Tabbed_BrowsingIDX"></a> <a NAME="Navigator:Tabbed_BrowsingSDX"></a>
<h1>Navigation par onglets</h1>
<p>&nbsp;</p>
<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#tabbed_whatis">Pr&eacute;sentation de la navigation par onglets</a></p>
<p><a href="#tabbed_setting">Configuration de la navigation par onglets</a></p>
<p><a href="#tabbed_opening">Ouverture d'onglets</a></p>
<p><a href="#tabbed_bookmarking">Ajout de signets pour des onglets</a></p>
<p><a href="#tabbed_closing">Fermeture d'onglets</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p> <a NAME="Tabbed_Browsing:what_isIDX"></a>
<h2><a name="tabbed_whatis"></a>Pr&eacute;sentation de la navigation par onglets</h2>
<p>La fonction de navigation par onglets vous permet d'ouvrir plusieurs pages Web dans une seule fen&ecirc;tre. Chaque page Web poss&egrave;de son propre onglet, plac&eacute; dans la partie sup&eacute;rieure de la fen&ecirc;tre unique. Tous les onglets apparaissent dans la barre d'onglets. Vous pouvez, par exemple, consulter les sites netscape.com, icq.com et cnn.com dans une seule fen&ecirc;tre au lieu d'en afficher trois distinctes. </p>
<table summary="image table" align="center" border="0" cellspacing="0">
<tr>
<td> Cliquez sur cette option pour ouvrir un nouvel onglet.</td>
<td>&nbsp;</td>
</tr>
<tr>
<td colspan="2"><img src="images/tabbed_browsing_bar.gif" alt="barre d'onglets"> </td>
</tr>
<tr>
<td align="middle"> <div align="left">Onglet en cours d'affichage.</div>
</td>
<td align="middle"> <div align="right">Cliquez sur cette option pour fermer l'onglet en cours d'affichage.</div>
</td>
</tr>
<tr>
<td align="middle" colspan="2"> <div align="center"> <b>Barre d'onglets</b></div>
</td>
</tr>
</table>
<p>Il n'est pas n&eacute;cessaire d'ouvrir plusieurs fen&ecirc;tres pour visiter des pages Web diff&eacute;rentes&nbsp;; vous disposez ainsi de plus d'espace libre sur votre bureau. Vous pouvez ainsi ouvrir, fermer et recharger des pages Web en toute simplicit&eacute;, sans devoir basculer vers une autre fen&ecirc;tre.</p>
<p>[&nbsp;<a href="#cust_tabbed">Retour au d&eacute;but de la section</a>&nbsp;] </p>
<p>&nbsp;</p> <a NAME="Tabbed_Browsing:setting_upIDX"></a>
<h2><a name="tabbed_setting"></a>Configuration de la navigation par onglets</h2>
<p>Il existe plusieurs mani&egrave;res de configurer la fonction de navigation par onglets. Vous pouvez, par exemple, modifier vos pr&eacute;f&eacute;rences afin d'ouvrir de nouveaux onglets de Navigator &agrave; partir de la barre d'adresses. Il est &eacute;galement possible de charger de nouveaux onglets en arri&egrave;re-plan de telle sorte que la premi&egrave;re page reste &agrave; l'avant-plan lors du t&eacute;l&eacute;chargement de la seconde. Pour plus d'informations sur la configuration de la navigation par onglets, consultez la rubrique <a href="cs_nav_prefs_navigator.html#Tabbed">Pr&eacute;f&eacute;rences de Navigator &ndash; Navigation par onglets</a>.</p>
<p>[&nbsp;<a href="#cust_tabbed">Retour au d&eacute;but de la section</a>&nbsp;] </p>
<p>&nbsp;</p>

<a NAME="Tabbed_Browsing:opening_tabsIDX"></a> <a NAME="opening_Navigator_tabsSDX"></a>
<h2><a name="tabbed_opening"></a>Ouverture d'onglets</h2>
<p>Pour ouvrir un onglet de Navigator, effectuez l'une des op&eacute;rations suivantes&nbsp;:</p>
<p><b>Ouverture d'un nouvel onglet vide&nbsp;: </b> </p>
<ul>
<li><b>A partir du menu Fichier&nbsp;</b>: Ouvrez le menu Fichier, choisissez Nouveau, puis cliquez sur Onglet de Navigator.</li>
<li><b>A partir de la barre d'onglets&nbsp;</b>: Si celle-ci est visible, vous pouvez cliquer sur l'ic&ocirc;ne "Nouvel onglet" <img src="chrome://global/skin/icons/tab-new.gif" alt="ic&ocirc;ne Nouvel onglet"> dans la partie gauche de la barre d'onglets.</li>
<li><b>A partir d'un menu d&eacute;roulant&nbsp;</b>: Si la barre d'onglets est visible, cliquez sur celle-ci avec le bouton droit de la souris, puis choisissez Nouvel onglet dans le menu contextuel.</li>
</ul>
<p><b>Ouverture d'un lien de page Web dans un onglet de Navigator&nbsp;:</b> </p>
<ul>
<li><b>A partir d'un menu d&eacute;roulant&nbsp;</b>: Cliquez sur le lien d'une page Web avec le bouton droit de la souris, puis cliquez sur Ouvrir le lien dans un nouvel onglet. Pour simuler un clic droit sous Mac&nbsp;OS, appuyez sur Ctrl et cliquez sur le bouton de la souris.
</li>
<li><b>A partir de la barre d'adresses&nbsp;</b>: Entrez l'adresse d'une page Web dans la barre d'adresses et appuyez ensuite sur Ctrl+Entr&eacute;e. (Sur Mac, appuyez sur Cmd+Retour).<br> <b>Remarque&nbsp;</b>: Vous devez configurer les pr&eacute;f&eacute;rences de la navigation par onglets de mani&egrave;re &agrave; ouvrir un onglet de Navigator &agrave; partir de la barre d'adresses. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="cs_nav_prefs_navigator.html#Tabbed">Pr&eacute;f&eacute;rences de Navigator &ndash; Navigation par onglets</a>.</li>
</ul>
<p><b>Astuce</b>:</p>
<ul>
<li>Pour ouvrir rapidement un onglet de Navigator vide, appuyez sur Ctrl+T.</li>
<li>Pour recharger un onglet de Navigator, cliquez avec le bouton droit de la souris n'importe o&ugrave; sur la barre d'onglets, puis s&eacute;lectionnez Recharger l'onglet dans le menu contextuel. Pour recharger tous les onglets, suivez la m&ecirc;me proc&eacute;dure en cliquant, cette fois, sur l'option Recharger tous les onglets .</li>
</ul>
<p>[&nbsp;<a href="#cust_tabbed">Retour au d&eacute;but de la section</a>&nbsp;] </p>
<p>&nbsp;</p> <a name="Tabbed_Browsing:bookmarking_tabsIDX"></a> <a name="GroupMarksSDX"></a> <a name="bookmark_groupSDX"></a> <a name="bookmarking_Navigator_tabsSDX"></a>
<h2><a name="tabbed_bookmarking"></a>Ajout de signets pour des onglets</h2>
<p>Pour cr&eacute;er un signet avec le groupe d'onglets de Navigator affich&eacute;s dans la fen&ecirc;tre actuelle&nbsp;:</p>
<ol>
<li> Ouvrez le menu Signets et choisissez l'option "Bookmark This Group of Tabs".<br>
</li>
<li>Attribuez un nom au groupe de signets dans le champ Nom.<br>
</li>
<li>Choisissez parmi les options suivantes :
<ul>
<li><b>Cr&eacute;er dans </b>: Choisissez un dossier dans lequel cr&eacute;er votre groupe de signets.<br>
</li>
<li><b>Nouveau dossier</b> &nbsp;: Cliquez sur ce bouton pour cr&eacute;er un dossier dans lequel placer votre groupe de signets.<br>
</li>
<li><b>Utiliser d&eacute;faut&nbsp;</b>: Cliquez sur ce bouton pour classer le groupe de signets dans le dossier r&eacute;serv&eacute; aux nouveaux signets. Pour plus d'informations sur la d&eacute;finition des dossiers destin&eacute;s aux nouveaux onglets, consultez la rubrique <a href="customize_help.html#cust_bkmk_organize">Organisation des signets</a>.<br>
</li>
</ul>
</li>
<li>Cliquez sur OK pour ajouter le groupe de signets.<br>
</li>
</ol>
<p>[&nbsp;<a href="#cust_tabbed">Retour au d&eacute;but de la section</a>&nbsp;] </p>
<p>&nbsp;</p> <a NAME="closing_Navigator_tabsSDX"></a> <a NAME="Tabbed_Browsing:closing_tabsIDX"></a>
<h2><a name="tabbed_closing"></a>Fermeture d'onglets</h2>
<p>Il existe plusieurs mani&egrave;res de fermer des onglets de Navigator&nbsp;:</p>
<p><b>Fermeture de l'onglet de Navigator en cours d'affichage </b>:</p>
<ul>
<li>Ouvrez le menu Fichier et choisissez Fermer l'onglet.</li>
<li>Cliquez sur le bouton "X" situ&eacute; &agrave; droite de la barre d'onglets.</li>
</ul>
<table summary="image table" align="center" border="0" cellspacing="0">
<tr>
<td> Cliquez sur cette option pour ouvrir un nouvel onglet.</td>
<td>&nbsp;</td>
</tr>
<tr>
<td colspan="2"><img src="images/tabbed_browsing_bar.gif" alt="barre d'onglets"> </td>
</tr>
<tr>
<td align="middle"> <div align="left">Onglet en cours d'affichage.</div>
</td>
<td align="middle"> <div align="right">Cliquez sur cette option pour fermer l'onglet en cours d'affichage.</div>
</td>
</tr>
<tr>
<td align="middle" colspan="2"> <div align="center"> <b>Barre d'onglets</b></div>
</td>
</tr>
</table>
<p><b>Astuce&nbsp;: </b></p>
<ul>
<li>Pour fermer un onglet de Navigator, m&ecirc;me s'il est masqu&eacute;, cliquez sur celui-ci avec le bouton droit de la souris, puis cliquez sur Fermer l'onglet dans le menu contextuel.</li>
<li>Pour ne garder ouvert qu'un seul onglet de Navigator, cliquez sur l'onglet en question avec le bouton droit de la souris, puis choisissez Fermer les autres onglets dans le menu contextuel.</li>
</ul>
<p>[&nbsp;<a href="#cust_tabbed">Retour au d&eacute;but de la section</a>&nbsp;] </p>
<p>&nbsp;</p>
<hr> <a NAME="cust_font"></a>
<h1>Changement des polices, couleurs et th&egrave;mes</h1>
<p>&nbsp;</p>
<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#cust_fonts">Modification des polices par d&eacute;faut</a></p>
<p><a href="#cust_colors">Modification des couleurs par d&eacute;faut</a></p>
<p><a href="#cust_themes">Modification du th&egrave;me</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p> <a NAME="serifSDX"></a> <a NAME="san_serifSDX"></a> <a NAME="cust_fonts"></a> <A NAME="Customizing FontsIDX"></A> <A NAME="fonts:customizingIDX"></A> <A NAME="web_pages:customizing_fontsIDX"></A>
<h2>Modification des polices par d&eacute;faut</h2>
<p>Normalement, les pages Web s'affichent dans la police par d&eacute;faut d&eacute;finie par votre navigateur ou choisie par leurs auteurs.</p>
<p>Pour modifier les polices par d&eacute;faut :</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.
<li>Dans la cat&eacute;gorie Aspect, choisissez Polices. Si aucune option n'est visible dans cette cat&eacute;gorie, double-cliquez sur Aspect pour d&eacute;velopper la liste.
<li>Dans la liste d&eacute;roulante "S&eacute;lectionner", choisissez un jeu de caract&egrave;res. Par exemple, pour d&eacute;finir les polices par d&eacute;faut pour le jeu de caract&egrave;res occidental (roman), s&eacute;lectionnez "Occidental."
<li>S&eacute;lectionnez si le texte proportionnel doit &ecirc;tre de type serif (comme Times Roman) ou sans serif (comme Arial). Sp&eacute;cifiez la taille de police du texte proportionnel.
<li>Si une police appropri&eacute;e est disponible pour votre jeu de caract&egrave;res, s&eacute;lectionnez des polices dans les cat&eacute;gories Serif, Sans serif, Cursive, Fantaisie et Fixe. Vous pouvez &eacute;galement attribuer une taille au texte fixe.
<li>Sp&eacute;cifiez si la police par d&eacute;faut doit &ecirc;tre serif ou sans serif.
<li>S&eacute;lectionnez une police &agrave; chasse fixe et sa taille. Certains types de texte, comme les &eacute;quations et formules, s'affichent dans une police &agrave; chasse fixe.
</ol>
<p>De nombreux auteurs de pages Web s&eacute;lectionnent leurs propres polices et tailles. Pour autoriser des polices autres que celles sp&eacute;cifi&eacute;es dans vos pr&eacute;f&eacute;rences, cochez la case "Autoriser les documents &agrave; utiliser d'autres polices".
<p>Pour r&eacute;gler la lisibilit&eacute; des polices, s&eacute;lectionnez dans la liste d&eacute;roulante la r&eacute;solution d'affichage des pages Web en points par pouce (dpi). S&eacute;lectionnez "Autres" pour ouvrir la bo&icirc;te de dialogue Etalonner la r&eacute;solution, qui permet d'&eacute;talonner la r&eacute;solution en mesurant la longueur d'une ligne &agrave; l'&eacute;cran. Une r&eacute;solution accrue am&eacute;liorera la lisibilit&eacute; du texte sur certains &eacute;crans.
<p> [&nbsp;<A HREF="#cust_font">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <A NAME="colors:customizing_web_pageIDX"></A> <A NAME="web_pages:customizing_colorsIDX"></A> <a NAME="cust_colors"></a>
<h2>Modification des couleurs par d&eacute;faut</h2>
<p>Normalement, les couleurs de fond et de texte des pages Web sont d&eacute;termin&eacute;es par les couleurs par d&eacute;faut de votre navigateur ou par les auteurs des pages.</p>
<p>Pour modifier les couleurs par d&eacute;faut :</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.
<li>Dans la cat&eacute;gorie Aspect, choisissez Couleurs. Si aucune option n'est visible dans cette cat&eacute;gorie, cliquez pour d&eacute;velopper la liste.
<li>Cliquez sur les blocs de couleur correspondant &agrave; Texte, Arri&egrave;re-plan, Liens non consult&eacute;s et Liens consult&eacute;s. S&eacute;lectionnez une couleur dans la palette. Vous pouvez &eacute;galement sp&eacute;cifier si les liens doivent &ecirc;tre soulign&eacute;s.
</ol>
<p>La plupart des auteurs de pages Web choisissent leurs couleurs. Vous pouvez ignorer les options des auteurs en s&eacute;lectionnant "Utiliser mes propres couleurs, ignorer les couleurs fournies".</p>
<p>Lorsque vous affichez la source d'une page Web, vous pouvez d&eacute;signer la syntaxe HTML d'une page Web par des couleurs sp&eacute;cifiques en cochant la case "Activer la mise en surbrillance de la syntaxe".</p>
<p> [&nbsp;<A HREF="#cust_font">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <A NAME="themes:changingIDX"></A> <A NAME="changing_skinsSDX"></A> <a NAME="cust_themes"></a>
<h2>Modification du th&egrave;me</h2>
<p>Vous pouvez modifier la pr&eacute;sentation et l'aspect de Netscape en changeant de th&egrave;mes.</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.
<li>Dans la cat&eacute;gorie Aspect, choisissez Th&egrave;mes.
<li>Cliquez sur le th&egrave;me &agrave; appliquer.
<li>Cliquez sur OK pour confirmer votre choix.
<p><b>Remarque&nbsp;: </b>Vous devez quitter et red&eacute;marrer Netscape apr&egrave;s l'application d'un nouveau th&egrave;me pour que la modification entre en vigueur.</p>
</ol>
<p><b>Raccourci</b>&nbsp;: Vous pouvez &eacute;galement changer de th&egrave;me en ouvrant le menu Afficher, en s&eacute;lectionnant Appliquer un th&egrave;me et en choisissant le th&egrave;me &agrave; utiliser. </p>
<p>[&nbsp;<A HREF="#cust_font">Retour au d&eacute;but de la section</A>&nbsp;]
<p>&nbsp;</p>

<hr> <a NAME="cust_toolbar"></a>
<h1>Barres d'outils</h1>
<p>&nbsp;</p>
<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#cust_navbar">Barre d'outils de navigation</a></p>
<p><a href="#cust_personal">Barre d'outils personnelle</a></p>
<p><a href="#cust_statusbar">Barre d'&eacute;tat</a></p>
<p><a href="#cust_taskbar">Barre de composants</a></p>
<p><a href="#cust_hide">Masquage d'une barre d'outils</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p> <a name="toolbar:navigation_toolbarIDX"></a> <a name="cust_navbar"></a>
<h2>Barre d'outils de navigation</h2>
<p>La barre d'outils de navigation, illustr&eacute;e ici, permet de naviguer sur le Web.</p>
<table summary="image table">
<tr>
<td colspan="4"> <IMG SRC="images/reload.gif" HSPACE="0" VSPACE="0" alt="barre d'outils de navigation">
</td>
</tr>
<tr>
<td> <b>Page pr&eacute;c&eacute;dente</b> </td>
<td> <b>Page suivante</b> </td>
<td> <b>Recharger</b> </td>
<td> <b>Arr&ecirc;ter</b> </td>
</tr>
</table>
<p> [&nbsp;<A HREF="#cust_toolbar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p> <a name="radioSDX"></a> <a name="toolbar:personal_toolbarIDX"></a> <a name="cust_personal"></a>
<h2>Barre d'outils personnelle</h2>
<p>La barre d'outils personnelle est enti&egrave;rement personnalisable, vous pouvez d&eacute;cider de son contenu. Elle contient des boutons pr&eacute;d&eacute;finis, notamment votre page My Netscape, votre page d'accueil, la recherche, le shopping et Radio@Netscape.com.
</p>
<p><b>Remarque</b>&nbsp;: Pour obtenir de l'aide sur Radio@Netscape.com, consultez l'<a href="http://help.netscape.com/radio" target="_blank">Aide de Radio@Netscape.com dans Netscape</a>.</p>

<table summary="image table">
<tr>
<td><img src="images/personalbar.gif" alt="Barre d'outils personnelle"></td>
</tr>
<tr>
<td> <div align="center"><b>Barre d'outils personnelle</b></div>
</td>
</tr>
</table>

<p>Vous pouvez ais&eacute;ment ajouter, supprimer et r&eacute;organiser des &eacute;l&eacute;ments de la barre d'outils personnelle.</p>
<h4><a name="buttononoff"></a> Activation et d&eacute;sactivation de boutons</h4>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.
<li>Cliquez sur Navigator.
<li>Choisissez les boutons dont vous souhaitez disposer dans la barre d'outils dans la liste "S&eacute;lectionnez les boutons que vous souhaitez voir dans les barres d'outils".
<li>Cliquez sur OK.
</ol> <a name="add_bookmarksSDX"></a> <a name="add_bookmarkSDX"></a> <a name="Adding_Personal_Toolbar_bookmarks"></a>
<p><br></p>
<h4>Ajout de signets &agrave; la barre d'outils personnelle</h4>
<p>Vous pouvez ajouter des boutons pour vos signets favoris ou des dossiers contenant des groupes de signets. Pour cr&eacute;er un signet &agrave; ajouter &agrave; la barre d'outils personnelle&nbsp;:</p>
<ol>
<li>Ouvrez une page Web pour laquelle cr&eacute;er un signet.
<li>Faites glisser l'ic&ocirc;ne de signet <img src="chrome://communicator/skin/bookmarks/bookmark-item.gif" alt="image de l'ic&ocirc;ne de signet" ><b> </b>(situ&eacute;e &agrave; gauche de l'URL dans la barre d'adresses) &agrave; l'emplacement d&eacute;sir&eacute; dans la barre d'outils personnelle. Vous pouvez faire glisser l'ic&ocirc;ne directement dans la barre d'outils personnelle ou dans l'un de ses dossiers. Pour plus d'informations sur l'ajout de dossiers de signets dans la barre d'outils personnelle, consultez la rubrique "<a href="#add_personal_toolbar_folder">Ajout de dossiers de signets &agrave; la barre d'outils personnelle</a>".
</ol>
<p><b>Remarque</b>&nbsp;: Il est possible que l'ic&ocirc;ne de signet <img src="chrome://communicator/skin/bookmarks/bookmark-item.gif" alt="image de l'ic&ocirc;ne de signet" > apparaisse sous la forme d'une autre ic&ocirc;ne de page si vous avez s&eacute;lectionn&eacute; l'option Afficher les ic&ocirc;nes de site Web dans les pr&eacute;f&eacute;rences. Pour plus d'informations sur la modification de ces pr&eacute;f&eacute;rences, consultez la rubrique <a href="cs_nav_prefs_appearance.html#appearance">Pr&eacute;f&eacute;rences d'aspect &ndash; Aspect</a>.</p>
<p>Chaque &eacute;l&eacute;ment du dossier de la barre d'outils personnelle s'affiche sous la forme d'un bouton de barre d'outils. Il peut &ecirc;tre n&eacute;cessaire d'agrandir la fen&ecirc;tre du navigateur pour les afficher tous.</p> <a name="bookmark_folderSDX"></a> <a name="folderSDX"></a> <a name="add_personal_toolbar_folder"></a>
<p><b>Ajout de dossiers signets &agrave; la barre d'outils personnelle</b></p>
<p>Vous pouvez ajouter des dossiers de signets &agrave; votre barre d'outils personnelle afin de classer vos signets favoris par cat&eacute;gories. Vous pouvez, par exemple, cr&eacute;er un dossier pour les signets ayant trait &agrave; vos loisirs et un autre pour vos activit&eacute;s professionnelles. Pour ajouter un signet &agrave; la barre d'outils personnelle&nbsp;:</p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.</li>
<li>S&eacute;lectionnez "Personal Toolbar Folder".</li>
<li>Cliquez sur Nouveau dossier dans la barre d'outils.</li>
<li> Attribuez un nom au nouveau dossier de signets. Le nom par d&eacute;faut est "Nouveau dossier".</li>
<li>Cliquez sur OK pour confirmer le nom de votre nouveau dossier de signets.</li>
</ol>
<p>Le nouveau dossier de signets appara&icirc;t &agrave; la fin de la barre d'outils personnelle.<br>
</p>
<p><br></p>
<h4>D&eacute;signation d'un dossier de signets comme dossier de la barre d'outils personnelle</h4>
<p><br></p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.
<li>S&eacute;lectionnez le dossier de signets dont vous souhaitez afficher les &eacute;l&eacute;ments dans la barre d'outils.
<li>Dans le menu Afficher, s&eacute;lectionnez Ajouter les barres d'outils personnelles dans ce dossier.
</ol>
<p>Les boutons de la barre d'outils personnelle correspondent d&eacute;sormais aux signets du dossier d&eacute;sign&eacute;.</p>
<p><br></p>
<h4>Suppression de signets de la barre d'outils personnelle</h4>
<p><br></p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.
<li>Cliquez sur Dossier de barre d'outils personnelle.
<li>S&eacute;lectionnez le signet ou dossier &agrave; supprimer.
<li>Appuyez sur Suppr sur le clavier.
<li>Fermez la fen&ecirc;tre G&eacute;rer les signets.
</ol>
<p><b>Astuce&nbsp;: </b>Pour supprimer rapidement un signet plac&eacute; dans la barre d'outils personnelle (et non dans un dossier), cliquez dessus avec le bouton droit et s&eacute;lectionnez Supprimer.</p>
<p><br></p>
<h4>R&eacute;organisation de la barre d'outils personnelle</h4>
<p><br></p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.
<li>Dans la fen&ecirc;tre Signets, cliquez sur Dossier de barre d'outils personnelle.
<li>S&eacute;lectionnez un signet ou dossier et faites-le glisser vers son nouvel emplacement.
<li>Une fois termin&eacute;, fermez la fen&ecirc;tre Signets.
</ol>
<p><b>Remarque&nbsp;: </b>Les boutons standard de la barre d'outils personnelle, tels que Rechercher et Page d'accueil, ne peuvent pas &ecirc;tre r&eacute;organis&eacute;s, mais ils peuvent &ecirc;tre <a href="#buttononoff">d&eacute;sactiv&eacute;s et activ&eacute;s</a>.</p>
<p><b>Astuce&nbsp;: </b>Pour d&eacute;placer rapidement un signet plac&eacute; dans la barre d'outils personnelle, faites-le glisser vers un nouvel emplacement de la barre d'outils personnelle ou dans un dossier.</p>
<p>[&nbsp;<A HREF="#cust_toolbar">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="cust_statusbar"></a> <a name="toolbar:status_barIDX"></a> <a name="work_offlineSDX"></a> <a name="work_onlineSDX"></a>
<h2>Barre d'&eacute;tat</h2>
<p>La barre d'&eacute;tat est situ&eacute;e au bas de toutes les fen&ecirc;tres Netscape. Elle comprend les &eacute;l&eacute;ments suivants&nbsp;:</p>
<ul>
<li> Barre de composants&nbsp;: Cette barre vous permet de basculer entre les diff&eacute;rents composants de Nestcape. Pour plus d'informations &agrave; ce sujet, consultez la rubrique  <a href="#cust_taskbar">Barre de composants&nbsp;</a>.</li>
<li>Informations sur l'&eacute;tat&nbsp;: Affichage d'informations telles que l'URL de la page Web ou l'&eacute;tat de chargement d'une page.</li>
<li>Ic&ocirc;ne de notification de cookie <img src="chrome://cookie/content/taskbar-cookie.gif" alt="ic&ocirc;ne de notification de cookie">&nbsp;: Cette ic&ocirc;ne s'affiche lorsqu'un site Web a utilis&eacute; un cookie d'une mani&egrave;re telle que vous devez en &ecirc;tre inform&eacute;. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="using_priv_help.html#cookie_notify">Notification des cookies</a>.</li>
<li>Ic&ocirc;ne Hors ligne <img src="chrome://communicator/skin/icons/offline.gif" alt="ic&ocirc;ne Hors ligne"> ou En ligne <img src="chrome://communicator/skin/icons/online.gif" alt="ic&ocirc;ne En ligne">&nbsp;: Cliquez sur cette ic&ocirc;ne pour basculer entre les modes en ligne et hors ligne. Lorsque vous travaillez hors ligne, vous emp&ecirc;chez Netscape de se connecter &agrave; Internet, par exemple, pour charger des images figurant sur des pages Web ou v&eacute;rifier automatiquement votre bo&icirc;te aux lettres.</li>
<li>Ic&ocirc;ne Cadenas (Exemple&nbsp;: <img src="chrome://communicator/skin/icons/lock-insecure.gif" alt="ic&ocirc;ne Cadenas">)&nbsp;: Cette ic&ocirc;ne vous indique si tout le contenu de la page Web a &eacute;t&eacute; chiffr&eacute; lors de sa r&eacute;ception par votre ordinateur. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="using_certs_help.html#using_certs_info">V&eacute;rification de la s&eacute;curit&eacute; d'une page Web</a>.</li>
</ul>
<p> [&nbsp;<a href="#cust_toolbar">Retour au d&eacute;but de la section</a>&nbsp;]
</p>
<p>&nbsp; </p> <a name="cust_taskbar"></a> <a name="taskbarSDX"></a> <a name="toolbar:Component_BarSDX"></a>
<h2>Barre de composants</h2>
<p>Utilisez la barre de composants situ&eacute;e au bas de la fen&ecirc;tre Netscape pour passer d'une t&acirc;che &agrave; l'autre (par exemple&nbsp;: navigation, messagerie et Instant Messenger).</p> <IMG SRC="images/taskbar.gif" HSPACE="0" VSPACE="0" alt="barre de composants">
<p> [&nbsp;<A HREF="#cust_toolbar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p> <a name="toolbar:hiding_a_toolbarIDX"></a> <a name="cust_hide"></a>
<h2>Masquage d'une barre d'outils</h2>
<p>Il existe deux mani&egrave;res de masquer les barres d'outils.</p>
<p>Pour r&eacute;duire une barre d'outils&nbsp;:</p>
<ul>
<li>Cliquez sur le petit triangle &agrave; gauche de la barre d'outils. Pour la r&eacute;afficher, cliquez de nouveau sur le triangle. (Remarque&nbsp;: Vous ne pouvez pas masquer la barre de composants en utilisant cette m&eacute;thode.)
</ul>
<p>Pour masquer totalement une barre d'outils, ainsi que son triangle&nbsp;:</p>
<ol>
<li>Ouvrez le menu Afficher.
<li>S&eacute;lectionnez Afficher/Masquer et d&eacute;s&eacute;lectionnez les barres d'outils &agrave; masquer.
</ol>
<p>Pour annuler cette action, ouvrez le menu Afficher, s&eacute;lectionnez Afficher/Masquer puis s&eacute;lectionnez les barres d'outils &agrave; afficher.</p>
<p> [&nbsp;<A HREF="#cust_toolbar">Retour au d&eacute;but de la section</A>&nbsp;]
</p>
<p>&nbsp;</p>

<hr> <a NAME="cust_bkmk"></a>
<h1>Signets</h1>
<p>&nbsp;</p>
<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#cust_bkmk_intro">Fonction des signets</a></p>
<p><a href="#cust_bkmk_use">Utilisation des signets</a></p>
<p><a href="#cust_bkmk_create">Cr&eacute;ation de signets
<!--  and Internet Shortcuts --> </a></p>
<p><a href="#cust_bkmk_organize">Organisation des signets</a></p>
<p><a href="#cust_bkmk_change">Modification de signets</a></p>
<p><a href="#cust_bkmk_search">Recherche dans les signets</a></p>
<p><a href="#cust_bkmk_multiple">Exportation ou importation d'une liste de signets</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p> <a name="favoritesSDX"></a> <a name="bookmarks:what_are_bookmarksIDX"></a> <a NAME="cust_bkmk_intro"></a>
<h2>Fonction des signets</h2>
<p>Les signets sont des raccourcis vers vos pages Web favorites. Plut&ocirc;t que de taper de longues URL (adresses Web), vous pouvez cr&eacute;er des signets vous amenant directement aux pages de votre choix.
<p>L'acc&egrave;s aux signets s'effectue par le menu Signets, l'onglet Signets de Ma barre lat&eacute;rale et la fen&ecirc;tre G&eacute;rer les signets. Il est possible de contr&ocirc;ler le contenu du menu Signets en ajoutant des signets pour vos pages Web favorites et en r&eacute;organisant votre liste de signets.</p>
<p>&nbsp;</p> <a name="bookmarks:using_bookmarksIDX"></a> <a NAME="cust_bkmk_use"></a>
<h2>Utilisation des signets</h2>
<p>Netscape comprend des signets pr&eacute;d&eacute;finis. Pour utiliser un signet&nbsp;:
<ol>
<li>Ouvrez le menu Signets.
<li>S&eacute;lectionnez un signet dans la liste ou dans l'un des dossiers de la liste.
</ol>
<p> [&nbsp;<A HREF="#cust_bkmk">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="adding_favoritesSDX"></a> <a NAME="adding_links_in NavigatorSDX"></a> <a NAME="adding_bookmarksSDX"></a> <a NAME="File_BookmarkSDX"></a> <a NAME="creating_bookmarksSDX"></a> <a NAME="cust_bkmk_create"></a> <a name="bookmarks:creating_bookmarksIDX"></a>
<h2>Cr&eacute;ation de signets</h2>
<p>Vous pouvez cr&eacute;er des signets pour vos sites Web favoris afin de pouvoir y retourner plus facilement.</p>
<p>Pour cr&eacute;er un signet pour la page en cours, proc&eacute;dez comme suit&nbsp;:</p>
<ul>
<li>Pour ajouter un signet au menu Signets, ouvrez ce dernier et choisissez Ajouter aux signets.
<li>Pour ajouter un signet dans un dossier sp&eacute;cifique du menu Signets ou pour indiquer un nom ou une URL sp&eacute;cifique pour votre signet :
<ol>
<li>Ouvrez le menu Signets et choisissez Classer un signet. Choisissez parmi les options suivantes :
<ul>
<li><b>Nom</b> : Tapez un nom pour le signet si vous souhaitez un nom diff&eacute;rent.</li>
<li><b>Adresse&nbsp;</b>: Tapez une URL pour le signet si vous souhaitez une URL diff&eacute;rente.</li>
<li><b>Cr&eacute;er dans </b>: Choisissez un dossier dans lequel cr&eacute;er votre signet.</li>
<li><b>Nouveau dossier</b> &nbsp;: Cliquez sur ce bouton pour cr&eacute;er un nouveau dossier dans lequel placer votre signet.</li>
<li><b>Utiliser d&eacute;faut </b>: Cliquez sur ce bouton pour classer le signet dans le dossier d&eacute;sign&eacute; pour les nouveaux signets.</li>
</ul>
</li>
<li>Cliquez sur OK pour ajouter le signet.</li>
</ol>
<p><b>Astuce&nbsp;</b>: Si plusieurs onglets de Navigator sont ouverts dans une fen&ecirc;tre, vous pouvez s&eacute;lectionner l'option "Bookmark this group of tabs" afin d'ajouter un onglet collectif qui ouvrira tous les onglets affich&eacute;s dans la fen&ecirc;tre actuelle.<br>
</p>
</li>
<li>Pour ajouter un signet &agrave; la barre d'outils personnelle, faites glisser l'ic&ocirc;ne du signet <img src="chrome://communicator/skin/bookmarks/bookmark-item.gif" alt="image de l'ic&ocirc;ne de signet" > &agrave; c&ocirc;t&eacute; de la barre d'adresses vers un emplacement sur la barre d'outils personnelle. Vous pouvez d&eacute;placer un onglet dans les emplacements suivants&nbsp;:
<ul>
<li>Dans le dossier Signets de la barre d'outils personnelle.</li>
<li>Dans un dossier de signets que vous avez cr&eacute;&eacute; dans la barre d'outils personnelle.</li>
<li>Dans la barre d'outils personnelle proprement dite, &agrave; droite de tous les dossiers de signets.</li>
</ul>
<p>Pour plus d'informations sur l'ajout de signets &agrave; la barre d'outils personnelle, consultez la rubrique "<a href="#Adding_Personal_Toolbar_bookmarks">Ajout de signets &agrave; la barre d'outils personnelle</a>". </p>
</li>
</ul>
<table summary="image table">
<tr>
<td><img src="images/personalbar.gif" alt="Barre d'outils personnelle"></td>
</tr>
<tr>
<td> <div align="center"><b>Barre d'outils personnelle</b></div>
</td>
</tr>
</table>
<ul>
<li>Pour ajouter un signet &agrave; l'onglet Signets de Ma barre lat&eacute;rale, ouvrez cette derni&egrave;re, s&eacute;lectionnez l'onglet Signets et faites glisser l'ic&ocirc;ne de signet <img src="chrome://communicator/skin/bookmarks/bookmark-item.gif" alt="image de l'ic&ocirc;ne de signet" > &agrave; c&ocirc;t&eacute; de la barre d'adresses vers un emplacement de la liste de l'onglet Signets.
</li>
</ul>
<p><b>Remarques</b>&nbsp;:</p>
<ul>
<li>Il est possible que l'ic&ocirc;ne de signet <img src="chrome://communicator/skin/bookmarks/bookmark-item.gif" alt="image de l'ic&ocirc;ne de signet" > apparaisse sous la forme d'une autre ic&ocirc;ne de page si vous avez s&eacute;lectionn&eacute; l'option Afficher les ic&ocirc;nes de site Web dans les pr&eacute;f&eacute;rences. Pour plus d'informations sur la modification de ces pr&eacute;f&eacute;rences, consultez la rubrique <a href="cs_nav_prefs_appearance.html#appearance">Pr&eacute;f&eacute;rences d'aspect &ndash; Aspect</a>.</li>
<li>Apr&egrave;s l'ajout d'un signet &agrave; l'aide d'une des m&eacute;thodes &eacute;nonc&eacute;es ci-dessus, il est accessible par l'onglet Signets de Ma barre lat&eacute;rale, la fen&ecirc;tre G&eacute;rer les signets et le menu Signets.</li>
</ul>
<p>[&nbsp;<A HREF="#cust_bkmk">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="bookmarks:organizing_bookmarksIDX"></a> <a name="delete_bookmarkSDX"></a> <a name="move_bookmarkSDX"></a> <a name="remove_bookmarkSDX"></a> <a NAME="cust_bkmk_organize"></a>
<h2>Organisation des signets</h2>
<p>Pour organiser les signets, ouvrez le menu Signets et choisissez G&eacute;rer les signets. Effectuez l'une des t&acirc;ches suivantes dans la fen&ecirc;tre G&eacute;rer les signets.</p>
<p><b>Astuce&nbsp;: </b>Vous pouvez ouvrir cette fen&ecirc;tre depuis l'onglet Signets de Ma barre lat&eacute;rale. Cliquez sur G&eacute;rer en haut de l'onglet Signets.</p>
<p>Pour afficher les signets contenus dans des dossiers&nbsp;:</p>
<ul>
<li>Double-cliquez sur un dossier pour en afficher le contenu.
</ul>
<p>Pour d&eacute;placer un signet ou un dossier dans la liste&nbsp;:</p>
<ul>
<li>Faites glisser le signet ou dossier &agrave; d&eacute;placer vers son nouvel emplacement. Pour placer un signet dans un dossier, faites-le glisser.
</ul>
<p>Pour cr&eacute;er un dossier ou s&eacute;parateur&nbsp;:</p>
<ul>
<li>Cliquez sur Nouveau dossier ou Nouveau s&eacute;parateur dans la partie sup&eacute;rieure de la fen&ecirc;tre Signets. Le nouveau dossier ou s&eacute;parateur appara&icirc;t sous la s&eacute;lection en cours.
</ul>
<p>Pour supprimer un signet ou un dossier de la liste&nbsp;:</p>
<ol>
<li>S&eacute;lectionnez le signet ou le dossier &agrave; supprimer.
<li>Appuyez sur la touche Suppr du clavier ou cliquez sur Supprimer dans la fen&ecirc;tre Signets.
</ol>
<p>Pour trier vos signets dans la fen&ecirc;tre de gestion des signets&nbsp;:</p>
<ul>
<li>Ouvrez le menu Afficher et s&eacute;lectionnez la m&eacute;thode de tri (comme Trier par nom ou Trier par adresse).<br> <b>Astuce&nbsp;</b>: Pour ajouter des colonnes, ouvrez le menu Afficher, s&eacute;lectionnez "Afficher les colonnes", puis cliquez sur un en-t&ecirc;te de colonne dans la liste.</li>
</ul>
<p><br></p>
<h4>D&eacute;signation d'un nouveau dossier de signets</h4>
<p>Lorsque vous cr&eacute;ez un signet, Netscape l'ajoute normalement au bas de la liste des signets. Si vous pr&eacute;f&eacute;rez placer les signets dans un dossier, vous pouvez d&eacute;signer un nouveau dossier de signets.</p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.
<li>Dans la fen&ecirc;tre Signets, s&eacute;lectionnez un dossier dans lequel placer les nouveaux signets.
<li>Ouvrez le menu Afficher et s&eacute;lectionnez Ajouter les nouveaux signets dans ce dossier.
</ol>
<p> [&nbsp;<A HREF="#cust_bkmk">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="editing_bookmarksSDX"></a> <a name="bookmark_propertiesSDX"></a> <a name="bookmarks:changing_bookmarksIDX"></a> <a NAME="cust_bkmk_change"></a>
<h2>Modification de signets</h2>
<p>Vous pouvez modifier les informations de tous les signets.</p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.</li>
<li>Dans la fen&ecirc;tre Signets, cliquez sur un signet.</li>
<li>Cliquez sur Propri&eacute;t&eacute;s.</li>
<li>Dans la fen&ecirc;tre Propri&eacute;t&eacute;s du signet, cliquez sur l'onglet Informations.</li>
</ol>
<p>Vous pouvez renommer le signet (le nom s'affiche dans la liste des signets), ajouter des informations descriptives ou d&eacute;finir un mot-cl&eacute;. Le mot-cl&eacute; d'un signet peut &ecirc;tre entr&eacute; dans la barre d'adresses pour passer au site correspondant.
<p>Vous pouvez &eacute;galement configurer Netscape de fa&ccedil;on &agrave; r&eacute;actualiser les sites Web pour lesquels un signet est d&eacute;fini.</p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.</li>
<li>Dans la fen&ecirc;tre Signets, cliquez sur un signet.</li>
<li>Cliquez sur Propri&eacute;t&eacute;s.</li>
<li>Dans la fen&ecirc;tre Propri&eacute;t&eacute;s du signet, cliquez sur l'onglet Planifier.</li>
<li>Utilisez les listes d&eacute;roulantes pour sp&eacute;cifier la fr&eacute;quence de recherche de mises &agrave; jour de page marqu&eacute;e par Netscape.</li>
<li>Pour &ecirc;tre inform&eacute; de la mise &agrave; jour d'une page r&eacute;f&eacute;renc&eacute;e, cliquez sur l'onglet Notifier et s&eacute;lectionnez une option de notification.</li>
</ol>
<p> [&nbsp;<A HREF="#cust_bkmk">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="bookmarks:searching_bookmarksIDX"></a> <a NAME="cust_bkmk_search"></a>
<h2>Recherche dans les signets</h2>
<p>Pour rechercher dans la liste des signets :</p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.
<li>Dans la fen&ecirc;tre Signets, ouvrez le menu Outils et s&eacute;lectionnez Rechercher des signets. La bo&icirc;te de dialogue Rechercher les signets s'affiche.</li>
<li>Dans les listes d&eacute;roulantes, s&eacute;lectionnez les options de d&eacute;finition de la recherche et cliquez sur Rechercher. Les signets correspondant aux crit&egrave;res de recherche s'affichent. Choisissez parmi les options de recherche suivantes&nbsp;:
<ul>
<li>S&eacute;lectionnez "contient", "commence par" ou "finit par" si vous ne connaissez qu'une partie du mot ou de la phrase recherch&eacute;e.
<li>S&eacute;lectionnez "est" si vous savez exactement ce que vous recherchez.
<li>S&eacute;lectionnez "n'est pas" ou "ne contient pas" pour exclure des pages.</li>
<li>Cliquez dans la zone de saisie et entrez l'URL (adresse Web) ou le nom, partiel ou complet, des signets ou historiques &agrave; rechercher ou exclure.</li>
<li>Cochez la case "Enregistrer la requ&ecirc;te dans les signets" pour enregistrer cette recherche en vue d'une utilisation ult&eacute;rieure. </li>
</ul>
<li>Double-cliquez sur un signet de la liste pour acc&eacute;der &agrave; cette page.</li>
</ol>
<p><b>Astuce&nbsp;</b>: Si la liste est difficile &agrave; lire, essayez d'agrandir la fen&ecirc;tre des r&eacute;sultats de recherche. </p>
<p> [&nbsp;<A HREF="#cust_bkmk">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="bookmarks:exporting_bookmarksIDX"></a> <a name="bookmarks:importing_bookmarksIDX"></a> <a NAME="cust_bkmk_multiple"></a>
<h2>Exportation ou importation d'une liste de signets</h2>
<p>Vos signets sont stock&eacute;s dans le fichier bookmarks.html. Vous pouvez exporter une copie de ce fichier et l'enregistrer dans un dossier de votre choix. Vous pouvez ensuite le modifier et le traiter comme n'importe quel fichier HTML.</p>
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.
<li>Dans la fen&ecirc;tre Signets, ouvrez le menu Outils et choisissez Exporter.
<li>Dans la bo&icirc;te de dialogue "Exporter fichier de signets", choisissez un dossier. Le fichier bookmarks.html sera copi&eacute; dans le dossier de votre choix.
<li>Cliquez sur Enregistrer.
</ol>
<p>Vos signets Netscape ne sont pas alt&eacute;r&eacute;s par cette proc&eacute;dure.
<p>Vous pouvez &eacute;galement importer des fichiers de signets &agrave; partir d'autres sources. Par exemple, il est possible d'importer des fichiers de signets &agrave; partir de versions ant&eacute;rieures de Netscape, d'autres navigateurs ou de fichiers de signets envoy&eacute;s par vos amis.
<p>Avant de commencer, assurez-vous que le fichier de signets &agrave; importer est au format HTML.
<ol>
<li>Ouvrez le menu Signets et choisissez G&eacute;rer les signets.
<li>Dans la fen&ecirc;tre Signets, ouvrez le menu Outils et choisissez Importer.
<li>Dans la bo&icirc;te de dialogue "Importer fichier de signets", recherchez et s&eacute;lectionnez le fichier de signets &agrave; importer.
<li>Cliquez sur Enregistrer.
</ol>
<p>Le fichier de signets import&eacute; est trait&eacute; comme un groupe de nouveaux signets et ajout&eacute; au bas de la liste des signets. Si vous avez d&eacute;sign&eacute; un nouveau dossier de signets, les signets import&eacute;s y sont plac&eacute;s.
<p><b>Remarque</b>&nbsp;: L'importation d'un fichier de signets entra&icirc;ne l'importation des signets et des dossiers qu'il contient. Elle ne cr&eacute;e pas deux fichiers de signets.
<p>[&nbsp;<A HREF="#cust_bkmk">Retour au d&eacute;but de la section</A>&nbsp;]
<p>&nbsp;</p>

<hr> <a NAME="cust_page"></a>
<h1>Sp&eacute;cification du mode de d&eacute;marrage de Netscape</h1>
<p>&nbsp;</p>
<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#cust_startpage">Sp&eacute;cification d'une page d'accueil</a></p>
<p><a href="#cust_home">Modification de votre page d'accueil</a></p>
<p><a href="#cust_start">Sp&eacute;cification des composants &agrave; ouvrir au lancement</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p> <a name="start_pageSDX"></a> <a name="Navigator:start_pageIDX"></a> <a name="browser:start_pageIDX"></a> <a NAME="cust_startpage"></a>
<h2>Sp&eacute;cification d'une page d'accueil</h2>
<p>Il est possible de pr&eacute;ciser la page qui doit se charger au d&eacute;marrage du navigateur.</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.
<li>Dans "Navigator d&eacute;marre avec", indiquez si vous souhaitez l'affichage automatique d'une page vierge, de la page d'accueil ou de la derni&egrave;re page consult&eacute;e au d&eacute;marrage du navigateur.
<p><b>Remarque</b>&nbsp;: Si vous avez s&eacute;lectionn&eacute; Page d'accueil, entrez l'URL dans le champ Adresse.<br>
</p>
</ol>
<p> [&nbsp;<A HREF="#cust_page">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="Navigator:changing_your_home_pageIDX"></a> <a name="browser:changing_your_home_pageIDX"></a> <a NAME="cust_home"></a>
<h2>Modification de votre page d'accueil</h2>
<p>La page d'accueil est la page qui s'ouvre lorsque vous cliquez sur le bouton Page d'accueil de la barre d'outils personnelle. Selon les pr&eacute;f&eacute;rences d&eacute;finies, il peut &eacute;galement s'agir de la page s'ouvrant automatiquement au d&eacute;marrage de Netscape.</p>
<p>Pour sp&eacute;cifier la page d'accueil&nbsp;:</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.
<li>Cliquez sur la cat&eacute;gorie Navigator.
<li>Dans la section Page d'accueil, effectuez l'une des op&eacute;rations suivantes :
<ul>
<li>Entrez l'URL (adresse Web) de votre page d'accueil dans la zone Adresse.
<li>Cliquez sur Utiliser la page courante pour utiliser la page affich&eacute;e dans la fen&ecirc;tre du navigateur comme page d'accueil.
<li>Cliquez sur Choisir le fichier pour s&eacute;lectionner un fichier sur votre disque dur.
</ul>
</ol>
<p><b>Astuce&nbsp;</b>: Pour sp&eacute;cifier rapidement votre page d'accueil, faites glisser l'ic&ocirc;ne de signet <img src="chrome://communicator/skin/bookmarks/bookmark-item.gif" alt="image de l'ic&ocirc;ne de signet" > de la barre d'adresses vers le bouton Page d'accueil de la barre d'outils personnelle.</p>
<p> [&nbsp;<A HREF="#cust_page">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p> <a name="browser:start_up_componentsIDX"></a> <a name="Netscape:componentsIDX"></a> <a NAME="cust_start"></a>
<h2>Sp&eacute;cification des composants &agrave; ouvrir au lancement</h2>
<p>Vous pouvez choisir les composants &agrave; ouvrir (Messagerie &amp; Forum, Composer, etc.) au d&eacute;marrage de Netscape&nbsp;:</p>


<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences. </li>
<li> Cliquez sur la cat&eacute;gorie Aspect. </li>
<li> S&eacute;lectionnez les composants &agrave; ouvrir automatiquement &agrave; chaque d&eacute;marrage de Netscape.</li>
</ol>
<p> [&nbsp;<A HREF="#cust_page">Retour au d&eacute;but de la section</A>&nbsp;] </p>
<p>&nbsp;</p>
<p>
<hr>
<p><i> 19 juin 2002</i>
<hr>
<p><br></p>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation. </p>
</body>
</html>
