<html><head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Glossaire</title> <link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</HEAD>
<body> <div class="boilerplate">Ce glossaire est donn&eacute; &agrave; titre purement informatif. Il ne doit pas &ecirc;tre consid&eacute;r&eacute; comme une description exhaustive et officielle des termes d&eacute;finis ci-dessous, ou des ramifications, sur le plan de la s&eacute;curit&eacute; et/ou de la confidentialit&eacute; des technologies d&eacute;crites.</div>
<hr><h1><A NAME="glossary"></A><A NAME="996904"> Glossaire </A></h1>
<P>
<A NAME="CA"></A><A NAME="1021395"> <B>AC.</B>&nbsp; </A><A NAME="1021418"></A> Voir <a href="glossary.html#1020903">autorit&eacute; de certification (AC)</a>.<P>
<p><a name="implicit_consent"></a><b>accord implicite.</b>&nbsp; Terme utilis&eacute; pour d&eacute;crire les param&egrave;tres de confidentialit&eacute; susceptibles d'autoriser des sites Web &agrave; rassembler des informations &agrave; votre sujet (par le biais de <a href="#cookie">cookies</a> et de formulaires en ligne, par exemple), &agrave; moins que vous ne d&eacute;cidiez de ne pas donner votre accord en s&eacute;lectionnant l'option appropri&eacute;e propos&eacute;e par le site Web. Il se peut que votre accord ne vous soit pas demand&eacute; lors du rassemblement effectif des informations.<p>
<p><a name=" Internet_protocol_address_(IP address)"></a> <b>Adresse IP (Internet Protocol).</b>&nbsp;Adresse d'un ordinateur sur un r&eacute;seau <a href="#Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)">TCP/IP</a>. Chaque ordinateur du r&eacute;seau Internet poss&egrave;de une adresse IP. Les <a href="#client">clients</a> poss&egrave;dent soit une adresse&nbsp;IP permanente, soit une adresse attribu&eacute;e de mani&egrave;re dynamique &agrave; chaque fois qu'ils se connectent au r&eacute;seau. Les adresses&nbsp;IP se composent de quatre nombres entiers s&eacute;par&eacute;s par des points. Exemple&nbsp;: 204.171.64.2.
<A NAME="talkbackSDX"></A> <A NAME="talkbackIDX"></A> <A NAME="netscape_talkback"></A> <B>Agent Contr&ocirc;le qualit&eacute; Netscape.</B>&nbsp; Petit logiciel incorpor&eacute; dans Netscape 7.0 qui rassemble des informations techniques lorsque le programme se ferme inopin&eacute;ment. Cet agent transmet ensuite ces informations &agrave; Netscape apr&egrave;s vous en avoir demand&eacute; la permission. Si vous donnez votre accord, vous contribuez &agrave; enrichir la base d'informations relatives aux probl&egrave;mes ayant entra&icirc;n&eacute; le blocage du programme. Netscape utilise ces commentaires pour corriger les bogues et am&eacute;liorer les performances du programme. L'agent et les services connexes sont parfois d&eacute;sign&eacute;s sous le nom de "talkbalk". Pour plus d'informations, consultez la documentation en ligne <a href="http://help.netscape.com/netscape7/qfs3.html" target="_blank">Syst&egrave;me de contr&ocirc;le qualit&eacute; pour Netscape</a>.<P>
<A NAME="cryptographic_algorithm"></A><A NAME="1019976"> <B>algorithme cryptographique.</B>&nbsp; </A><A NAME="1019985"></A> Ensemble de r&egrave;gles ou directives utilis&eacute;es pour effectuer des op&eacute;rations cryptographiques telles que le <a href="glossary.htm#999078">chiffrement</a> et le <a href="glossary.htm#998999">d&eacute;chiffrement</a>. Parfois appel&eacute; <I>code.</I><P>
<p><a name="helper_application"></a> <b>application auxiliaire.</b>&nbsp;Toute application utilis&eacute;e pour ouvrir ou visualiser un fichier t&eacute;l&eacute;charg&eacute; par le navigateur. Un <a href="#plug-in">module externe</a> est un type particulier d'application auxiliaire qui s'installe dans le sous-dossier Plugins du r&eacute;pertoire principal du navigateur. En r&egrave;gle g&eacute;n&eacute;rale, ce module externe peut &ecirc;tre ouvert directement dans le navigateur (en interne). Microsoft Word, Adobe Photoshop et d'autres applications externes sont consid&eacute;r&eacute;es comme des applications auxiliaires, mais pas comme des modules externes, car elles ne s'installent pas dans le r&eacute;pertoire du navigateur, mais peuvent &ecirc;tre ouvertes &agrave; partir de la bo&icirc;te de dialogue de t&eacute;l&eacute;chargement.
<A NAME="certificate-based_authentication"></A><A NAME="1018581"> <B>authentification bas&eacute;e sur un certificat.</B>&nbsp; </A><A NAME="1018582"></A> V&eacute;rification de l'identit&eacute; bas&eacute;e sur des certificats et une cryptographie &agrave; cl&eacute; publique. Voir aussi <a href="glossary.html#1014123">authentification bas&eacute;e sur un mot de passe</a>.<P>
<A NAME="client_authentication"></A><A NAME="1021054"> <B>authentification client.</B>&nbsp; </A><A NAME="1014557"></A> Processus d'identification d'un <a href="glossary.html#1029510">client</a> &agrave; un <a href="glossary.htm#1029749">serveur</a>, par exemple avec un nom et un mot de passe ou un <a href="glossary.htm#1014561">certificat SSL client</a> et des donn&eacute;es num&eacute;riquement sign&eacute;es. Voir aussi <a href="glossary.html#999463">SSL (Secure Sockets Layer)</a>, <a href="glossary.html#1031070">serveur d'authentification</a>.<P>
<A NAME="password-based_authentication"></A><A NAME="1014123"> <B>authentification par mot de passe.</B>&nbsp; </A><A NAME="1014124"></A> Identification certaine &agrave; l'aide d'un nom et d'un mot de passe. Voir aussi <a href="glossary.html#998782">authentification</a>.<P>
<A NAME="server_authentication"></A><A NAME="1031070"> <B>authentification serveur.</B>&nbsp; </A><A NAME="1031080"></A> Processus d'identification d'un <a href="glossary.html#1029749">serveur</a> aupr&egrave;s d'un <a href="glossary.html#1029510">client</a> &agrave; l'aide d'un <a href="glossary.html#1029874">certificat serveur SSL</a>. Voir aussi <a href="glossary.html#1021054">authentification client</a>, <a href="glossary.html#999463">SSL (Secure Sockets Layer)</a>.<P>
<p> <A NAME="authentication"></A><A NAME="998782"> <B>authentification</B>&nbsp; </A> Implique g&eacute;n&eacute;ralement l'utilisation d'un mot de passe, d'un certificat, d'un num&eacute;ro d'identification personnel (PIN) ou d'autres informations pour valider l'identit&eacute; sur un r&eacute;seau informatique. Voir aussi <a href="glossary.html#1014123">authentification bas&eacute;e sur un mot de passe</a>, <a href="glossary.html#1018581">authentification bas&eacute;e sur un certificat</a>, <a href="glossary.html#1021054">authentification client</a>, <a href="glossary.html#1031070">authentification serveur</a>.<P>
<A NAME="certificate_authority_(CA)"></A><A NAME="1020903"> <B>autorit&eacute; de certification (AC).</B>&nbsp; </A><A NAME="1020904"></A> Service &eacute;mettant un certificat apr&egrave;s v&eacute;rification de l'identit&eacute; de la personne ou de l'entit&eacute; sur laquelle le certificat doit porter. Une autorit&eacute; de certification renouvelle et r&eacute;voque &eacute;galement les certificats et g&eacute;n&egrave;re une liste de certificats r&eacute;voqu&eacute;s &agrave; intervalles r&eacute;guliers. Les autorit&eacute;s de certification peuvent &ecirc;tre des revendeurs ind&eacute;pendants (comme les autorit&eacute;s de certification &eacute;num&eacute;r&eacute;es &agrave; la section <a href="https://certs.netscape.com/" TARGET="_blank">Certificats clients</a>) ou une personne ou organisation utilisant un logiciel serveur &eacute;metteur de certificats (tel que Mozilla Certificate Management System). Voir aussi <a href="glossary.html#1018895">certificat</a>, <a href="glossary.html#1019940">liste de r&eacute;vocation de certificats (CRL)</a>.<P>
<A NAME="root_CA"></A><A NAME="1015631"> <B>autorit&eacute; de certification principale.</B>&nbsp; </A><A NAME="1015635"></A> <a href="glossary.htm#1020903">Autorit&eacute; de certification (AC)</a> avec un certificat autosign&eacute; au sommet d'une <a href="glossary.htm#1018500">cha&icirc;ne de certificats</a>. Voir aussi <a href="glossary.html#999541">autorit&eacute; de certification subordonn&eacute;e</a>.<P>
<A NAME="subordinate_CA"></A><A NAME="999541"> <B>autorit&eacute; de certification subordonn&eacute;e.</B>&nbsp; </A><A NAME="999591"></A> <a href="glossary.htm#1020903">Autorit&eacute; de certification (AC)</a> dont le certificat est sign&eacute; par une autre autorit&eacute; de certification subordonn&eacute;e ou par l'autorit&eacute; de certification principale. Voir aussi <a href="glossary.html#1018500">cha&icirc;ne de certificats</a>, <a href="glossary.html#1015631">autorit&eacute; de certification principale</a>.<P>
<A NAME="Location_Bar"></A> <B>barre d'adresses.</B>&nbsp; Nom donn&eacute; au champ (et aux boutons associ&eacute;s) situ&eacute; dans la partie sup&eacute;rieure d'une fen&ecirc;tre Navigator et dans lequel vous pouvez entrer une adresse <a href="#Uniform_Resource_Locator_(URL)">URL</a> ou rechercher des termes. Pour plus d'informations, reportez-vous &agrave; la rubrique <a href="nav_help.html#nav_move">D&eacute;placement vers une autre page</a>.<P>
<p><a name="Component_Bar"></a> <b>Barre de composants.</b>&nbsp;Barre d'outils situ&eacute;e au bas de toutes les fen&ecirc;tres Netscape. La barre de composants vous permet de basculer entre les diff&eacute;rents composants de Netscape en cliquant sur les ic&ocirc;nes correspondant &agrave; Navigator, &agrave; Messagerie &amp; Forums, Instant Messenger, etc.
<A NAME="Status_Bar"></A> <B>Barre d'&eacute;tat.</B>&nbsp;Barre d'outils situ&eacute;e au bas de toutes les fen&ecirc;tres Netscape. Les c&ocirc;t&eacute;s gauche et droit de cette barre sont occup&eacute;s, respectivement, par la <a href="#Component_Bar">barre de composants</a> et les ic&ocirc;nes d'&eacute;tat. Dans Navigator, par exemple, elle contient l'<a href="using_certs_help.html#using_certs_info">ic&ocirc;ne en forme de cadenas</a>.<P>
<A NAME="navigation_toolbar"></A> <B>barre d'outils de navigation.</B>&nbsp; Barre d'outils situ&eacute;e dans la partie sup&eacute;rieure de la fen&ecirc;tre du navigateur et o&ugrave; figurent les boutons Page pr&eacute;c&eacute;dente et Page suivante.<P>
<A NAME="personal_toolbar"></A> <B>barre d'outils personnelle.</B>&nbsp; Barre d'outils personnalisable qui, par d&eacute;faut, s'affiche directement sous la barre d'adresses de Navigator. Elle contient des boutons standard, tels que Accueil, Recherche, Signets, etc., que vous &ecirc;tes libre d'ajouter ou de supprimer. Vous pouvez &eacute;galement ajouter des boutons pour vos signets favoris ou des dossiers contenant des groupes de signets. Pour plus d'informations, consultez la rubrique <a href="customize_help.html#cust_personal">Barre d'outils personnelle</a>.<P>
<p><a name="cache"></a> <b>cache.</b>&nbsp;Ensemble de copies de pages Web stock&eacute;es sur le disque dur de l'ordinateur ou dans sa m&eacute;moire vive (RAM). La navigateur rassemble ces copies lorsque vous surfez sur le Web. Lorsque vous cliquez sur un lien ou entrez une <a href="#Uniform_Resource_Locator_(URL)">URL</a> afin de r&eacute;cup&eacute;rer une page Web donn&eacute;e pour laquelle le cache contient d&eacute;j&agrave; une copie, le navigateur compare la copie mise en m&eacute;moire cache &agrave; l'original. Si aucune modification n'est intervenue, le navigateur utilise la copie en m&eacute;moire cache plut&ocirc;t que de r&eacute;cup&eacute;rer de nouveau l'original, ce qui se traduit par un gain de temps au niveau du traitement et du t&eacute;l&eacute;chargement. <p>
<p><a name="Netscape_CalendarSDX"></a>
<p><a name="calendarIDX"></a>
<p><a name="scheduling_meetingsSDX"></a>
<p><a name="scheduling_appointmentsSDX"></a>
<p><a name="Calendar"></a> <b>Calendar.</b>&nbsp;Application qui vous permet de g&eacute;rer votre agenda et les t&acirc;ches associ&eacute;es. Si vous utilisez Netscape sur votre lieu de travail, il est possible que cette application soit disponible &agrave; partir du menu Fen&ecirc;tre de Netscape. Si vous utilisez Netscape &agrave; la maison ou si votre entreprise ne dispose pas de Netscape Calendar, vous pouvez utiliser le calendrier Web &agrave; l'adresse <tt><a href="http://www.netscape.com" target="_blank">www.netscape.com</a></tt>.<p>
<A NAME="smart_card"></A><A NAME="1027625"> <B>carte &agrave; puce.</B>&nbsp; </A><A NAME="1027626"></A> Petit p&eacute;riph&eacute;rique, g&eacute;n&eacute;ralement de la taille d'une carte de cr&eacute;dit, contenant un microprocesseur et capable de stocker des informations cryptographiques (telles que cl&eacute;s et certificats) et d'effectuer des op&eacute;rations cryptographiques. Les cartes &agrave; puce utilisent la norme <a href="glossary.html#1025194">PKCS #11</a>. Une carte &agrave; puce constitue un exemple de <a href="glossary.html#1028962">dispositif de s&eacute;curit&eacute;</a>. <P>
<A NAME="client_SSL_certificate"></A><A NAME="1014561"> <B>certificat client SSL.</B>&nbsp; </A><A NAME="1014562"></A> Certificat pr&eacute;sent&eacute; par un <a href="glossary.html#1029510">client</a> (par exemple, un logiciel de navigateur tel que Netscape Communicator) &agrave; un <a href="glossary.htm#1029749">serveur</a> pour authentifier l'identit&eacute; du client (ou celle de la personne utilisant le client) utilisant le protocole <a href="glossary.htm#999463">SSL (Secure Sockets Layer)</a>. Voir aussi <a href="glossary.html#1021054">authentification client</a>.<P>
<A NAME="CA_certificate"></A><A NAME="1017503"> <B>certificat d'autorit&eacute; de certification.</B>&nbsp; </A><A NAME="1017507"></A> Certificat identifiant une autorit&eacute; de certification. Voir aussi <a href="glossary.html#1020903">autorit&eacute; de certification (AC)</a>, <a href="glossary.html#999541">autorit&eacute; de certification subordonn&eacute;e</a>, <a href="glossary.html#1015631">autorit&eacute; de certification principale</a>.<P>
<A NAME="encryption_certificate"></A><A NAME="1024953"> <B>certificat de chiffrement.</B>&nbsp; </A><A NAME="1024978"></A> Certificat dont la cl&eacute; publique correspond &agrave; une cl&eacute; priv&eacute;e utilis&eacute;e pour le chiffrement uniquement. Les certificats de chiffrement ne sont pas utilis&eacute;s pour les op&eacute;rations de signature. Voir aussi <a href="glossary.html#1020489">doubles bicl&eacute;s</a>, <a href="glossary.html#999493">certificat de signature</a>.<P>
<A NAME="security_certificate"></A><A NAME="1028900"> <B>certificat de s&eacute;curit&eacute;.</B>&nbsp;</A><A NAME="1028904"></A> Voir <a href="glossary.html#1018895">certificat</a>.<P>
<A NAME="object-signing certificate"></A><A NAME="1014097"> <B>certificat de signature d'objets.</B>&nbsp; </A><A NAME="1014098"></A> Certificat dont la cl&eacute; priv&eacute;e correspondante est utilis&eacute;e pour signer des objets tels que des fichiers de code. Voir aussi <a href="glossary.html#1014095">signature d'objets</a>.<P>
<A NAME="signing_certificate"></A><A NAME="999493"> <B>certificat de signature.</B>&nbsp; </A><A NAME="999507"></A> Certificat dont la <a href="glossary.htm#1015387">cl&eacute; priv&eacute;e</a> correspondante est utilis&eacute;e pour signer les donn&eacute;es transmises, de sorte que le destinataire puisse v&eacute;rifier l'identit&eacute; de l'exp&eacute;diteur. Les autorit&eacute;s de certification (AC) &eacute;mettent fr&eacute;quemment un certificat de signature utilis&eacute; pour signer des messages &eacute;lectroniques ainsi qu'un <a href="glossary.html#1024953">certificat de chiffrement</a> utilis&eacute; pour chiffrer les messages &eacute;lectroniques. Voir aussi <a href="glossary.html#1020489">doubles bicl&eacute;s</a>, <a href="glossary.html#1013995">signature num&eacute;rique</a>.<P>
<A NAME="server_SSL_certificate"></A><A NAME="1029874"> <B>certificat serveur SSL.</B>&nbsp; </A><A NAME="999500"></A> Certificat pr&eacute;sent&eacute; par un <a href="glossary.html#1029749">serveur</a> &agrave; un <a href="glossary.htm#1029510">client</a> pour authentifier l'identit&eacute; du serveur &agrave; l'aide du protocole <a href="glossary.htm#999463">SSL (Secure Sockets Layer)</a>.<P>
<A NAME="certificate"></A><A NAME="1018895"> <B>certificat.</B>&nbsp; </A><A NAME="1018896"></A> Equivalent num&eacute;rique d'une carte d'identit&eacute;. Un certificat sp&eacute;cifie le nom d'une personne, soci&eacute;t&eacute; ou autre entit&eacute; et certifie qu'une cl&eacute; publique, incluse dans le certificat, lui appartient. Lorsque vous signez num&eacute;riquement un message ou d'autres donn&eacute;es, la signature num&eacute;rique est cr&eacute;&eacute;e &agrave; l'aide de la cl&eacute; priv&eacute;e correspondant &agrave; la cl&eacute; publique du certificat. Un certificat est &eacute;mis et num&eacute;riquement sign&eacute; par une <a href="glossary.html#1020903">autorit&eacute; de certification (AC)</a>. La validit&eacute; d'un certificat peut &ecirc;tre v&eacute;rifi&eacute;e &agrave; l'aide de la <a href="glossary.html#1013995">signature num&eacute;rique</a> de l'autorit&eacute; de certification. Egalement appel&eacute; ID num&eacute;rique, passeport num&eacute;rique, certificat &agrave; cl&eacute; publique, certificat X.509 et certificat de s&eacute;curit&eacute;. Voir aussi <a href="glossary.html#1019178">cryptographie &agrave; cl&eacute; publique</a>.<P>
<A NAME="certificate_chain"></A><A NAME="1018500"> <B>cha&icirc;ne de certificats.</B>&nbsp; </A><A NAME="1019929"></A> S&eacute;rie hi&eacute;rarchique de certificats sign&eacute;s par des autorit&eacute;s de certification successives. Un certificat d'autorit&eacute; de certification identifie une <a href="glossary.html#1020903">autorit&eacute; de certification (AC)</a> et est utilis&eacute; pour signer les certificats &eacute;mis par cette autorit&eacute;. Un certificat d'autorit&eacute; de certification peut &agrave; son tour &ecirc;tre sign&eacute; par celui d'une autorit&eacute; de certification parente et ainsi de suite jusqu'&agrave; une <a href="glossary.html#1015631">autorit&eacute; de certification principale</a>. <P>
<A NAME="symmetric_encryption"></A><A NAME="999604"> <B>chiffrement sym&eacute;trique.</B>&nbsp; </A><A NAME="999625"></A> M&eacute;thode de chiffrement utilisant une seule cl&eacute; cryptographique pour chiffrer et d&eacute;chiffrer un message donn&eacute;.<P>
<A NAME="encryption"></A><A NAME="999078"> <B>chiffrement.</B>&nbsp; </A><A NAME="1024038"></A> Processus de cryptage d'informations de fa&ccedil;on &agrave; masquer leur signification. Par exemple, les connexions crypt&eacute;es entre ordinateurs rendent tr&egrave;s difficile le d&eacute;chiffrement ou <I>d&eacute;cryptage</I> des informations transmises sur la connexion par des tiers. Les informations chiffr&eacute;es ne peuvent &ecirc;tre d&eacute;chiffr&eacute;es que par une personne poss&eacute;dant la cl&eacute; appropri&eacute;e. Voir aussi <a href="glossary.html#1019178">cryptographie &agrave; cl&eacute; publique</a>.<P>
<A NAME="encryption_key"></A><A NAME="1021254"> <B>cl&eacute; de chiffrement.</B>&nbsp; </A><A NAME="1021255"></A> Cl&eacute; priv&eacute;e utilis&eacute;e pour le chiffrement uniquement. Une cl&eacute; de chiffrement et sa cl&eacute; publique &eacute;quivalente, plus une <a href="glossary.html#1021282">cl&eacute; de signature</a> et sa cl&eacute; publique &eacute;quivalente, constituent une <a href="glossary.html#1020489">double bicl&eacute;</a>.<P>
<A NAME="signing_key"></A><A NAME="1021282"> <B>cl&eacute; de signature.</B>&nbsp; </A><A NAME="1021283"></A> Cl&eacute; priv&eacute;e utilis&eacute;e pour la signature uniquement. Une cl&eacute; de signature et sa cl&eacute; publique &eacute;quivalente, plus une <a href="glossary.htm#1021282">cl&eacute; de chiffrement</a> et sa cl&eacute; publique &eacute;quivalente, constituent une <a href="glossary.html#1020489">double bicl&eacute;</a>.<P>
<A NAME="master_key"></A><A NAME="1032598"> <B>cl&eacute; principale.</B>&nbsp; </A><A NAME="1032639"></A> Cl&eacute; sym&eacute;trique utilis&eacute;e par le Gestionnaire de certificats pour chiffrer des informations. Par exemple, le Gestionnaire de mots de passe utilise le Gestionnaire de certificats et votre cl&eacute; principale pour chiffrer les mots de passe de courrier &eacute;lectronique, de sites Web et d'autres informations confidentielles enregistr&eacute;es. Voir aussi <a href="glossary.html#999604">chiffrement sym&eacute;trique</a>.<P>
<A NAME="private_key"></A><A NAME="1015387"> <B>cl&eacute; priv&eacute;e.</B>&nbsp; </A><A NAME="1015391"></A> El&eacute;ment d'une bi<a href="#key">cl&eacute;</a> utilis&eacute; dans la cryptographie &agrave; cl&eacute; publique. La cl&eacute; priv&eacute;e est gard&eacute;e secr&egrave;te et utilis&eacute;e pour d&eacute;chiffrer des donn&eacute;es chiffr&eacute;es avec la cl&eacute; publique correspondante.<P>
<A NAME="public_key"></A><A NAME="1019172"> <B>cl&eacute; publique.</B>&nbsp; </A><A NAME="1019173"></A> El&eacute;ment d'une bi<a href="#key">cl&eacute;</a> utilis&eacute; dans la cryptographie &agrave; cl&eacute; publique. La cl&eacute; publique est distribu&eacute;e librement et publi&eacute;e dans un <a href="glossary.html#1018895">certificat</a>. Elle est g&eacute;n&eacute;ralement utilis&eacute;e pour chiffrer les donn&eacute;es envoy&eacute;es &agrave; son propri&eacute;taire, qui les d&eacute;chiffre avec la cl&eacute; priv&eacute;e correspondante.<P>
<A NAME="key"></A><A NAME="999203"> <B>cl&eacute;.</B>&nbsp; </A><A NAME="999212"></A> Grand nombre utilis&eacute; par un <a href="glossary.htm#1019976">algorithme cryptographique</a> pour chiffrer ou d&eacute;chiffrer des donn&eacute;es. la cl&eacute; publique d'une personne, par exemple, permet d'autres personnes de chiffrer les messages qui lui sont adress&eacute;s. Les messages chiffr&eacute;s doivent &ecirc;tre d&eacute;chiffr&eacute;s avec la cl&eacute; priv&eacute;e correspondante. Voir aussi <a href="glossary.html#1019178">cryptographie &agrave; cl&eacute; publique</a>.<P>
<A NAME="client"></A><A NAME="1029510"> <B>client.</B>&nbsp; </A><A NAME="1029547"></A> Logiciel (comme le logiciel du navigateur) envoyant des requ&ecirc;tes &agrave; un <a href="glossary.htm#1029749">serveur</a>, qui s'ex&eacute;cute g&eacute;n&eacute;ralement sur un autre ordinateur, et en recevant des informations. Un ordinateur ex&eacute;cutant un logiciel client est &eacute;galement appel&eacute; client.<P>
<A NAME="cipher"></A><A NAME="1021048"> <B>code.</B>&nbsp; </A><A NAME="1021052"></A> Voir <a href="glossary.html#1019976">algorithme cryptographique</a>.<P>
<A NAME="trust"></A><A NAME="1019748"></A> <B>confiance.</B>&nbsp; <A NAME="1020186"></A> Consid&eacute;ration d'une personne ou d'une autre entit&eacute; comme fiable. Dans le contexte de l'<a href="glossary.html#999412">infrastructure &agrave; cl&eacute; publique (ICP)</a>, la confiance d&eacute;signe g&eacute;n&eacute;ralement la relation entre l'utilisateur d'un certificat et l'<a href="glossary.html#1020903">autorit&eacute; de certification (AC)</a> qui l'a &eacute;mis. Si vous utilisez le Gestionnaire de certificats pour sp&eacute;cifier que vous faites confiance &agrave; une autorit&eacute; de certification, il fait confiance aux certificats valides &eacute;mis par cette derni&egrave;re sauf sp&eacute;cification contraire dans les param&egrave;tres des diff&eacute;rents certificats. Vous pouvez utiliser l'onglet Autorit&eacute;s du Gestionnaire de certificats pour sp&eacute;cifier les types de certificats pour lesquels vous faites confiance ou non &agrave; des autorit&eacute;s de certification sp&eacute;cifiques. <P>
<p><a name="third-party_cookie"></a> <b>cookie de tiers.</b>&nbsp;Voir <a href="#foreign_cookie">cookie &eacute;tranger</a>.<p>
<p><a name="foreign_cookie"></a> <b>cookie &eacute;tranger.</b>&nbsp;Cookie d'un site qui est stock&eacute; sur votre ordinateur lorsque vous visitez un autre site. Il arrive qu'un site Web affiche du contenu h&eacute;berg&eacute; sur un autre site. Il peut s'agir d'une image, d'un texte ou encore d'une publicit&eacute;. Le site Web qui h&eacute;berge ces &eacute;l&eacute;ments a &eacute;galement la possibilit&eacute; de stocker un cookie dans votre navigateur, m&ecirc;me si vous ne le visitez pas directement. Ce type de cookie est &eacute;galement connu sous le nom de "cookie de tiers". <p>
<p><a name="cookie"></a> <b>cookie.</b>&nbsp;Un cookie est un petit &eacute;l&eacute;ment d'information m&eacute;moris&eacute; sur votre ordinateur par certains sites Web. Lorsque vous visitez un site de ce type, ce dernier peut demander &agrave; votre navigateur de placer un ou plusieurs cookies sur votre disque dur. Lorsque vous revisiterez ce site, le navigateur renverra les cookies qui lui appartiennent. Les cookies aident les sites Web &agrave; g&eacute;rer les informations &agrave; votre sujet, telles que le contenu de votre caddie. Vous pouvez d&eacute;finir vos pr&eacute;f&eacute;rences en mati&egrave;re de cookie afin de contr&ocirc;ler leur utilisation, ainsi que la quantit&eacute; d'informations que vous &ecirc;tes dispos&eacute; &agrave; divulguer aux sites Web. Voir aussi <a href="#foreign_cookie">cookie &eacute;tranger</a>.<p>
<A NAME="public-key_cryptography"></A><A NAME="1019178"> <B>cryptographie &agrave; cl&eacute; publique.</B>&nbsp; </A><A NAME="1023765"></A> Ensemble de techniques et normes &eacute;tablies permettant &agrave; une entit&eacute; (comme une personne, une organisation ou du mat&eacute;riel tel qu'un routeur) de v&eacute;rifier son identit&eacute; &eacute;lectroniquement ou de signer et de chiffrer des donn&eacute;es &eacute;lectroniques. Deux cl&eacute;s sont impliqu&eacute;es&nbsp;: une <a href="glossary.html#1019172">cl&eacute; publique</a> et une <a href="glossary.html#1015387">cl&eacute; priv&eacute;e</a>. La cl&eacute; publique est publi&eacute;e dans un <a href="glossary.html#1018895">certificat</a>, qui l'associe &agrave; une certaine identit&eacute;. La cl&eacute; priv&eacute;e correspondante est gard&eacute;e secr&egrave;te. Les donn&eacute;es chiffr&eacute;es avec la cl&eacute; publique ne peuvent &ecirc;tre d&eacute;chiffr&eacute;es qu'avec la cl&eacute; priv&eacute;e. <P>
<A NAME="cryptography"></A><A NAME="1026002"> <B>cryptographie.</B>&nbsp; </A><A NAME="1026018"></A> Pratique de cryptage (chiffrement) et d&eacute;cryptage (d&eacute;chiffrement) d'informations. Par exemple, les techniques cryptographiques sont utilis&eacute;es pour chiffrer et d&eacute;chiffrer des informations &eacute;chang&eacute;es entre les sites Web commerciaux et votre navigateur. Voir aussi <a href="glossary.html#1019178">cryptographie &agrave; cl&eacute; publique</a>.<P>
<A NAME="decryption"></A><A NAME="998999"> <B>d&eacute;chiffrement.</B>&nbsp; </A><A NAME="999005"></A> Processus de d&eacute;chiffrement de donn&eacute;es crypt&eacute;es. Voir aussi <a href="glossary.html#999078">chiffrement</a>.<P>
<A NAME="tamper_detection"></A><A NAME="999618"> <B>d&eacute;tection de fraude.</B>&nbsp; </A><A NAME="999631"></A> M&eacute;canisme garantissant que les donn&eacute;es re&ccedil;ues sous forme &eacute;lectronique n'ont pas &eacute;t&eacute; falsifi&eacute;es, c'est-&agrave;-dire qu'elles correspondent exactement &agrave; leur version originale.<P>
<A NAME="software_security_device"></A><A NAME="1032045"> <B>dispositif de s&eacute;curit&eacute; logiciel.</B>&nbsp; </A><A NAME="1032110"></A> <a href="#security_device">Dispositif de s&eacute;curit&eacute;</a> par d&eacute;faut utilis&eacute; par le Gestionnaire de certificats pour enregistrer les cl&eacute;s priv&eacute;es associ&eacute;es aux certificats. Outre les cl&eacute;s priv&eacute;es, le dispositif de s&eacute;curit&eacute; logiciel enregistre la cl&eacute; principale utilis&eacute;e par le Gestionnaire de mots de passe pour chiffrer les mots de passe de courrier &eacute;lectronique, de sites Web et d'autres informations confidentielles. Voir aussi <a href="glossary.html#1015387">cl&eacute; priv&eacute;e</a> et <a href="glossary.html#1032598">cl&eacute; principale</a>.<p>
<A NAME="security_device"></A><A NAME="1028962"> <B>dispositif de s&eacute;curit&eacute;.</B>&nbsp; </A><A NAME="1028963"></A> Mat&eacute;riel ou logiciel fournissant des services cryptographiques tels que le chiffrement et le d&eacute;chiffrement et pouvant enregistrer des certificats et des cl&eacute;s. Une carte &agrave; puce constitue un exemple de dispositif de s&eacute;curit&eacute; mise en &oelig;uvre dans du mat&eacute;riel. Le <a href="#Certificate_Manager">Gestionnaire de certificats</a> int&egrave;gre son propre dispositif de s&eacute;curit&eacute;, appel&eacute; le <a href="glossary.html#software_security_device">dispositif de s&eacute;curit&eacute; logiciel</a>, qui est toujours disponible lorsque le navigateur est en cours d'ex&eacute;cution. Chaque dispositif de s&eacute;curit&eacute; est prot&eacute;g&eacute; par un <a href="glossary.html#1032744">mot de passe principal</a>.<P>
<A NAME="dual_key_pairs"></A><A NAME="1020489"> <B>double bicl&eacute;.</B>&nbsp; </A><A NAME="1020619"></A> Deux bicl&eacute;s publiques-priv&eacute;es (un total de quatre cl&eacute;s) correspondant &agrave; deux certificats distincts. La cl&eacute; priv&eacute;e d'une bicl&eacute; est utilis&eacute;e pour les op&eacute;rations de signature et les cl&eacute;s publique et priv&eacute;e de l'autre bicl&eacute; pour les op&eacute;rations de chiffrement et de d&eacute;chiffrement. Chaque bicl&eacute; correspond &agrave; un <a href="glossary.html#1018895">certificat</a>. Voir aussi <a href="glossary.html#1019178">cryptographie &agrave; cl&eacute; publique</a>.<P>
<A NAME="eavesdropping"></A><A NAME="1020620"> <B>&eacute;coute clandestine.</B>&nbsp; </A><A NAME="1013975"></A> Interception clandestine d'informations envoy&eacute;es sur un r&eacute;seau par une entit&eacute; &agrave; laquelle les informations ne sont pas destin&eacute;es.<P>
<A NAME="slot"></A><A NAME="1025218"> <B>emplacement.</B>&nbsp; </A><A NAME="1025222"></A> Mat&eacute;riel, ou logiciel &eacute;quivalent, contr&ocirc;l&eacute; par un <a href="glossary.htm#1025197">module PKCS #11</a> et con&ccedil;u pour contenir un <a href="glossary.htm#1028962">dispositif de s&eacute;curit&eacute;</a>. <P>
<A NAME="fingerprint"></A><A NAME="1020434"> <B>empreinte digitale.</B>&nbsp; </A><A NAME="1020450"></A> Voir <a href="glossary.html#1020297">empreintes digitales du certificat</a>.<P>
<A NAME="certificate_fingerprint"></A><A NAME="1020297"> <B>empreintes digitales du certificat.</B>&nbsp; </A> Num&eacute;ro unique associ&eacute; &agrave; un certificat. Le num&eacute;ro ne fait pas partie du certificat proprement dit mais est produit en appliquant une fonction math&eacute;matique au contenu du certificat. Si le contenu du certificat change, m&ecirc;me d'un seul caract&egrave;re, la fonction produit un num&eacute;ro diff&eacute;rent. Les empreintes du certificat peuvent donc &ecirc;tre utilis&eacute;es pour v&eacute;rifier que les certificats n'ont pas &eacute;t&eacute; trafiqu&eacute;s.<P>
<A NAME="FIPS_PUBS_140-1"></A><A NAME="1025742"> <B>FIPS PUBS 140-1.</B>&nbsp; </A><A NAME="1025743"></A> Federal Information Processing Standards Publications (FIPS PUBS) 140-1 est une norme du gouvernement am&eacute;ricain relative &agrave; la mise en &oelig;uvre de modules cryptographiques, c'est-&agrave;-dire du mat&eacute;riel ou des logiciels chiffrant et d&eacute;chiffrant des donn&eacute;es ou effectuant d'autres op&eacute;rations cryptographiques (comme la cr&eacute;ation ou la v&eacute;rification de signatures num&eacute;riques). De nombreux produits vendus au gouvernement am&eacute;ricain doivent respecter une ou plusieurs des normes FIPS.<P>
<A NAME="Certificate_Manager"></A> <B>Gestionnaire de certificats</B>&nbsp; <A NAME="1020326"></A> Partie du navigateur permettant d'afficher et de g&eacute;rer les certificats. Pour afficher la fen&ecirc;tre principale du Gestionnaire de certificats&nbsp;: Ouvrez le menu Edition, choisissez Pr&eacute;f&eacute;rences, cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute;, puis sur G&eacute;rer les certificats.<P>
<p><a name="Cookie_Manager"></a> <b>Gestionnaire de cookies.</b>&nbsp;Composant du navigateur que vous pouvez utiliser pour contr&ocirc;ler les <a href="#cookie">cookies</a>. Pour plus d'informations, consultez la rubrique <a href="using_priv_help.html">Utilisation du Gestionnaire de cookies</a>. <p>
<p><a name="Form_Manager"></a> <b>Gestionnaire de formulaires.</b>&nbsp;Composant du navigateur qui vous aide &agrave; enregistrer les donn&eacute;es personnelles saisies dans des formulaires en ligne, telles que vos nom, adresse, num&eacute;ro de t&eacute;l&eacute;phone, etc. Ensuite, lorsqu'un site Web affiche un formulaire, le gestionnaire de formulaires peut le remplir automatiquement. Pour plus d'informations, consultez la rubrique <a href="using_priv_help.html#using_forms">Utilisation du Gestionnaire de formulaires</a>. <p>
<p><a name="Password_Manager"></a> <b>Gestionnaire de mots de passe.</b>&nbsp;Composant du navigateur qui peut vous aider &agrave; vous souvenir de certains ou de tous vos noms et mots de passe en les stockant sur le disque dur de votre ordinateur et en les entrant automatiquement lorsque vous visitez les sites Web appropri&eacute;s. Pour plus d'informations, consultez la rubrique <a href="using_priv_help.html#using_password">Utilisation du Gestionnaire de mots de passe</a>. <p>
<p><a name="Hypertext_Markup_Language_(HTML)"></a> <b>HyperText Markup Language (HTML).</b>&nbsp; Format de document utilis&eacute; pour les pages Web. Le standard HTML d&eacute;finit les balises, ou codes, d&eacute;crivant la disposition du texte, les polices, le style, les images et les autres &eacute;l&eacute;ments constitutifs d'une page Web. <p>
<A NAME="digital_ID"></A><A NAME="999011"> <B>ID num&eacute;rique.</B>&nbsp;</A><A NAME="999017"></A> Voir <a href="glossary.html#1018895">certificat</a>.<P>
<p><a NAME="IMAP_glossary"></a> <b>IMAP (Internet Message Access Protocol).</b>&nbsp;Protocole de serveur de messagerie standard qui vous permet de stocker tous vos messages, ainsi que les &eacute;ventuelles modifications qui y sont apport&eacute;es, sur le serveur plut&ocirc;t que sur le disque dur de votre ordinateur. L'utilisation du protocole IMAP plut&ocirc;t que <a href="#POP_glossary">POP</a> permet d'&eacute;conomiser de l'espace disque et d'acc&eacute;der &agrave; tous les messages de votre bo&icirc;te aux lettres (messages envoy&eacute;s, brouillons, dossiers personnalis&eacute;s) &agrave; partir de n'importe quel emplacement. Sur une connexion modem, l'utilisation d'un serveur IMAP se r&eacute;v&egrave;le g&eacute;n&eacute;ralement plus rapide qu'un serveur de messagerie POP, dans la mesure o&ugrave; vous ne t&eacute;l&eacute;chargez, dans un premier temps, que les en-t&ecirc;tes de message. Tous les FAI ne prennent pas en charge les serveurs IMAP. <p>
<A NAME="public-key_infrastructure (PKI)"></A><A NAME="999412"> <B>infrastructure &agrave; cl&eacute; publique (ICP).</B>&nbsp; </A><A NAME="1014263"></A> Normes et services facilitant l'utilisation de la cryptographie &agrave; cl&eacute; publique et des certificats dans un environnement r&eacute;seau.<P>
<p><a name="Internet"></a> <b>Internet.</b>&nbsp;R&eacute;seau mondial compos&eacute; de millions d'ordinateurs qui communiquent entre eux au moyen de protocoles standard, tels que <a href="#Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)">TCP/IP</a>. D&eacute;velopp&eacute; &agrave; l'origine par l'arm&eacute;e am&eacute;ricaine en 1969, Internet s'est rapidement &eacute;tendu pour englober les instituts de recherche et les &eacute;tablissements scolaires. Fin des ann&eacute;es 1990, des millions d'entreprises, d'organisations et d'utilisateurs particuliers rejoignaient, &agrave; leur tour, le r&eacute;seau. De nos jours, Internet est utilis&eacute; pour une foule d'applications&nbsp;: messagerie &eacute;lectronique, navigation sur le <a href="#World_Wide_Web">Web</a>, messagerie instantan&eacute;e, groupes d'utilisateurs…<p>
<p><a name="Java"></a> <b>Java.</b>&nbsp;Langage de programmation d&eacute;velopp&eacute; par Sun Microsystems. Un m&ecirc;me programme Java peut s'ex&eacute;cuter sur plusieurs types d'ordinateurs, ce qui dispense les programmeurs de cr&eacute;er une version diff&eacute;rente de chaque programme pour chaque type de plate-forme. Votre navigateur peut t&eacute;l&eacute;charger et ex&eacute;cuter automatiquement des programmes Java (connus &eacute;galement sous le nom d'applets).<p>
<p><a name="JavaScript"></a> <b>JavaScript.</b>&nbsp;Langage de script utilis&eacute; couramment pour cr&eacute;er des pages Web. Les programmeurs se servent de JavaScript pour rendre les pages Web plus interactives&nbsp;; pour afficher, par exemple, des formulaires et des boutons. Il est possible d'utiliser JavaScript avec Java mais, d'un point de vue technique, il s'agit de deux langages distincts. JavaScript peut parfaitement fonctionner en l'absence du langage Java.<p>
<A NAME="security_token"></A><A NAME="1028905"> <B>jeton de s&eacute;curit&eacute;.</B>&nbsp;</A><A NAME="1028909"></A> Voir <a href="glossary.html#1028962">dispositif de s&eacute;curit&eacute;</a>.<P>
<A NAME="token"></A><A NAME="1024528"> <B>jeton.</B>&nbsp;</A><A NAME="1024586"></A> Voir <a href="glossary.html#1028962">dispositif de s&eacute;curit&eacute;</a>.<P>
<A NAME="certificate_revocation_list_(CRL)"></A><A NAME="1019940"> <B>liste de r&eacute;vocation de certificats (CRL).</B>&nbsp; </A><A NAME="1021047"></A> Liste de certificats r&eacute;voqu&eacute;s g&eacute;n&eacute;r&eacute;e et sign&eacute;e par une <a href="glossary.htm#1020903">autorit&eacute; de certification (AC)</a>. Vous pouvez t&eacute;l&eacute;charger la derni&egrave;re CRL sur votre navigateur ou un serveur puis la comparer &agrave; vos certificats pour vous assurer qu'ils sont toujours valides avant de permettre leur autorisation &agrave; des fins d'authentification. <P>
<A NAME="security_module"></A><A NAME="1029083"> <B>module de s&eacute;curit&eacute;.</B>&nbsp; </A><A NAME="1029097"></A> Voir <a href="glossary.html#1025197">module PKCS #11</a>.<P>
<a name="plug-in"></a> <b>module externe.</b>&nbsp;Type d'<a href="#helper_application">application auxiliaire</a> qui enrichit les fonctionnalit&eacute;s de votre navigateur en lui permettant, par exemple, de lire des s&eacute;quences audio et vid&eacute;o. Contrairement aux autres types d'applications auxiliaires, les modules externes s'installent automatiquement dans le sous-dossier Plugins du r&eacute;pertoire principal du navigateur et peuvent g&eacute;n&eacute;ralement &ecirc;tre ouverts directement dans le navigateur (en interne). A titre d'exemple, un module externe audio vous permet d'&eacute;couter des fichiers audio incorpor&eacute;s dans une page Web ou un message &eacute;lectronique. Macromedia Flash Player et Java sont deux exemples de modules externes.<p>
<A NAME="PKCS_11_module"></A><A NAME="1025197"> <B>module PKCS #11.</B>&nbsp; </A><A NAME="1025271"></A> Programme de votre ordinateur g&eacute;rant les services cryptographiques tels que le chiffrement et le d&eacute;chiffrement &agrave; l'aide de la norme PKCS #11. Egalement appel&eacute;s <I>modules cryptographiques</I>, <I>fournisseurs de services cryptographiques</I> ou <I>modules de s&eacute;curit&eacute;</I>, les modules PKCS #11 contr&ocirc;lent les p&eacute;riph&eacute;riques logiciels ou mat&eacute;riels. Un module PKCS #11 contr&ocirc;le toujours un ou plusieurs emplacements, qui peuvent &ecirc;tre mis en &oelig;uvre sous forme de lecteurs physiques (par exemple, pour les cartes &agrave; puce) ou logiciels. Chaque emplacement d'un module PKCS #11 peut &agrave; son tour contenir un <a href="glossary.html#1028962">dispositif de s&eacute;curit&eacute;</a> (&eacute;galement appel&eacute; <I>jeton</I>)<B>,</B> qui est le p&eacute;riph&eacute;rique logiciel ou mat&eacute;riel fournissant les services cryptographiques et enregistrant les certificats et cl&eacute;s. Le Gestionnaire de certificats int&egrave;gre deux modules PKCS #11. Vous pouvez installer d'autres modules sur l'ordinateur pour contr&ocirc;ler les lecteurs de cartes &agrave; puce et d'autres p&eacute;riph&eacute;riques mat&eacute;riels.<P>
<A NAME="certificate_backup_password"></A><A NAME="1024655"> <B>mot de passe de sauvegarde de certificat.</B>&nbsp; </A><A NAME="1024670"></A> Mot de passe prot&eacute;geant un certificat que vous sauvegardez ou avez pr&eacute;c&eacute;demment sauvegard&eacute;. Le Gestionnaire de certificats vous invite &agrave; d&eacute;finir ce mot de passe lorsque vous sauvegardez un certificat et le demande lorsque vous tentez de restaurer un certificat pr&eacute;c&eacute;demment sauvegard&eacute;. <P>
<A NAME="master_password"></A><A NAME="1032744"> <B>mot de passe principal.</B>&nbsp; </A><A NAME="1032748"></A> Mot de passe utilis&eacute; par le Gestionnaire de certificats pour prot&eacute;ger la cl&eacute; principale et/ou les cl&eacute;s priv&eacute;es enregistr&eacute;es sur un <a href="glossary.htm#1028962">dispositif de s&eacute;curit&eacute;</a>. Le Gestionnaire de certificats doit pouvoir acc&eacute;der aux cl&eacute;s priv&eacute;es, par exemple lorsque vous signez des messages &eacute;lectroniques ou utilisez vos propres certificats pour vous identifier aupr&egrave;s d'un site Web. Il doit acc&eacute;der &agrave; votre cl&eacute; principale lorsque le Gestionnaire de mots de passe ou le Gestionnaire de formulaires lit ou ajoute des informations personnelles. Vous pouvez d&eacute;finir ou changer votre mot de passe principal &agrave; partir du panneau de pr&eacute;f&eacute;rences Mots de passe de s&eacute;curit&eacute; principaux. Chaque dispositif de s&eacute;curit&eacute; n&eacute;cessite un mot de passe principal distinct. Voir aussi <a href="glossary.html#1015387">cl&eacute; priv&eacute;e</a>, <a href="glossary.html#1032598">cl&eacute; principale</a>.<P>
<p><a name="search_engine"></a> <b>moteur de recherche.</b>&nbsp;Programme Web qui permet aux utilisateurs de rechercher des informations sp&eacute;cifiques sur le Web et de les r&eacute;cup&eacute;rer. Le moteur de recherche peut axer sa recherche sur tout le texte des documents Web ou sur une liste de mots, ou bien recourir &agrave; des biblioth&eacute;caires qui analysent les documents Web et les indexent manuellement en vue de leur r&eacute;cup&eacute;ration. En r&egrave;gle g&eacute;n&eacute;rale, l'utilisateur entre un mot ou une expression, appel&eacute; &eacute;galement requ&ecirc;te, dans une zone de recherche, et le moteur de recherche affiche les liens qui pointent vers les pages Web appropri&eacute;es.<p>
<A NAME="spoofing"></A><A NAME="1014366"> <B>mystification.</B>&nbsp; </A><A NAME="1014367"></A> Usurpation d'identit&eacute;. Par exemple, une personne peut faire semblant de disposer de l'adresse &eacute;lectronique <TT>jdupont@mozilla.com</TT> ou un ordinateur peut se pr&eacute;senter faussement comme le site <TT>www.mozilla.com</TT>. La mystification est une forme d'<a href="glossary.html#1014057">usurpation d'identit&eacute;</a>.<P>
<A NAME="subject_name"></A><A NAME="1021328"> <B>nom de sujet.</B>&nbsp; </A><A NAME="1021338"></A> <a href="glossary.htm#1022191">Nom distinctif (ND)</a> d&eacute;crivant de fa&ccedil;on unique le <a href="glossary.htm#1013880">sujet</a> d'un <a href="glossary.htm#1018895">certificat</a>.<P>
<A NAME="distinguished_name_(DN)"></A><A NAME="1022191"> <B>nom distinctif (DN).</B>&nbsp; </A><A NAME="1022194"></A> Nom sp&eacute;cialement format&eacute; identifiant de fa&ccedil;on unique le sujet d'un certificat.<P>
<A NAME="nonrepudiation"></A><A NAME="999248"> <B>non-r&eacute;pudiation.</B>&nbsp; </A><A NAME="999254"></A> Incapacit&eacute;, pour l'exp&eacute;diteur d'un message, de nier son envoi. Une signature manuscrite normale constitue une forme de non-r&eacute;pudiation. Une <a href="glossary.html#1013995">signature num&eacute;rique</a> en est une autre.<P>
<p><a name="p3p"></a> <b>P3P (Platform for Privacy Preferences).</b>&nbsp;Cette norme, &eacute;labor&eacute;e par le World Wide Web Consortium (W3C), est con&ccedil;ue pour aider les utilisateurs &agrave; mieux contr&ocirc;ler l'usage qui est fait de leurs informations par les sites Web visit&eacute;s. Pour plus d'informations sur l'utilisation des cookies avec les sites Web qui prennent en charge cette norme, consultez la rubrique <a href="using_priv_help.html#privacy_levels">D&eacute;finition des niveaux de confidentialit&eacute;</a>. Pour obtenir des informations plus g&eacute;n&eacute;rales sur la norme proprement dite, consultez le document en ligne intitul&eacute; <a href="http://www.w3.org/P3P/" target="_blank">P3P Public Overview</a>.<p>
<p><a name="home_page"></a> <b>page d'accueil.</b>&nbsp;Page d&eacute;finie pour s'afficher &agrave; chaque d&eacute;marrage de votre navigateur ou lorsque vous cliquez sur le bouton Page d'accueil. Ce terme est &eacute;galement utilis&eacute; pour d&eacute;signer la page principale d'un site Web &agrave; partir de laquelle vous pouvez explorer le reste du site.<p>
<p><a name="web_page"></a> <b>page Web.</b>&nbsp;Document disponible sur le Web, d&eacute;sign&eacute; par une adresse ou URL unique, et pouvant contenir du texte, des liens hypertextes et des graphiques.<p>
<A NAME="PKCS_#11"></A><A NAME="1025194"> <B>PKCS #11.</B>&nbsp; </A><A NAME="1025195"></A> Norme de cryptographie &agrave; cl&eacute; publique r&eacute;gissant les dispositifs de s&eacute;curit&eacute; tels que les cartes &agrave; puce. Voir aussi <a href="glossary.html#1028962">dispositif de s&eacute;curit&eacute;</a>, <a href="glossary.html#1027625">carte &agrave; puce</a>.<P>
<a NAME="POP_glossary"></a> <b>POP (Post Office Protocol).</b>&nbsp;Protocole de serveur de messagerie standard qui exige que vous t&eacute;l&eacute;chargiez les nouveaux messages sur votre ordinateur local, bien que vous puissiez choisir d'en laisser une copie sur le serveur. Avec le protocole POP, vous pouvez uniquement stocker tous vos messages, y compris les messages envoy&eacute;s, les brouillons et les dossiers personnalis&eacute;s, sur un seul ordinateur. A titre de comparaison, le protocole <a href="#IMAP_glossary">IMAP</a> vous permet d'enregistrer, de mani&egrave;re permanente, tous vos messages, ainsi que les &eacute;ventuelles modifications qui y ont &eacute;t&eacute; apport&eacute;es, sur le serveur accessible &agrave; partir de n'importe quel ordinateur. La plupart des FAI prennent en charge le protocole POP. <p>
<p><a name="File_Transfer_Protocol_(FTP)"></a> <b>Protocole FTP (File Transfer Protocol).</b>&nbsp;Standard permettant aux utilisateurs de transf&eacute;rer des fichiers entre deux ordinateurs via un r&eacute;seau. Vous pouvez utiliser votre navigateur pour r&eacute;cup&eacute;rer des fichiers &agrave; l'aide du protocole FTP.<p>
<A NAME="Lightweight_Directory_Access_Protocol_(LDAP)"></A><A NAME="1022286"></A> <a NAME="LDAP_glossary"></a> <B>protocole LDAP (Lightweight Directory Access Protocol).</B>&nbsp; <A NAME="1022287"></A> Protocole standard permettant d'acc&eacute;der &agrave; des services d'annuaire (des carnets d'adresses d'entreprise, par exemple) sur plusieurs plates-formes. Vous pouvez configurer votre navigateur de telle sorte qu'il acc&egrave;de &agrave; des annuaires LDAP &agrave; partir du Carnet d'adresses. Le composant Messagerie &amp; Forums peut &eacute;galement &ecirc;tre configur&eacute; en vue d'utiliser un annuaire LDAP pour le remplissage automatique des adresses.
<A NAME="Online_Certificate_Status_Protocol_(OCSP)"></A><A NAME="1029304"> <B>protocole OCSP (Online Certificate Status Protocol).</B>&nbsp; </A><A NAME="1029312"></A> Ensemble de r&egrave;gles suivies par le Gestionnaire de certificats pour effectuer une v&eacute;rification en ligne de la validit&eacute; d'un certificat &agrave; chaque utilisation de ce dernier. Ce processus implique la comparaison du certificat &agrave; une liste de certificats valides tenue &agrave; jour sur un site Web sp&eacute;cifi&eacute;. Votre ordinateur doit &ecirc;tre en ligne pour pouvoir utiliser le protocole OCSP.<P>
<A NAME="Secure_Sockets_Layer_(SSL)"></A><A NAME="999463"> <B>protocole SSL (Secure Sockets Layer).</B>&nbsp; </A><A NAME="999472"></A> Protocole permettant l'authentification mutuelle d'un <a href="glossary.htm#1029510">client</a> et d'un <a href="glossary.htm#1029749">serveur</a> pour l'&eacute;tablissement d'une connexion authentifi&eacute;e et chiffr&eacute;e. Le protocole SSL fonctionne au-dessus de TCP/IP et en dessous de HTTP, LDAP, IMAP, NNTP et d'autres protocoles r&eacute;seau de haut niveau. La nouvelle norme de l'IETF (Internet Engineering Task Force), appel&eacute;e TLS (Transport Layer Security), est bas&eacute;e sur le protocole SSL. Voir aussi <a href="glossary.html#998782">authentification</a>, <a href="glossary.html#999078">chiffrement</a>.<P>
<p><a name="proxy"></a> <b>proxy.</b>&nbsp;Programme interm&eacute;diaire qui fait office de <a href="#server">serveur</a> et de <a href="#client">client</a> en vue de formuler des requ&ecirc;tes au nom d'autres clients.<p>
<A NAME="certificate_renewal"></A><A NAME="1031319"> <B>renouvellement de certificat.</B>&nbsp; </A><A NAME="1031323"></A> Processus de renouvellement d'un <a href="glossary.html#1018895">certificat</a> proche de son expiration.<P>
<A NAME="server"></A><A NAME="1029749"> <B>serveur.</B>&nbsp; </A><A NAME="1029869"></A> Logiciel (tout comme un logiciel h&eacute;bergeant des pages Web) recevant des requ&ecirc;tes d'un <a href="glossary.htm#1029510">client</a>, qui s'ex&eacute;cute g&eacute;n&eacute;ralement sur un autre ordinateur, et lui envoyant des informations. Un ordinateur ex&eacute;cutant un logiciel serveur est &eacute;galement appel&eacute; serveur.<P>
<A NAME="object_signing"></A><A NAME="1014095"> <B>signature d'objets.</B>&nbsp; </A><A NAME="1014096"></A> Technologie permettant aux d&eacute;veloppeurs de logiciels de signer du code Java, des scripts JavaScript ou tout autre type de fichier et aux utilisateurs d'identifier les signataires et de contr&ocirc;ler l'acc&egrave;s par code sign&eacute; aux ressources syst&egrave;me locales.<P>
<A NAME="digital_signature"></A><A NAME="1013995"> <B>signature num&eacute;rique.</B>&nbsp; </A><A NAME="1013996"></A> Code cr&eacute;&eacute; &agrave; partir des donn&eacute;es &agrave; signer et de la cl&eacute; priv&eacute;e du signataire. Ce code est unique pour chaque nouvelle donn&eacute;e. M&ecirc;me une seule virgule ajout&eacute;e &agrave; un message modifie sa signature num&eacute;rique. La validation r&eacute;ussie de votre signature num&eacute;rique par le logiciel correspondant prouve non seulement que vous avez approuv&eacute; la transaction ou le message, mais &eacute;galement que les donn&eacute;es n'ont pas &eacute;t&eacute; modifi&eacute;es depuis l'apposition de la signature num&eacute;rique. Une signature num&eacute;rique n'a rien &agrave; voir avec une signature manuscrite, bien qu'elle puisse parfois &ecirc;tre utilis&eacute;e &agrave; des fins juridiques similaires. Voir aussi <a href="glossary.html#999248">non-r&eacute;pudiation</a>, <a href="glossary.html#999618">d&eacute;tection de fraude</a>.<P>
<p><a name="bookmark"></a> <b>signet.</b>&nbsp;Adresse stock&eacute;e d'une page Web (<a href="#Uniform_Resource_Locator_(URL)">URL</a>) &agrave; laquelle vous pouvez acc&eacute;der ais&eacute;ment en cliquant sur une ic&ocirc;ne de signet de la barre d'outils personnelle ou en s&eacute;lectionnant le nom du signet dans le menu Signets.<p>
<p><a name="web_site"></a> <b>site Web.</b>&nbsp;Groupe de pages Web apparent&eacute;es, reli&eacute;es par des liens hypertextes et g&eacute;r&eacute;es par une seule soci&eacute;t&eacute;, entreprise ou personne. Un site Web peut contenir du texte, des graphiques, des fichiers audio et vid&eacute;o, ainsi que des liens vers d'autres sites Web.<p>
<A NAME="SSL"></A><A NAME="999533"> <B>SSL.</B>&nbsp; </A><A NAME="999539"></A> Voir <a href="glossary.htm#999463">protocole SSL (Secure Sockets Layer).</a>&nbsp; <P>
<A NAME="subject"></A><A NAME="1013880"> <B>sujet.</B>&nbsp; </A><A NAME="1013881"></A> Entit&eacute; (personne, organisation ou routeur) identifi&eacute;e par un <a href="glossary.htm#1018895">certificat</a>. En particulier, la zone de sujet d'un certificat contient le <a href="glossary.html#1021328">nom de sujet</a> et d'autres caract&eacute;ristiques de l'entit&eacute; certifi&eacute;e.<P>
<A NAME="talkback"></A> <B>talkback.</B>&nbsp; Voir <a href="#netscape_talkback">Agent Contr&ocirc;le qualit&eacute; Netscape.</a>.<P>
<A NAME="TCP_IP)"></A> <B>TCP.</B>&nbsp; Voir <a href="#Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)">TCP/IP (Transmission Control Protocol/Internet Protocol)</a>.<P>
<p><a name="Transmission_Control_Protocol_Internet_Protocol_(TCP_IP)"></a> <a name="tcp"></a> <b>TCP/IP (Transmission Control Protocol/Internet Protocol).</b>&nbsp;Protocole Unix utilis&eacute; pour interconnecter des ordinateurs ex&eacute;cutant plusieurs syst&egrave;mes d'exploitation. TCP/IP est un protocole essentiel d'Internet qui s'est impos&eacute; comme une norme universelle.<p>
<A NAME="TLS"></A><A NAME="1027427"> <B>TLS.</B>&nbsp; </A><A NAME="1027428"></A> Voir <a href="glossary.htm#999463">protocole SSL (Secure Sockets Layer).</a>&nbsp;<P>
<p><a name="Uniform_Resource_Locator_(URL)"></a> <b>URL (Uniform Resource Locator).</b>&nbsp;Adresse normalis&eacute;e qui indique &agrave; votre navigateur comment localiser un fichier ou une autre ressource sur le Web. Par exemple : <tt>http://www.netscape.com.</tt> Vous pouvez entrer des URL dans la barre d'adresses du navigateur en vue d'acc&eacute;der aux pages Web. Ces URL sont &eacute;galement utilis&eacute;es dans des liens sur lesquels vous pouvez cliquer pour acc&eacute;der &agrave; d'autres pages Web. On parle &eacute;galement d'adresse Internet ou d'adresse Web.<p>
<A NAME="misrepresentation"></A><A NAME="1014057"> <B>usurpation d'identit&eacute;.</B>&nbsp; </A><A NAME="1014058"></A> Usurpation de l'identit&eacute; d'une personne ou d'une organisation par une entit&eacute;. Par exemple, un site Web peut se faire passer pour un magasin d'ameublement alors qu'il se contente de recevoir des paiements par carte de cr&eacute;dit sans envoyer de marchandises. Voir aussi <a href="glossary.html#1014366">mystification</a>.<P>
<A NAME="certificate_verification"></A><A NAME="1025527"> <B>v&eacute;rification de certificat.</B>&nbsp; </A><A NAME="1025531"></A> Lorsque le <a href="#Certificate_Manager">Gestionnaire de certificats</a> v&eacute;rifie un certificat, il confirme que la signature num&eacute;rique a &eacute;t&eacute; cr&eacute;&eacute;e par une autorit&eacute; de certification dont le certificat d'autorit&eacute; de certification est pr&eacute;sent dans le gestionnaire de certificats et consid&eacute;r&eacute; comme fiable pour l'&eacute;mission de ce type de certificat. Il s'assure &eacute;galement que le certificat en cours de v&eacute;rification n'a pas &eacute;t&eacute; marqu&eacute; comme non s&ucirc;r. Enfin, si le <a href="glossary.html#1029304">protocole OCSP (Online Certificate Status Protocol)</a> a &eacute;t&eacute; activ&eacute;, le Gestionnaire de certificats effectue &eacute;galement une v&eacute;rification en ligne. Pour ce faire, il recherche le certificat dans une liste de certificats valides tenue &agrave; jour &agrave; une URL sp&eacute;cifi&eacute;e dans le certificat proprement dit ou dans les pr&eacute;f&eacute;rences de validation du navigateur. Si l'une de ces v&eacute;rifications &eacute;choue, le Gestionnaire de certificats marque le certificat comme non v&eacute;rifi&eacute; et ne reconna&icirc;t pas l'identit&eacute; correspondante.<P>
<p><a name="World_Wide_Web"></a> <b>World Wide Web.</b>&nbsp;Egalement connu sous le nom de Web. Partie d'Internet constitu&eacute;e de pages Web stock&eacute;es par des <a href="#server">serveurs</a> Web et affich&eacute;es par des <a href="#client">clients</a> appel&eacute;s navigateurs Web (Netscape Navigator, par exemple).<p>
<p><a name="XMLIDX"></a>
<p><a name="XML"></a> <b>XML (Extensible Markup Language).</b>&nbsp; Standard ouvert destin&eacute; &agrave; la description des donn&eacute;es. Contrairement au langage HTML, XML permet au d&eacute;veloppeur d'une page Web de d&eacute;finir des balises sp&eacute;ciales. Pour plus d'informations, consultez le document en ligne du W3C intitul&eacute; <a href="http://www.w3.org/XML/" target="_blank">Extensible Markup Language (XML)</a>.<p>
<p><a name="XSLTIDX"></a>
<p><a name="XSLT"></a> <b>XSLT (Extensible Stylesheet Language Transformation).</b>&nbsp; Langage utilis&eacute; pour convertir un document XML en un autre document XML ou dans un autre format. Pour plus d'informations sur la prise en charge du langage XSLT par Netscape, consultez la rubrique <a href="cs_nav_prefs_advanced.html#Advanced">Pr&eacute;f&eacute;rences avanc&eacute;es &ndash; Avanc&eacute;</a>.<p>



<p> [&nbsp;<A HREF="glossary.html#glossary">Retour au d&eacute;but du glossaire</A>&nbsp;]
</p>

<hr>
<p><i>19 juin 2002</i></p>
<p>Copyright &copy; 1998-2002 Netscape Communications Corporation</p>

<BR>

</BODY>

</HTML>
