<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Utilisation de la fen&ecirc;tre d'aide</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white">


<a NAME="help_help"></a>
<hr><h1>Utilisation de la fen&ecirc;tre d'aide </h1>
<p>Cette section s'attache &agrave; d&eacute;crire l'utilisation de la fen&ecirc;tre d'aide, c'est-&agrave;-dire l'int&eacute;gralit&eacute; de la fen&ecirc;tre dans laquelle s'affichent ce texte et les onglets de la partie gauche.

<p>Pour plus d'informations &agrave; ce sujet, cliquez sur les liens affich&eacute;s dans la partie inf&eacute;rieure de la section <a href="welcome_help.html">Aide et centre d'assistance</a>. </p>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#tabs">Recherche de la rubrique souhait&eacute;e</a></p>
<p><a href="#retrace">Retour en arri&egrave;re</a></p>
<p><a href="#shortcuts">Utilisation des Raccourcis de l'aide</a></p>
<p><a href="#buttons">Utilisation des boutons d'aide</a></p>
</td>
</tr>
</table>
<p>&nbsp;</p>





<a NAME="tabs"></a> <a NAME="navigationIDX"></a> <a NAME="searching_helpSDX"></a> <a NAME="search:help_topicsSDX"></a>
<h2>Recherche de la rubrique souhait&eacute;e</h2>

<p>Lorsque la fen&ecirc;tre d'aide est affich&eacute;e, vous pouvez cliquer sur les onglets situ&eacute;s dans la partie gauche pour afficher le contenu de l'Aide de diverses mani&egrave;res&nbsp;:

<ul>
	<li><b>Sommaire</b> affiche la liste des principales rubriques.
	<p>Cliquez sur une rubrique pour acc&eacute;der aux informations qu'elle contient. Double-cliquez pour afficher les sous-rubriques.

	<p>Si vous ne trouvez pas la rubrique que vous recherchez, cliquez sur l'onglet Rechercher ou Index.
	<li><b>Rechercher</b> vous permet d'effectuer une recherche dans l'Aide int&eacute;gr&eacute;e de Netscape 7.0.
	<p>Entrez un mot ou une expression et appuyez sur Entr&eacute;e pour afficher les rubriques connexes. Cliquez ensuite sur la rubrique que vous souhaitez consulter.

	<p>Si votre recherche ne retourne aucune rubrique, faites une nouvelle tentative en saisissant moins de mots ou une combinaison de mots diff&eacute;rente.

	<li><b>Index</b> affiche la liste alphab&eacute;tique des rubriques.
	<p>Cliquez sur une entr&eacute;e d'index pour afficher les informations relatives &agrave; cette rubrique.
	<li><b>Glossaire</b> affiche la liste alphab&eacute;tique des d&eacute;finitions.
	<p>Cliquez sur un terme du glossaire pour afficher sa d&eacute;finition.
</ul>

<p>Pour consulter les informations relatives &agrave; la rubrique d'aide affich&eacute;e, cliquez sur les liens de la fen&ecirc;tre d'aide, tout comme vous le feriez dans une page Web normale.

<p>Ce lien vous permet, par exemple, d'acc&eacute;der &agrave; une d&eacute;finition du glossaire&nbsp;: <a href="glossary.html#cookie">cookie</a>. (Cliquez sur le bouton Pr&eacute;c&eacute;dent pour revenir &agrave; cette page.)

<p>&nbsp; <a NAME="retrace"></a> <a NAME="printing_helpIDX"></a>
<h2>Retour en arri&egrave;re</h2>

<p>Pour revenir en arri&egrave;re dans l'Aide, cliquez sur les boutons situ&eacute;s dans le coin sup&eacute;rieur droit de la fen&ecirc;tre d'aide&nbsp;:

<p><table summary="Help and Support Center" width = "300">
<tr>
<td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img alt="Ic&ocirc;nes de navigation de l'Aide" src="images/help_nav.gif">
</td><td><b>Aide et centre d'assistance</b></td></tr>
<tr><td><b>Arri&egrave;re &nbsp;&nbsp;Avant</b>
</td>
</tr>
</table>


<ul>
	<li>Cliquez sur le bouton Pr&eacute;c&eacute;dent pour parcourir les pages que vous avez visit&eacute;es pr&eacute;c&eacute;demment (de la plus r&eacute;cente &agrave; la plus ancienne). Le fonctionnement est identique &agrave; celui du bouton Pr&eacute;c&eacute;dent de votre navigateur.
	<li>Cliquez sur le bouton Suivant pour parcourir les pages que vous avez visit&eacute;es pr&eacute;c&eacute;demment (de la plus ancienne &agrave; la plus r&eacute;cente). Le fonctionnement est identique &agrave; celui du bouton Suivant de votre navigateur.
	<li>Cliquez sur le bouton Page d'accueil pour afficher la page Aide et centre d'assistance, ainsi que les liens vers les options d'assistance et les ressources bas&eacute;es sur le Web.
</ul>

<p>Si vous &eacute;prouvez des difficult&eacute;s pour conserver la fen&ecirc;tre d'aide au premier plan, tandis que vous suivez les instructions, cliquez sur Aide Netscape 7.0 dans la barre des t&acirc;ches de Windows pour la faire r&eacute;appara&icirc;tre.

<p>Vous pouvez &eacute;galement choisir d'imprimer les instructions que vous devez suivre&nbsp;:</li>
	<ul><li>Pour imprimer la totalit&eacute; de la page qui est affich&eacute;e dans la fen&ecirc;tre d'aide, cliquez sur le bouton Imprimer situ&eacute; dans le coin sup&eacute;rieur droit de la fen&ecirc;tre&nbsp;:

<p><img alt="Ic&ocirc;ne d'impression de l'Aide" src="images/help_print.gif">

<br><b>&nbsp;&nbsp;Imprimer</b>

<li>Pour n'imprimer qu'une partie de la page, s&eacute;lectionnez la partie de votre choix, puis cliquez sur le bouton Imprimer.</ul>
<p>&nbsp;</p>



<a NAME="shortcuts"></a> <a NAME="shortcuts:help_systemIDX"></a>
<h2>Utilisation des Raccourcis de l'aide</h2>

<p>Pour naviguer dans la fen&ecirc;tre d'aide, vous pouvez utiliser les raccourcis clavier. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="shortcuts.html#help">Raccourcis clavier de l'Aide</a>.

<p>&nbsp;</p>


<a NAME="buttons"></a>
<h2>Utilisation des boutons d'aide</h2>

<p>Bon nombre de bo&icirc;tes de dialogue et de fen&ecirc;tres sp&eacute;cialis&eacute;es de Netscape sont pourvues d'un bouton "Aide".

<p>Ce bouton vous permet d'afficher des informations d&eacute;taill&eacute;es sur la fen&ecirc;tre dans laquelle il se trouve.

<p>&nbsp;</p>



<p> [&nbsp;<A HREF="#help_help">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<hr>
<p><i>18 juin 2002</i></body>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>
