
<html>
<head>
<title>Aide d'ICQ Netscape 7.0</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">
<!-- <link rel="stylesheet" href="../style.css" type="text/css"> -->

</head>

<body bgcolor="white"> <a name="icq_top"></a>
<h1>Utilisation d'ICQ &agrave; partir de Netscape</h1>
<p>Le client de messagerie instantan&eacute;e de Netscape permet d'envoyer et de recevoir tant des messages AIM que des messages ICQ. Pour envoyer et recevoir des messages ICQ, vous devez &ecirc;tre connect&eacute; &agrave; ICQ ; vous ne pouvez pas utiliser en m&ecirc;me temps AIM et ICQ. Vous devez aussi poss&eacute;der un compte ICQ et constituer une liste de contacts ICQ. Certains de vos contacts AIM peuvent avoir des comptes ICQ et &ecirc;tre donc aussi des contacts ICQ, mais ce n'est pas toujours le cas.</p>

<table CELLSPACING=2 CELLPADDING=4 WIDTH="324" BGCOLOR="#CCCCCC">
<tr>
<p>&nbsp;</p>
<td class="inthissection">
<p>Rubriques li&eacute;es &agrave; ICQ  </p>
	<p><a href="#icq_account">Ouverture d'un compte ICQ</a>  </p>
	<p><a href="#icq_login">Proc&eacute;dures d'ouverture de session</a>  </p>
      <p><a href="#icq_addremove">Ajout et suppression de contacts et de groupes</a>  </p>
      <p><a href="#ICQ_sendreceive">Envoi et r&eacute;ception de messages ICQ</a>  </p>
	<p><a href="#icq_prefs">D&eacute;finition des pr&eacute;f&eacute;rences ICQ</a> </p>

</td>
</tr>
</table>

<p>&nbsp;</p>

<hr> <a NAME="icq_account"></a>
<h1>Ouverture d'un compte ICQ</h1>
   <p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>

  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#icq_new">Ouverture de votre premier compte ICQ</a>  </p>
      <p><a href="#icq_existing">Ouverture d'un compte ICQ avec un num&eacute;ro existant</a>  </p>

      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="icq_new"></a>  <a name="ICQ:Opening_a_New_AccountIDX"></a> <a name="opening_a_new_account:ICQIDX"></a> <a name="opening_new_ICQ_accountsSDX"></a>

<h2>Ouverture de votre premier compte ICQ</h2>



<p>Pour ouvrir un nouveau compte ICQ sans quitter Netscape, proc&eacute;dez comme suit.</p>
<ol>
<li>Ouvrez l'onglet de contacts AIM&agrave; partir de Ma barre lat&eacute;rale ou choisissez Instant Messenger dans le menu Fen&ecirc;tre.</li>
<li>Choisissez ICQ dans la liste d&eacute;roulante "S&eacute;lectionnez le service auquel vous connecter".</li>
<li>Cliquez sur "Enregistrer un nouvel utilisateur".</li>
</ol>
<p>La page d'enregistrement d'ICQ s'ouvre dans Navigator.</p>
<ol start=4>
<li>Entrez votre adresse &eacute;lectronique et cliquez sur "Submit".</li>
</ol>
<p>Une seconde page d'enregistrement appara&icirc;t.</p>
<ol start=5>
<li>Cliquez sur "Click here to register and get a new ICQ number".</li>
<li>Lisez l'accord de licence et cliquez sur "I Decline" (refuser) ou "I Agree" (accepter).</li>
</ol>
<p>Si vous cliquez sur "I Agree", la page d'enregistrement finale appara&icirc;t, avec une zone de texte o&ugrave; vous devez introduire votre code de confirmation.</p>
<ol start=7>
<li>Lorsque vous recevez le message contenant votre code de confirmation (g&eacute;n&eacute;ralement apr&egrave;s quelques minutes), copiez et collez-le dans la zone de texte appropri&eacute;e et cliquez sur "Submit". Ou bien, cliquez sur le lien fourni dans le message &eacute;lectronique pour introduire automatiquement le code.</li>
<li>Dans le formulaire qui appara&icirc;t, entrez un pseudonyme de votre choix, votre pr&eacute;nom, votre nom, votre sexe et votre &acirc;ge, puis un mot de passe de 4 &agrave; 8 caract&egrave;res.</li>
<li>Cliquez sur "Submit".</li>
</ol>
<p>Un nouvel &eacute;cran appara&icirc;t, affichant votre num&eacute;ro ICQ. Vous &ecirc;tes maintenant pr&ecirc;t &agrave; envoyer et recevoir des messages ICQ provenant d'autres membres d'ICQ.</p>
 <p> [&nbsp;<a href="#icq_account">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

<a name="icq_existing"></a>  <a name="ICQ:Using_an_Existing_Number_and_PasswordIDX"></a> <a name="Using_an_ICQ account_from_AIMIDX"></a> <a name="opening_existing_ICQ_accounts_in_AIMSDX"></a>

<h2>Ouverture d'un compte ICQ avec un num&eacute;ro et un mot de passe existants</h2>



<p>Si vous avez d&eacute;j&agrave; un num&eacute;ro et un mot de passe ICQ, proc&eacute;dez comme suit pour configurer votre compte ICQ en vue de l'utiliser dans Netscape : </p>
<ol>
<li>Ouvrez l'onglets de contacts AIM&agrave; partir de Ma barre lat&eacute;rale ou choisissez Instant Messenger dans le menu Fen&ecirc;tre.</li>
<li>Choisissez ICQ dans la liste d&eacute;roulante "S&eacute;lectionnez le service auquel vous connecter".</li>
<li>Cliquez sur "Enregistrer un nouvel utilisateur".</li>
</ol>
<p>La page d'enregistrement d'ICQ s'ouvre dans Navigator.</p>
<ol start=4>
<li>Entrez votre adresse &eacute;lectronique et cliquez sur "Submit".</li>
<li>Dans la deuxi&egrave;me page d'enregistrement qui appara&icirc;t, entrez votre num&eacute;ro et votre mot de passe ICQ et cliquez sur "Submit".</li>
<li>Lisez l'accord de licence et cliquez sur "I Decline" (refuser) ou "I Agree" (accepter).</li>
</ol>
<p>Si vous cliquez sur "I Agree", la page d'enregistrement finale appara&icirc;t, avec une zone de texte o&ugrave; vous devez introduire votre code de confirmation.</p>
<ol start=7>
<li>Lorsque vous recevez le message contenant votre code de confirmation (g&eacute;n&eacute;ralement apr&egrave;s quelques minutes), copiez et collez-le dans la zone de texte appropri&eacute;e et cliquez sur "Submit". Ou bien, cliquez sur le lien fourni dans le message &eacute;lectronique pour introduire automatiquement le code.</li>
<li>Dans le formulaire qui appara&icirc;t, entrez un pseudonyme de votre choix, votre pr&eacute;nom, votre nom, &eacute;ventuellement votre sexe et votre &acirc;ge, puis cliquez sur Submit.</li>
</ol>
<p>Vous &ecirc;tes maintenant pr&ecirc;t &agrave; envoyer et recevoir des messages ICQ provenant d'autres utilisateurs d'ICQ.</p>
 <p> [&nbsp;<a href="#icq_account">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="icq_login"></a>  <a name="ICQ:logging_onto_ICQIDX"></a> <a name="logging_on:ICQIDX"></a> <a name="logging_on_ICQSDX"></a><a name="connecting_to_ICQ_at_Netscape_startupIDX"></a> <a name="connect_at_launchSDX"></a> <a name="connecting_to_ICQ_at_system_startupIDX"></a> <a name="ICQ:connecting_at_system_startupIDX"></a> <a name="ICQ:disconnectingIDX"></a> <a name="disconnecting_ICQIDX"></a> <a name="ICQ_disconnectingSDX"></a> <a name="connect_at_startupSDX"></a>


<h1>Proc&eacute;dures d'ouverture de session</h1>
<p>Vous pouvez vous connecter &agrave; ICQ manuellement chaque fois que vous souhaitez utiliser ce service ou configurer ICQ pour qu'il se lance au d&eacute;marrage de Netscape ou de l'ordinateur.</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>

  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#icq_standard_login">Connexion &agrave; ICQ</a>  </p>
      <p><a href="#icq_system_launch">Lancement d'ICQ au d&eacute;marrage du syst&egrave;me</a>  </p>

      </td>
  </tr>

  </tbody>
</table>
    <p>&nbsp;</p>

<a name="icq_standard_login"></a> <a name="contactsSDX"></a>
<h2>Connexion &agrave; ICQ</h2>

<p>Pour vous connecter &agrave; ICQ, proc&eacute;dez comme suit :</p>

<ol>
<li>Ouvrez ICQ en choisissant Instant Messenger dans le menu Fen&ecirc;tre ou en cliquant sur l'onglet "Mes Contacts AIM" dans Ma barre lat&eacute;rale.</li>
<li>Au besoin, choisissez ICQ dans la liste d&eacute;roulante "S&eacute;lectionnez le service auquel vous connecter".</li>
<li>Entrez votre num&eacute;ro ou pseudonyme ICQ et votre mot de passe.</p>
<li>Si vous le souhaitez, cliquez sur les cases &agrave; cocher Enregistrer le mot de passe et/ou Connexion au d&eacute;marrage.</li>
</ol>
<p>Si vous s&eacute;lectionnez Connexion au d&eacute;marrage, vous serez automatiquement connect&eacute; &agrave; ICQ chaque fois que vous lancerez Netscape. La premi&egrave;re fois, vous devez vous connecter manuellement.<p>
<ol>
<li value=5>Cliquez sur Connexion<img src="chrome://aim/skin/btn2/icq-signon.gif">.</li>
</ol>
<p><b>Remarque&nbsp;:</b> Lorsque vous vous connectez &agrave; ICQ, le bouton Connexion se change en D&eacute;connecter <img src="chrome://aim/skin/btn2/icq-signoff.gif">. Cliquez sur ce bouton pour vous d&eacute;connecter.</p>
<p>La fen&ecirc;tre affiche l'onglet Mode en ligne, qui pr&eacute;sente une liste de tous vos contacts ICQ actuellement connect&eacute;s. Si un contact n'est pas en ligne, il n'appara&icirc;t pas dans la liste. S'il est en ligne, vous pouvez lui envoyer un message ICQ.</p>
 <p> [&nbsp;<a href="#icq_login">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="icq_system_launch"></a> <a name="launching:ICQ at system startup"></a>

<h2>Lancement d'ICQ au d&eacute;marrage du syst&egrave;me</h2>
<p>Sous Windows, vous pouvez configurer ICQ pour qu'il s'ouvre automatiquement au d&eacute;marrage de l'ordinateur, sans lancer le navigateur Netscape. Vous ne pouvez cependant pas d&eacute;finir cette option &agrave; partir d'ICQ ; vous devez &ecirc;tre connect&eacute; &agrave; AOL Instant Messenger pour Netscape. Pour ce faire, utilisez la fen&ecirc;tre principale d'ICQ/AIM, que vous pouvez s&eacute;lectionner dans le menu Fen&ecirc;tre, plut&ocirc;t que Ma barre lat&eacute;rale.</p>
<ol>
<li>Si vous &ecirc;tes connect&eacute; &agrave; ICQ, cliquez sur Log Off <img src="chrome://aim/skin/btn2/icq-signoff.gif">.</li>
<li>Dans la liste d&eacute;roulante "S&eacute;lectionnez le service auquel vous connecter", choisissez AIM.</li>
<li>Entrez vos pseudonyme et mot de passe AIM, puis cliquez sur le bouton de connexion <img src="chrome://aim/skin/btn2/signon.gif">.</li>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>
<li>Cliquez sur la pr&eacute;f&eacute;rence principale d'Instant Messenger.</li>
<li>S&eacute;lectionnez "Lancer automatiquement au d&eacute;marrage du syst&egrave;me".</li>
<li>Cliquez sur OK.</li>
<li>Cliquez sur le bouton de d&eacute;connexion d'AIM <img src="chrome://aim/skin/btn2/signoff.gif">.</li>
<li>Dans la liste d&eacute;roulante "S&eacute;lectionnez le service auquel vous connecter", choisissez ICQ.</li>
<li>Entrez votre num&eacute;ro ou pseudonyme ICQ et votre mot de passe, puis cliquez sur le bouton de connexion <img src="chrome://aim/skin/btn2/icq-signon.gif">.</li>
</ol>
<p>D&eacute;sormais, ICQ s'ouvrira &agrave; chaque d&eacute;marrage de l'ordinateur. Cette option ouvre la fen&ecirc;tre ICQ mais ne vous connecte automatiquement que si vous avez &eacute;galement s&eacute;lectionn&eacute; "Connexion au d&eacute;marrage" dans la fen&ecirc;tre d'ICQ.</p>
<p><b>Remarque&nbsp;:</b> Le lancement au d&eacute;marrage du syst&egrave;me n'est disponible que sous Windows. En outre, cette option n'est pas disponible si vous avez pr&eacute;c&eacute;demment configur&eacute; la version autonome du client AOL Instant Messenger ou du client ICQ pour qu'elle s'ouvre au d&eacute;marrage du syst&egrave;me.</p>
 <p> [&nbsp;<a href="#icq_login">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

<hr> <a name="icq_addremove"></a> <a name="contact_namesSDX"></a>

<h1>Ajout et suppression de contacts ICQ et ajout de groupes ICQ</h1>
<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#icq_contacts">Ajout de contacts ICQ</a>  </p>
      <p><a href="#icq_contacts_removing">Suppression de contacts ICQ</a>  </p>
	<p><a href="#icq_groups">Ajout de groupes ICQ</a>  </p>


      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="icq_contacts"></a>  <a name="ICQ:adding_contactsIDX"></a> <a name="adding:ICQ_contactsIDX"></a> <a name="adding_contactsSDX"></a> <a name="display_nameSDX"></a>


<h2>Ajout de contacts ICQ</h2>
<p>Pour ajouter des contacts ICQ, proc&eacute;dez comme suit :</p>
<ol>
<li>Cliquez sur l'onglet Liste de contacts pour afficher cette liste.</li>
<li>Cliquez sur Ajouter un contact <img src="chrome://aim/skin/btn2/addcontact-sm.gif">. La bo&icirc;te de dialogue&nbsp;Ajouter un contact s'affiche.</li>
<li>Entrez le num&eacute;ro ICQ du contact et son pseudonyme (un nom au choix), cochez la case correspondant au groupe auquel vous souhaitez affecter le contact, puis cliquez sur OK.</li>
</ol>
<p>Un contact ne peut &ecirc;tre associ&eacute; qu'&agrave; un seul groupe.</p>
<p>Un message de demande d'autorisation est automatiquement envoy&eacute; si l'utilisateur exige cette s&eacute;curit&eacute;. En attendant que le contact r&eacute;ponde au message, son pseudonyme appara&icirc;t dans un dossier intitul&eacute; "Autorisation en attente". Si le contact r&eacute;pond positivement, il est ajout&eacute; &agrave; votre liste de contacts. S'il r&eacute;pond n&eacute;gativement, son nom reste dans le dossier "Autorisation en attente". Aucun message n'est envoy&eacute; si le contact n'exige aucune autorisation. Son pseudonyme appara&icirc;t imm&eacute;diatement dans votre Liste de contacts.</p>
 <p> [&nbsp;<a href="#icq_addremove">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>


<a name="icq_contacts_removing"></a>  <a name="removing_ICQ_contactsSDX"></a>

  <a name="removing_ICQ_contactsIDX"></a> <a name="ICQ:removing_contactsIDX"></a>
<h2>Suppression de contacts ICQ</h2>

<p>Pour supprimer un contact ICQ :</p>
<ol>
<li>S&eacute;lectionnez le nom du contact dans la Liste de contacts.</li>
<li>Cliquez sur Supprimer le contact <img src="chrome://aim/btn2/icq-delete-sm.gif">.</li>
<li>Dans la bo&icirc;te de dialogue de confirmation qui appara&icirc;t, cliquez sur OK.</li>
</ol>
<p>Le contact est supprim&eacute;.</p>
 <p> [&nbsp;<a href="#icq_addremove">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p> <a name="ICQ:adding_groupsIDX"></a> <a name="adding_groupsSDX"></a> <a name="adding:ICQ_groupsIDX"></a> </p>

<h2>Ajout de groupes ICQ</h2>

<p>Le client ICQ est fourni avec quatre groupes standard : G&eacute;n&eacute;ral, Contacts, Famille et Coll&egrave;gues. Vous pouvez ajouter des groupes comme suit :</p>
<ol>
<li>Cliquez sur Ajouter un groupe <img src="chrome://aim/skin/btn2/icq-addgroup.gif">. La bo&icirc;te de dialogue&nbsp;Nouveau groupe s'affiche.</li>
<li>Enter le nom du groupe et cliquez sur OK.</li>
</ol>
<p>Le nouveau groupe appara&icirc;t dans la liste des groupes.</p>
 <p> [&nbsp;<a href="#icq_addremove">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

<hr> <a name="ICQ_sendreceive"></a>
<h1>Envoi et r&eacute;ception de messages ICQ</h1>

<p>&nbsp;</p>
<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#icq_sending">Envoi de messages ICQ</a>  </p>
      <p><a href="#icq_receiving">R&eacute;ception de messages ICQ</a>  </p>
	<p><a href="#icq_away">Activation de l'&eacute;tat Absent</a>  </p>


      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="icq_sending"></a>  <a name="ICQ:sending_messagesIDX"></a> <a name="sending_messages:ICQIDX"></a> <a name="sending_ICQ_messagesSDX"></a>
<h2>Envoi de messages ICQ</h2>
<p>Vous pouvez envoyer des messages ICQ &agrave; n'importe quel membre d'ICQ, qu'il utilise ICQ &agrave; partir de Netscape ou du client ICQ autonome.</p>
<ol>
<li>Si ICQ n'est pas ouvert, ouvrez l'onglet de contacts &agrave; partir de Ma barre lat&eacute;rale ou choisissez Instant Messenger dans le menu Fen&ecirc;tre.</li>
<li>Au besoin, choisissez ICQ dans la liste d&eacute;roulante "S&eacute;lectionnez le service auquel vous connecter".</li>
<li>Si n&eacute;cessaire, cliquez sur l'onglet Mode en ligne pour l'afficher au premier plan.</li>
<li>Double-cliquez sur le num&eacute;ro ou le pseudonyme du contact ICQ avec lequel vous souhaitez communiquer.</li>
<li>Dans la fen&ecirc;tre de message qui s'ouvre, tapez votre message, puis appuyez sur Entr&eacute;e ou Retour.</li>
<li>Lorsque vous recevez une r&eacute;ponse, r&eacute;pondez en tapant un message dans le volet inf&eacute;rieur de la fen&ecirc;tre de message, puis appuyez sur Entr&eacute;e ou Retour.</li>
<li>R&eacute;p&eacute;tez les &eacute;tapes 5 et 6 jusqu'&agrave; ce que la conversation soit termin&eacute;e.</li>

</ol>
<p>Si le membre ICQ ne figure pas dans votre liste de contacts, ex&eacute;cutez les op&eacute;rations 1 &agrave; 3 ci-dessus, puis ouvrez une fen&ecirc;tre de composition vide en cliquant sur le bouton Envoyer en Mode en ligne <img src="chrome://aim/skin/btn2/sendicq-sm.gif">. Entrez le pseudonyme ou le num&eacute;ro ICQ de la personne &agrave; contacter, puis ex&eacute;cutez les op&eacute;rations 5 &agrave; 7 ci-dessus.</p>
 <p> [&nbsp;<a href="#ICQ_sendreceive">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

<a name="icq_receiving"></a>  <a name="ICQ:receiving_messagesIDX"></a> <a name="receiving_mesages:ICQIDX"></a> <a name="receiving_ICQ_messagesSDX"></a>
<h2>R&eacute;ception de messages ICQ</h2>
<p>La r&eacute;ception de messages ICQ est identique &agrave; la r&eacute;ception de messages AIM, si ce n'est que vous devez &ecirc;tre connect&eacute; au service. Le service ICQ ne peut pas recevoir de messages lorsque vous &ecirc;tes hors ligne. Lorsque qu'un message vous parvient, une fen&ecirc;tre de message s'ouvre pour en afficher le contenu. Pour r&eacute;pondre :</p>
<ol>
<li>Tapez une r&eacute;ponse dans le volet inf&eacute;rieur de la fen&ecirc;tre de message, puis appuyez sur Entr&eacute;e ou Retour.</li>
<li>Lorsque vous recevez une r&eacute;ponse, r&eacute;p&eacute;tez l'&eacute;tape 1.</li>
</ol>
 <p> [&nbsp;<a href="#ICQ_sendreceive">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

 <a name="icq_away"></a> <a name="away_status_(ICQ)IDX"></a> <a name="ICQ:away_statusIDX"></a>

 <a name="ICQ_away_statusSDX"></a>
<h2>Activation de l'&eacute;tat Absent</h2>
<p>Si vous devez vous absenter de l'ordinateur pendant quelque temps et souhaitez le faire savoir &agrave; vos contacts, cliquez sur Absent ou choisissez Absent dans le menu Fichier. Les utilisateurs qui tenteront de vous contacter verront alors que vous &ecirc;tes absent.</p>
 <p> [&nbsp;<a href="#ICQ_sendreceive">Retour au d&eacute;but de la section</a>&nbsp;]</p>


<p>&nbsp;</p>

<hr> <a name="icq_prefs"></a>
<h1>D&eacute;finition des pr&eacute;f&eacute;rences ICQ</h1>

<p>Les panneaux de pr&eacute;f&eacute;rences ICQ permettent de contr&ocirc;ler des aspects importants du fonctionnement d'ICQ.  </p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#icq_gen">Pr&eacute;f&eacute;rences g&eacute;n&eacute;rales d'ICQ</a>  </p>
      <p><a href="#icq_privacypref">Confidentialit&eacute; et autorisation</a>
  </p>
      <p><a href="#icq_notif">Notification et sons</a>
  </p>
           <p><a href="#ICQ_connect">Connexion</a>
  </p>
      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="icq_gen"></a> <a name="setting_ICQ_preferencesSDX"></a> <a name="preferences:ICQIDX"></a> <a name="ICQ:setting_preferencesIDX"></a> <a name="time_stamps:ICQIDX"></a>
<h2>Pr&eacute;f&eacute;rences ICQ - G&eacute;n&eacute;rales</h2>


<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences g&eacute;n&eacute;ral d'ICQ. Si le panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
    <li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Cliquez sur ICQ.</li>
</ol>


<p>Choisissez parmi les options suivantes :    </p>
<ul>
 <li><b>Passer &agrave; la ligne avec la touche Entr&eacute;e&nbsp;:</b> Choisissez cette option pour que la touche Entr&eacute;e ins&egrave;re un saut de ligne. D&eacute;s&eacute;lectionnez-la pour que la touche Entr&eacute;e envoie le message.</li>
 <li><b>Ins&eacute;rer un retrait avec la touche Tab&nbsp;:</b> Choisissez cette option pour que la touche Tab ins&egrave;re une tabulation. D&eacute;s&eacute;lectionnez-la pour que la touche Tab ait pour effet de passer d'un champ &agrave; l'autre dans la fen&ecirc;tre ICQ.</li>
 <li><b>Afficher la date et l'heure des messages dans les nouvelles fen&ecirc;tres :</b> Choisissez cette option si vous voulez que les messages affich&eacute;s dans les prochaines sessions d'ICQ soient accompagn&eacute;s de la date et de l'heure d'envoi.  </li>
 </ul>

 <p> [&nbsp;<a href="#icq_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p> <a name="icq_privacypref"></a>  <a name="ICQ:privacyIDX"></a> <a name="ICQ:blocking_usersIDX"></a> <a name="blocking_ICQ_usersIDX"></a> <a name="blocking_ICQ_usersSDX"></a>



<h2>Pr&eacute;f&eacute;rences ICQ - Confidentialit&eacute; et autorisation</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Confidentialit&eacute; et autorisation d'ICQ. Si le panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
<li>Connectez-vous &agrave; ICQ. Vous devez &ecirc;tre connect&eacute; pour pouvoir modifier vos pr&eacute;f&eacute;rences de confidentialit&eacute;.</li>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Dans la cat&eacute;gorie ICQ, cliquez sur Confidentialit&eacute; et autorisation. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur ICQ pour d&eacute;velopper la liste.</li>
</ol>
<p>Choisissez parmi les options suivantes :</p>
 <ul>
<li>Si vous voulez que seuls les utilisateurs figurant dans votre liste de contacts puissent vous envoyer des messages, sous "Qui peut me contacter", cliquez sur "Autoriser uniquement les utilisateurs de ma liste de contacts".     </li>
  <li>Si vous souhaitez bloquer un ou plusieurs contacts, cliquez sur Ajouter n&deg; ICQ pour l'utilisateur que vous souhaitez bloquer, puis entrez son num&eacute;ro ICQ dans la bo&icirc;te de dialogue qui appara&icirc;t. R&eacute;p&eacute;tez l'op&eacute;ration pour tous les utilisateurs &agrave; bloquer.</li>
<li>Si vous souhaitez d&eacute;bloquer un ou plusieurs utilisateurs, s&eacute;lectionnez leurs num&eacute;ros dans la liste des utilisateurs bloqu&eacute;s et cliquez sur Supprimer.</li>
</ul>
 <p> [&nbsp;<a href="#icq_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p> <a name="ICQ_notif"></a>
<h2>Pr&eacute;f&eacute;rences ICQ - Notification et sons</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Notification et son d'ICQ. Si le panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
    <li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Dans la cat&eacute;gorie ICQ, cliquez sur Notification et son. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur ICQ pour d&eacute;velopper la liste.</li>
</ol>


<p>S&eacute;lectionnez les options disponibles afin de d&eacute;finir vos pr&eacute;f&eacute;rences pour les fonctions suivantes&nbsp;:    </p>
<ul>
  <li><b>Emettre un son lors de&nbsp;:</b> Si vous cochez cette case, le syst&egrave;me &eacute;mettra un son par d&eacute;faut pour tous les &eacute;v&eacute;nements r&eacute;pertori&eacute;s. D&eacute;s&eacute;lectionnez les &eacute;v&eacute;nements pour lesquels vous ne souhaitez pas entendre de son. Vous pouvez localiser un son en cliquant sur le bouton Parcourir. Acc&eacute;dez ensuite au Panneau de configuration, puis double-cliquez sur Sons et multim&eacute;dia. Apr&egrave;s avoir choisi un son, vous pouvez l'&eacute;couter en cliquant sur le bouton Aper&ccedil;u. Le signal sonore par d&eacute;faut est &eacute;mis si vous d&eacute;cidez de lire un son, mais ne sp&eacute;cifiez aucune option personnelle.</li>
</ul>


 <p> [&nbsp;<a href="#icq_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p> <a name="ICQ_connect"></a>  <a name="ICQ:connection_settingsIDX"></a>
<h2>Pr&eacute;f&eacute;rences ICQ - Connexion</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Connexion d'ICQ. Si le panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
    <li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Dans la cat&eacute;gorie ICQ, cliquez sur Connexion. Si aucune sous-cat&eacute;gorie n'est visible, cliquez sur ICQ pour d&eacute;velopper la liste.</li>
</ol>

<p>Si vous acc&eacute;dez &agrave; Internet par le biais d'un fournisseur d'acc&egrave;s &agrave; Internet, vous ne devrez probablement pas modifier la bo&icirc;te de dialogue de pr&eacute;f&eacute;rences de connexion. Si vous acc&eacute;dez &agrave; Internet au travers du pare-feu d'un r&eacute;seau local (par exemple, sur votre lieu de travail), votre administrateur r&eacute;seau peut devoir vous communiquer des informations afin que vous puissiez configurer la partie Serveur Proxy de la section Connexion.    </p>
<p><b>H&ocirc;te</b>    </p>
<p>Ce champ contient l'adresse Internet du serveur de messagerie instantan&eacute;e int&eacute;gr&eacute; de Netscape, lequel prend en charge AOL Instant Messenger pour Netscape et ICQ pour Netscape. Normalement, vous ne devez pas modifier cette zone. Si votre serveur proxy doit r&eacute;soudre le nom d'h&ocirc;te, il peut &ecirc;tre n&eacute;cessaire d'entrer l'adresse IP plut&ocirc;t que le nom du serveur dans cette zone. Vous pouvez obtenir cette adresse&nbsp;IP aupr&egrave;s de votre administrateur r&eacute;seau.   </p>
<p><b>Port</b>    </p>
<p>Cette zone contient le num&eacute;ro du port par d&eacute;faut &agrave; utiliser sur le serveur de messagerie instantan&eacute;e int&eacute;gr&eacute; de Netscape. Normalement, vous ne devez pas modifier cette zone.     </p>
<p><b>Se connecter par proxy</b>    </p>
<p>Si vous cochez cette case, le logiciel Instant Messenger active les commandes du serveur proxy.  Entrez le serveur proxy et les donn&eacute;es d'authentification et de protocole appropri&eacute;es (&agrave; obtenir aupr&egrave;s de votre administrateur r&eacute;seau).  </p>
 <p> [&nbsp;<a href="#icq_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>
<hr>
<p><i>
  <!-- #BeginDate format:Sw1 -->21 juin 2002<!-- #EndDate --> </i></p>
<hr>
<p>Copyright &copy; 1994-2000 Netscape Communications Corporation.

</body>
</html>
