<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Utilisation d'AOL Instant Messenger pour Netscape</title>

  <link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">
<!-- <link rel="stylesheet" href="../style.css" type="text/css"> -->

</head>
<body bgcolor="white">

<a name="im_top"></a> <a name="AOL_Instant_MessengerIDX"></a> <a name="AIMIDX"></a>

<h1>Utilisation d'AOL Instant Messenger pour Netscape</h1>
<p>AOL Instant Messenger pour Netscape est une version d'AOL Instant Messenger (AIM) parfaitement int&eacute;gr&eacute;e dans Netscape et enti&egrave;rement compatible avec toutes les autres versions d'AIM.</p>

<p>Pour acc&eacute;der &agrave; AIM, ouvrez le menu Fen&ecirc;tre et s&eacute;lectionnez Instant Messenger. Vous pouvez &eacute;galement ouvrir la version de Ma barre lat&eacute;rale en cliquant sur l'onglet "Mes Contacts AIM". Si l'onglet "Mes Contacts AIM" ne figure pas dans Ma barre lat&eacute;rale, vous pouvez l'y ajouter en cliquant sur Onglets dans la partie sup&eacute;rieure de Ma barre lat&eacute;rale, puis en cliquant sur "Mes Contacts AIM" dans la liste d&eacute;roulante.</p>


<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Rubriques d'Instant Messenger&nbsp;:  </p>
	 <p><a href="#im_start">Premiers pas dans AOL Instant Messenger</a>  </p>
	<p><a href="#im_buddy">Utilisation du contacts AIM</a>  </p>
	<p><a href ="#im_buddy_customizing">V&eacute;rification de la pr&eacute;sence de vos contacts</a> </p>
	<p><a href ="#im_message">Envoi de messages instantan&eacute;s</a> </p>
      <p><a href="#im_chat">Salons de discussion</a> </p>
  	<p><a href="#im_away">Messages d'absence</a> </p>
  	<p><a href="#im_access">Contr&ocirc;le d'acc&egrave;s</a>        </p>
	<p><a href="#im_warnings">Bl&acirc;mes</a>        </p>
     	<p><a href="#im_trouble">D&eacute;pannage</a>      </p>
	<p><a href="#im_prefs">D&eacute;finition des pr&eacute;f&eacute;rences d'Instant Messenger</a>      </p>


      </td>
  </tr>

  </tbody>
</table>
<p>&nbsp;</p>


<hr> <a name="im_start"></a>
<h1>Premiers pas dans AOL Instant Messenger pour Netscape</h1>
<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="370" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_whats">Pr&eacute;sentation d'AOL Instant Messenger pour Netscape</a>  </p>
      <p><a href="#im_setup">Configuration</a>  </p>
      <p><a href="#im_regist">Enregistrement de nouveaux pseudonymes</a>  </p>
      <p><a href="#im_signon">Connexion &agrave; AOL Instant Messenger</a> </p>
  	<p><a href="#im_system_launch">Lancement d'AOL Instant Messenger au d&eacute;marrage du syst&egrave;me</a> </p>
  	<p><a href="#im_password">Changement de mot de passe</a>        </p>
	<p><a href="#im_email">Mise &agrave; jour de votre adresse &eacute;lectronique</a>        </p>
      <p><a href="#im_multnam">Utilisation d'un pseudonyme diff&eacute;rent</a>      </p>
	<p><a href="#im_shortcuts">Utilisation des raccourcis clavier</a>      </p>
	<!--<p><a href="#im_today">Utilisation du bouton Aujourd'hui</a>      </p>-->


      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="im_whats"></a>
<h2>Pr&eacute;sentation d'AOL Instant Messenger pour Netscape</h2>

<p>AOL Instant Messenger pour Netscape est une version du logiciel AOL Instant Messenger enti&egrave;rement int&eacute;gr&eacute;e dans l'environnement du navigateur Netscape. Parfaitement compatible avec les autres versions d'AIM, elle constitue un moyen ais&eacute; de communiquer instantan&eacute;ment avec vos amis en ligne. Vous pouvez :    </p>
<ul>
  <li>Envoyer des messages instantan&eacute;s &agrave; un ami en ligne. Ces messages sont diff&eacute;rents du courrier &eacute;lectronique, dans la mesure o&ugrave;, si votre ami a ouvert Instant Messenger sur sa machine, votre message appara&icirc;t imm&eacute;diatement sur son &eacute;cran.</li>
  <li>Cr&eacute;er un r&eacute;pertoire de contacts AIM en ligne auxquels adresser des messages instantan&eacute;s. Instant Messenger permet de localiser vos amis pour les ajouter &agrave; la liste.</li>
  <li>Discuter avec des groupes d'amis et de la famille dans votre salon de discussion priv&eacute;.</li>
  <li>Contr&ocirc;ler qui communique avec vous &agrave; l'aide de la fonction de confidentialit&eacute;.</li>
  <li>Rechercher des contacts par adresse de courrier &eacute;lectronique.</li>
  <li>Avertir les utilisateurs qui vous envoient des messages choquants ou ennuyeux.</li>

</ul>
 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<p><a name="im_setup"></a>  <a name="Instant_Messenger:setting_upIDX"></a> <a name="setting_up:Instant_MessengerIDX"></a> <a name="setting_up_Instant_MessengerSDX"></a><a name="opening_an_account:AIMIDX"></a> <a name="screen_name:aboutIDX"></a>
<h2>Configuration</h2>

<p>Netscape&nbsp;7.0 permet d'utiliser un seul pseudonyme pour de nombreuses propri&eacute;t&eacute;s Netscape, dont&nbsp;AIM. Si vous avez ex&eacute;cut&eacute; la proc&eacute;dure d'enregistrement au d&eacute;marrage de Netscape, vous disposez d&eacute;j&agrave; d'un pseudonyme et d'un mot de passe. Aucune op&eacute;ration suppl&eacute;mentaire n'est donc n&eacute;cessaire. Il vous suffit de s&eacute;lectionner Instant Messenger dans le menu Fen&ecirc;tre ou de cliquer sur l'onglet "Mes Contacts AIM" dans Ma barre lat&eacute;rale. Votre pseudonyme figure d&eacute;j&agrave; dans le champ. Pour utiliser le produit, il vous reste &agrave; entrer le mot de passe utilis&eacute; lors de l'enregistrement.</p>

<p>Si vous n'avez pas effectu&eacute; la proc&eacute;dure d'enregistrement, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
  <li>  Ouvrez le menu Fen&ecirc;tre et cliquez sur Instant Messenger.</li>
  <li>  Cliquez sur Configurer.</li>
  <li>  Cliquez sur "Je n'ai pas de pseudonyme. Je dois en enregistrer un nouveau.", puis cliquez sur Suivant.</li>
<li>Dans l'&eacute;cran qui s'affiche alors, entrez votre nom, qui est en fait le nom du profil utilis&eacute; pour ouvrir une session Netscape.</li>
<li>Entrez le pseudonyme et le mot de passe de votre choix, puis cliquez sur Suivant.</li>
<li>Dans l'&eacute;cran qui s'affiche alors, entrez votre adresse &eacute;lectronique, votre date de naissance, votre sexe et votre code postal, puis cliquez sur Suivant.</li>
<li>Lisez attentivement la politique de confidentialit&eacute; de Netscape, cliquez sur "J'accepte" ou "Je refuse", puis cliquez sur Suivant.
<li>L'&eacute;cran qui s'affiche vous indique si votre pseudonyme est disponible. S'il a d&eacute;j&agrave; &eacute;t&eacute; choisi par une autre personne, le logiciel vous offre la possibilit&eacute; de faire une nouvelle tentative ou d'en accepter un dans une liste de propositions apparent&eacute;es &agrave; votre choix initial. Cliquez sur Terminer si votre pseudonyme a &eacute;t&eacute; accept&eacute;. Dans le cas contraire, entrez un nouveau pseudonyme ou faites votre choix dans la liste des suggestions et cliquez enfin sur Terminer.</li>
</ol>
<p><b>Remarque&nbsp;:</b> Si vous cliquez sur le bouton "Je refuse", vous mettez fin automatiquement &agrave; la proc&eacute;dure d'enregistrement.</p>
<p>Peu de temps apr&egrave;s la fin de la proc&eacute;dure d'enregistrement, vous recevrez une confirmation par courrier &eacute;lectronique. Dans ce cas, il vous suffit simplement de cliquer sur R&eacute;pondre et de taper OK dans la zone de composition du message. Vous recevrez alors un second courrier &eacute;lectronique d&eacute;taillant toutes les utilisations possibles de votre pseudonyme.</p>

     <p>Si vous souhaitez utiliser plusieurs pseudonymes, consultez la rubrique <a href="#im_regist">Enregistrement de nouveaux pseudonymes</a>.</p>

 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_regist"></a>  <a name="Instant_Messenger:registering_new_screen_namesIDX"></a> <a name="registering_new_IM_screen_namesIDX"></a> <a name="new_screen_namesSDX"></a> <a name="screen_nameSDX"></a> <a name="screen_name:newIDX"></a>

<h2>Enregistrement de nouveaux pseudonymes</h2>

<p> Une fois enregistr&eacute;s, vos pseudonyme et mot de passe ne peuvent plus &ecirc;tre modifi&eacute;s. Vous pouvez n&eacute;anmoins enregistrer plusieurs pseudonymes &agrave; utiliser avec le service Instant Messenger.   </p>
<p>Pour enregistrer et choisir un nouveau pseudonyme et un nouveau mot de passe :  </p>
<ol>
   <li>Si vous &ecirc;tes connect&eacute; &agrave; AIM, d&eacute;connectez-vous.</li>
<li>Cliquez sur Enregistrer un nouveau pseudonyme.</li>
<li>Appliquez la m&ecirc;me proc&eacute;dure que celle d&eacute;crite dans la rubrique  <a href="#im_setup">Configuration</a>, en commen&ccedil;ant au point&nbsp;3. </p>
</ol>


 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_signon"></a>  <a name="Instant_Messenger:signing_onIDX"></a> <a name="signing_on_to_Instant_MessengerIDX"></a> <a name="logging_on:AIMIDX"></a> <a name="signing_on_to_Instant_MessengerSDX"></a> <a name="connecting_to_AIM_at_Netscape_launchIDX"></a>

<h2>Connexion &agrave; Instant Messenger</h2>

<p>Avant d'utiliser Instant Messenger pour envoyer un message ou discuter, vous devez d&eacute;marrer le programme et vous connecter.    </p>
<p>Pour d&eacute;marrer et vous connecter &agrave; Instant Messenger&nbsp;:    </p>
<ol>
  <li>Ouvrez le menu Fen&ecirc;tre et s&eacute;lectionnez Instant Messenger.</li>
  <li>Entrez votre pseudonyme dans le champ correspondant. Si vous poss&eacute;dez plusieurs pseudonymes, entrez celui de votre choix.</li>
  <li>Entrez votre mot de passe dans le champ correspondant. Pour enregistrer le mot de passe pour la prochaine session, s&eacute;lectionnez "Enregistrer le mot de passe".</li>
  <li>Cliquez sur le bouton de connexion <img src="chrome://aim/skin/btn2/signon.gif"> ou appuyez sur Entr&eacute;e. </li>

</ol>

<p><b>Astuce&nbsp;:</b> pour que Instant Messenger d&eacute;marre en m&ecirc;me temps que Netscape, s&eacute;lectionnez "S'identifier au lancement" dans l'&eacute;cran de connexion.</p>

<p><b>Remarque&nbsp;:</b> Si vous avez d&eacute;j&agrave; utilis&eacute; AOL Instant Messenger seul ou &agrave; partir du client AOL et install&eacute; Netscape sur votre machine, il se peut que vous deviez red&eacute;finir vos pr&eacute;f&eacute;rences. Certaines pr&eacute;f&eacute;rences, c'est le cas notamment des r&eacute;pertoires de contacts AIM, ne sont pas transf&eacute;r&eacute;es automatiquement vers la version Netscape. Voir <a href="#im_prefs">D&eacute;finition des pr&eacute;f&eacute;rences d'Instant Messenger</a> pour plus d'informations sur la red&eacute;finition des pr&eacute;f&eacute;rences.</p>

 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_system_launch"></a>  <a name="Instant_Messenger:launching_at_system_launchIDX"></a> <a name="connecting to_AIM_at_system_startupIDX"></a>
<h2>Lancement d'AOL Instant Messenger au d&eacute;marrage du syst&egrave;me</h2>
<p>AOL Instant Messenger pour Netscape est configur&eacute; pour s'ex&eacute;cuter au d&eacute;marrage du syst&egrave;me. Si cela ne vous satisfait pas, vous pouvez d&eacute;sactiver cette option en proc&eacute;dant comme suit&nbsp;:</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
<li>Cliquez sur Instant Messenger.</li>
<li>Cliquez sur "Lancer automatiquement au d&eacute;marrage du syst&egrave;me" pour d&eacute;sactiver cette option.</li>
<li>Cliquez sur OK.</li>
</ol>
<p>Cette option est contr&ocirc;l&eacute;e par la pr&eacute;f&eacute;rence principale d'Instant Messenger. Cependant, elle reste active, que vous utilisiez AIM pour Netscape ou ICQ pour Netscape. Elle ouvre la fen&ecirc;tre AIM (ou ICQ), mais n'ouvre pas de session automatiquement, sauf si vous avez s&eacute;lectionn&eacute; l'option "S'identifier au lancement" dans AIM ou "Connexion au d&eacute;marrage " dans ICQ.</p>
<p><b>Remarque&nbsp;:</b> La disponibilit&eacute; de cette option d&eacute;pend de la plate-forme utilis&eacute;e. Elle n'est pas disponible dans les cas suivants&nbsp;: une autre version d'AOL Instant Messenger ou le client ICQ autonome est configur&eacute; pour s'ex&eacute;cuter au d&eacute;marrage du syst&egrave;me.</p>
<p>Pour plus d'informations sur les pr&eacute;f&eacute;rences d'Instant Messenger, consultez la rubrique <a href="#im_prefs">Pr&eacute;f&eacute;rences d'Instant Messenger</a>.</p>
 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="im_password"></a>  <a name="Instant_Messenger:changing_passwordIDX"></a> <a name="passwords:changing_Instant_MessengerIDX"></a> <a name=Instant_Messenger_passwordsSDX"></a>


<h2>Changement de mot de passe</h2>

<p>Vous pouvez changer de mot de passe lorsque vous &ecirc;tes connect&eacute; &agrave; AOL Instant Messenger. Il doit comporter entre 4 et 16 caract&egrave;res.</p>

<p>Pour changer de mot de passe, ouvrez la fen&ecirc;tre de r&eacute;pertoire de contacts d'Instant Messenger&nbsp;:  </p>
<ol>
  <li>Ouvrez le menu Edition, choisissez Modifier les options, puis Changer le mot de passe. La bo&icirc;te de dialogue Changer le mot de passe s'affiche.</li>
  <li>Entrez le mot de passe en cours dans le champ appropri&eacute; et entrez deux fois le nouveau mot de passe dans les champs correspondants.</li>
  <li>Cliquez sur OK.</li>

</ol>

<p><b>Remarque&nbsp;:</b> Les personnes connaissant votre mot de passe ont acc&egrave;s &agrave; votre compte. Vous ne devez donc jamais r&eacute;v&eacute;ler votre mot de passe &agrave; des utilisateurs en ligne.    </p>
 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_email"></a>  <a name="Instant_Messenger:updating_email_addressesIDX"></a> <a name="email_addresses:updating_Instant_MessengerIDX"></a> <a name="email_addresses_in_Instant_MessengerSDX"></a>


<h2>Mise &agrave; jour de votre adresse &eacute;lectronique</h2>

<p>Si vous modifiez votre adresse &eacute;lectronique, vous pouvez la mettre &agrave; jour &agrave; chaque fois que vous &ecirc;tes connect&eacute; &agrave; AOL Instant Messenger.</p>

<p>Pour mettre &agrave; jour votre adresse &eacute;lectronique, ouvrez la fen&ecirc;tre de r&eacute;pertoire de contacts d'Instant Messenger&nbsp;:  </p>
<ol>
  <li>Ouvrez le menu Edition, choisissez Modifier les options, puis Modifier une adresse e-mail.</li>
  <li>Entrez votre nouvelle adresse &eacute;lectronique.</li>
  <li>Cliquez sur OK.</li>

</ol>
<p>Vous recevrez, tr&egrave;s rapidement, une confirmation &eacute;lectronique &agrave; laquelle vous serez tenu de r&eacute;pondre. Aussit&ocirc;t la r&eacute;ponse re&ccedil;ue, votre adresse &eacute;lectronique sera modifi&eacute;e.</p>

 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>


  <a name="im_multnam"></a>  <a name="Instant_Messenger:multiple_screen_namesIDX"></a> <a name="screen_name:using_multipleIDX"></a> <a name="multiple_screen_namesSDX"></a>

<h2>Utilisation d'un pseudonyme diff&eacute;rent</h2>

<p>Si vous avez enregistr&eacute; plusieurs pseudonymes, vous pouvez vous connecter avec celui de votre choix. Pour vous connecter avec un nouveau pseudonyme enregistr&eacute; :
    </p>
<ol>
  <li>Ouvrez le menu Fen&ecirc;tre, puis choisissez l'option Instant Messenger pour afficher l'&eacute;cran Connexion. Vous devez &ecirc;tre d&eacute;connect&eacute; d'Instant Messenger pour afficher cet &eacute;cran.</li>
</ol>
<p><b>Remarque&nbsp;:</b> Si l'option "S'identifier au lancement" est activ&eacute;e, vous devrez vous d&eacute;connecter afin d'ouvrir une session sous un autre nom.</p>
<ol start=2>
  <li>S&eacute;lectionnez le pseudonyme en cours dans le champ correspondant et remplacez-le avec le nouveau pseudonyme.</li>
  <li>Entrez le mot de passe correspondant au nouveau pseudonyme dans le champ Mot de passe.</li>
  <li>Cliquez sur le bouton de connexion ou appuyez sur Entr&eacute;e.</li>

</ol>
<p><b>Remarque&nbsp;:</b> Pour r&eacute;activer l'option "S'identifier au lancement", connectez-vous en utilisant le pseudonyme associ&eacute; &agrave; cette option. </p>

 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_shortcuts"></a>  <a name="Instant_Messenger:keyboard_shortcutsIDX"></a> <a name="keyboard_shortcuts:usingIDX"></a> <a name="Instant_Messenger_keyboard_shortcutsSDX"></a>

<h2>Utilisation des raccourcis clavier</h2>
<p>De nombreuses options de menu d'AIM sont accessibles &agrave; partir du clavier. Cette fonctionnalit&eacute; s'av&egrave;re particuli&egrave;rement utile pour optimiser votre productivit&eacute; et pour les utilisateurs qui &eacute;prouvent des difficult&eacute;s &agrave; manipuler la souris. La majorit&eacute; de ces raccourcis sont indiqu&eacute;s dans les menus d'AIM. Pour obtenir la liste compl&egrave;te des raccourcis, consultez la rubrique <a href="shortcuts.html#instantmessenger">Raccourcis d'Instant Messenger</a>. </p>
 <p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="im_today"></a>  <a name="Instant_Messenger:Today_buttonIDX"></a> <a name="Today_buttonIDX"></a> <a name="minibrowserSDX"></a> <a name="minibrowserIDX"></a>

<a name="Today_buttonSDX"></a>
<!--<h2>Utilisation du bouton Aujourd'hui</h2>

<p> Lorsque vous vous connectez &agrave; Instant Messenger, que ce soit &agrave; partir du menu Fen&ecirc;tre ou de Ma barre lat&eacute;rale, un bouton Aujourd'hui <img src="chrome://aim/skin/btn2/today.gif"> remplace le bouton d'aide au bas de la fen&ecirc;tre d'AIM. Ce bouton fait appara&icirc;tre un mini navigateur&nbsp;; ce dernier s'affiche par-dessus la fen&ecirc;tre du navigateur principal si celui-ci est ouvert ou dans une fen&ecirc;tre autonome si le navigateur est ferm&eacute;. Le mini navigateur s'accompagne de liens vers plusieurs sujets qui peuvent se r&eacute;v&eacute;ler int&eacute;ressants. Cliquez sur un lien du mini navigateur pour ouvrir la fen&ecirc;tre du navigateur principal et afficher ainsi le sujet en question.	</p>


<p> [&nbsp;<a href="#im_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>-->
<p>&nbsp;</p>

<hr> <a name="im_buddy"></a>
<h1>Utilisation du r&eacute;pertoire de contacts AIM</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_list">A propos du R&eacute;pertoire</a>  </p>
      <p><a href="#im_addbuddy">Ajout et recherche de contacts</a>  </p>
      <p><a href="#im_creategroup">Cr&eacute;ation de groupes de contacts</a>  </p>
      <p><a href="#im_changebuddy">Suppression de contacts et de groupes de contacts</a>
      <p><a href="#im_buddystatus">V&eacute;rification de l'&eacute;tat des contacts</a>  </p>
	<p><a href="#im_member_information">Obtention d'informations sur les membres</a>  </p>
	<p><a href="#im_buddy_alerts">D&eacute;finition d'alertes de contact</a></p>
      <p><a href="#im_exportbuddy">Importation et exportation de r&eacute;pertoires de contacts AIM</a>
  </p>
      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="im_list"></a>  <a name="Instant_Messenger:Buddy_ListIDX"></a> <a name="buddy_listIDX"></a> <a name="buddy_listSDX"></a>

<h2>A propos du contacts AIM</h2>

<p>Lorsque vous vous connectez &agrave; Instant Messenger, votre r&eacute;pertoire de contacts s'affiche. Des dossiers pour trois groupes sont automatiquement cr&eacute;&eacute;s dans la fen&ecirc;tre de r&eacute;pertoire de contacts : Contacts, Famille et Coll&egrave;gues. Ajoutez des contacts &agrave; l'un de ces groupes ou cr&eacute;ez des groupes.     </p>
<p><b>Remarque&nbsp;:</b> Le r&eacute;pertoire de contacts s'affiche dans la fen&ecirc;tre Instant Messenger proprement dite, ainsi que dans l'onglet "Mes Contacts AIM" de Ma barre lat&eacute;rale. Vous pouvez acc&eacute;der &agrave; la plupart des fonctions d'Instant Messenger et les utiliser en cliquant sur l'onglet Buddy List de Ma barre lat&eacute;rale. Pour utiliser ses menus internes, vous devez cependant s&eacute;lectionner Instant Messenger dans le menu Fen&ecirc;tre.   </p>
<p>Le R&eacute;pertoire comprend deux onglets<:hs>: R&eacute;pertoire et En ligne.  </p>
  </p>

  <p>Dans l'onglet En ligne&nbsp;:    </p>
  <ul>
<li>L'onglet En ligne vous indique quand vos contacts sont disponibles.  Lorsque vos contacts se connectent, ils apparaissent dans votre r&eacute;pertoire de contacts AIM et vous pouvez leur envoyer imm&eacute;diatement des messages.</li>

 <li>Les groupes de la fen&ecirc;tre de r&eacute;pertoire de contacts AIM sont initialement affich&eacute;s ouverts, pour pr&eacute;senter tous les contacts qu'ils contiennent. Vous pouvez basculer entre les modes d'affichage ouvert et ferm&eacute; en double-cliquant sur chaque nom de groupe ou en s&eacute;lectionnant le nom du groupe et en appuyant sur Entr&eacute;e.</li>
 <li>Le nom de chaque groupe est suivi d'un nombre entre parenth&egrave;ses indiquant combien de personnes du groupe sont actuellement en ligne. Par exemple, (3/9) signifie que trois des neuf contacts du groupe sont en ligne.</li>
<li>Les noms de contacts en gris et italique signalent ceux qui viennent de se d&eacute;connecter ou sont inactifs. </li>


</ul>


  <p>Dans l'onglet "Mes Contacts AIM"&nbsp;:    </p>
  <ul>
 <li>Chaque groupe appara&icirc;t sous la forme d'un dossier.</li>
 <li>Les contacts de chaque groupe apparaissent sous la forme de branches du dossier. Vous devez d&eacute;velopper le groupe pour voir les contacts qu'il contient. Pour d&eacute;velopper le groupe, double-cliquez sur son nom.</li>
 <li>Vous ne pouvez pas voir lequel de vos contacts est en ligne lorsque vous affichez l'onglet "Mes Contacts AIM". Cliquez sur En ligne pour voir quels contacts sont en ligne.</li>
<li>L'onglet "Mes Contacts AIM" permet &eacute;galement d'ajouter des contacts &agrave; la liste et de cr&eacute;er des groupes de contacts. Par exemple, vous pouvez cr&eacute;er des groupes pour des int&eacute;r&ecirc;ts sp&eacute;cifiques tels que Amis golfeurs, Camarades d'&eacute;cole, Voisins, etc., et y ajouter vos contacts. L'onglet "Mes Contacts AIM" permet &eacute;galement de supprimer des contacts et des groupes.</li>


  </ul>

<p><b>Astuce&nbsp;:</b> Les r&eacute;pertoires de contacts AIM sont stock&eacute;s sur un serveur et non sur votre ordinateur. Vous pouvez ainsi y acc&eacute;der o&ugrave; que vous soyez, chaque fois que vous vous connectez au service Instant Messenger.      </p>
 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_addbuddy"></a>  <a name="Instant_Messenger:adding_buddiesIDX"></a> <a name="Instant_Messenger:finding_buddiesIDX"></a>  <a name="adding:buddiesIDX"></a> <a name="Buddy_List:adding_buddiesIDX"></a>  <a name="finding_buddiesIDX"></a> <a name="finding_buddiesSDX"></a>  <a name="adding_buddiesSDX"></a> <a name="screen_name:findingIDX"></a> <a name="screen_name:addingIDX"></a>
<h2>Ajout et recherche de contacts</h2>

<p>Si vous connaissez le pseudonyme d'un ami, vous pouvez l'ajouter imm&eacute;diatement &agrave; votre r&eacute;pertoire de contacts AIM.    </p>
<p>Affichez la fen&ecirc;tre de r&eacute;pertoire de contacts AIM.  </p>
<ol>
  <li>  Cliquez sur l'onglet "Mes Contacts AIM".</li>
    <li> Cliquez sur le bouton Nouveau contact <img src="chrome://aim/skin/btn1/addbuddy.gif"> (le bouton affich&eacute; peut &ecirc;tre diff&eacute;rent si vous utilisez un th&egrave;me autre que Modern). La bo&icirc;te de dialogue&nbsp;Nouveau contact s'affiche.</li>
  <li>  Entrez le pseudonyme du contact &agrave; ajouter. Pour rappel, entrez uniquement son pseudonyme, pas son adresse &eacute;lectronique. Par exemple, jeandupont et non jeandupont@aol.com.</li>
  <li>  Cliquez sur le groupe auquel ajouter le pseudonyme.</li>
  <li>  Cliquez sur OK.</li>

</ol>

<p>Si vous ne connaissez pas le pseudonyme d'un ami, AIM peut vous aider &agrave; le localiser &agrave; l'aide de son adresse &eacute;lectronique.    </p>
<p>Affichez la fen&ecirc;tre de r&eacute;pertoire de contacts AIM dans la version autonome d'AIM (et non la version de Ma barre lat&eacute;rale).    </p>
<ol>
  <li>  Ouvrez le menu Contacts et s&eacute;lectionnez Rechercher un contact.</li>
  <li>  Entrez l'adresse &eacute;lectronique du contact dans la zone "Adresse &eacute;lectronique de l'ami", puis cliquez sur Suivant. Instant Messenger affiche tous les pseudonymes correspondant &agrave; l'adresse sp&eacute;cifi&eacute;e.</li>
  <li>  S&eacute;lectionnez le pseudonyme &agrave; ajouter &agrave; la liste et cliquez sur Nouveau contact.</li>
  <li>Dans la bo&icirc;te de dialogue Nouveau contact, s&eacute;lectionnez le groupe auquel ajouter le contact et cliquez sur OK.  </li>
  <li>Cliquez sur Termin&eacute; lorsque vous avez fini.  </li>
</ol>

 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_creategroup"></a>  <a name="Instant_Messenger:creating_buddy_groupsIDX"></a> <a name="buddy_groupsIDX"></a>  <a name="adding:buddy_groupsIDX"></a>

<h2>Cr&eacute;ation de groupes de contacts</h2>

<p>Vous pouvez regrouper vos contacts dans des dossiers pour les organiser. Votre contacts AIM comprend trois dossiers de groupes pr&eacute;d&eacute;finis&nbsp;: Contacts, Famille et Coll&egrave;gues.
   </p>
<p>Pour cr&eacute;er un groupe, ouvrez la fen&ecirc;tre de r&eacute;pertoire de contacts&nbsp;:    </p>
<ol>
  <li>  Cliquez sur l'onglet "Mes Contacts AIM".</li>
    <li> Cliquez sur le bouton Nouveau groupe <img src="chrome://aim/skin/btn2/addgroup-sm.gif"> (le bouton affich&eacute; peut &ecirc;tre diff&eacute;rent si vous utilisez un th&egrave;me autre que Modern). La bo&icirc;te de dialogue&nbsp;Nouveau groupe s'affiche.</li>
  <li>  Entrez le nom du groupe et cliquez sur OK.</li>

</ol>

<p>Un dossier s'affiche pour le nouveau groupe. Pour ajouter des contacts au dossier, suivez les &eacute;tapes de la section <a href="#im_addbuddy">Ajout et recherche de contacts</a>.
 </p>
<p>Pour ouvrir ou fermer le dossier d'un groupe, s&eacute;lectionnez le nom du groupe afin de le mettre en surbrillance et appuyez ensuite sur Entr&eacute;e.    </p>
 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_changebuddy"></a>  <a name="Instant_Messenger:deleting_buddiesIDX"></a> <a name="Instant_Messenger:deleting_groupsIDX"></a>  <a name="deleting:buddiesIDX"></a> <a name="deleting:buddy_groupsIDX"></a>
<h2>Suppression de contacts et de groupes de contacts</h2>

<p>Pour cr&eacute;er un contact ou un groupe, ouvrez la fen&ecirc;tre de r&eacute;pertoire de contacts&nbsp;:    </p>
<ol>
  <li>  Cliquez sur l'onglet "Mes Contacts AIM".</li>
  <li>  S&eacute;lectionnez le nom d'un groupe ou d'un contact.</li>
  <li>  Cliquez sur le bouton Supprimer <img src="chrome://aim/skin/btn2/delete-sm.gif"> (le bouton affich&eacute; peut &ecirc;tre diff&eacute;rent si vous utilisez un th&egrave;me autre que Modern).</li>

</ol>

 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

  <a name="im_buddystatus"></a>  <a name="buddy_statusIDX"></a> <a name="buddy_statusSDX"></a>

<h2>V&eacute;rification de l'&eacute;tat des contacts</h2>

<p>Pour savoir lequel de vos contacts est en ligne, cliquez sur l'onglet En ligne dans le r&eacute;pertoire de contacts AIM.     </p>
<p>Vous ne pouvez voir lequel de vos contacts est en ligne lorsque l'onglet "Mes Contacts AIM" est affich&eacute;. Cliquez sur l'onglet En ligne.    </p>
<p>Dans l'onglet En ligne&nbsp;:    </p>
<ul>
  <li>Pour d&eacute;velopper ou r&eacute;duire un groupe, double-cliquez sur son nom.</li>
  <li>Pour voir combien de membres d'un groupe sont en ligne, v&eacute;rifiez le nombre entre parenth&egrave;ses &agrave; c&ocirc;t&eacute; du nom du groupe. Par exemple, (4/7) signifie que quatre des sept contacts du groupe sont actuellement en ligne.</li>
    <li>Si le contact est en ligne, son nom s'affiche dans le r&eacute;pertoire de contacts AIM accompagn&eacute; d'une ic&ocirc;ne de pr&eacute;sence en ligne <img src="chrome://aim/skin/icons/biActive.gif">.</li>
  <li>Les noms affich&eacute;s en gris sont inactifs (la personne n'a pas utilise son ordinateur depuis 15 minutes mais est toujours en ligne) et une petite ic&ocirc;ne en forme d'horloge <img src="chrome://aim/skin/icons/biIdle.gif"> les accompagne. Cette ic&ocirc;ne s'affiche uniquement si votre contact a activ&eacute; la fonction de signalisation d'inactivit&eacute;. Pour plus d'informations, consultez la rubrique <a href="#im_turn_off_idle">D&eacute;sactivation de la fonction de signalisation d'inactivit&eacute;</a>.</li>
  <li>Si le contact a activ&eacute; un <a href="#im_away">message d'absence,</a> l'ic&ocirc;ne d'absence <img src="chrome://aim/skin/btn2/away.gif"> s'affiche &agrave; c&ocirc;t&eacute; de son nom.</li>

</ul>

<p>Vous pouvez &eacute;galement rechercher les contacts en ligne dans Netscape Messagerie &amp; Forums. Si un contact est en ligne et que vous &ecirc;tes connect&eacute; au service Instant Messenger, une ic&ocirc;ne de pr&eacute;sence <img src="chrome://aim/skin/icons/biActive.gif"> s'affiche &agrave; c&ocirc;t&eacute; de son nom dans le champ A, De ou CC. L'ic&ocirc;ne appara&icirc;t &eacute;galement en regard du nom des non-contacts. Il s'agit d'utilisateurs d'Instant Messenger qui ne figurent pas dans votre r&eacute;pertoire de contacts AIM. S'agissant des contacts et des non-contacts, l'ic&ocirc;ne de pr&eacute;sence ne s'affiche que pour les utilisateurs enregistr&eacute;s et confirm&eacute;s.
  </p>
<p>L'ic&ocirc;ne de pr&eacute;sence &agrave; c&ocirc;t&eacute; du nom d'un contact appara&icirc;t et dispara&icirc;t d&egrave;s que celui-ci se d&eacute;connecte.
    </p>

 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="im_member_information"></a>  <a name="Instant_Messenger:getting_member_informationIDX"></a> <a name="member_information,gettingIDX"></a>
<h2>Obtention d'informations sur les membres</h2>
<p>Si vous &ecirc;tes connect&eacute; &agrave; l'application AIM (et non au contacts AIM de Ma barre lat&eacute;rale), vous pouvez obtenir des informations sur n'importe quel contact. Pour ce faire<:hs>:</p>
<ol>
<li>S&eacute;lectionnez le contact sur lequel vous souhaitez obtenir des informations.</li>
<li>Ouvrez le menu Contacts et s&eacute;lectionnez Obtenir les infos du membre.</li>
</ol>
<p>La fen&ecirc;tre Infos sur le contact s'ouvre pour ce contact. Elle affiche la dur&eacute;e de connexion ou d'inactivit&eacute; du contact, ainsi que le niveau de bl&acirc;me qui lui est associ&eacute; (si tant est qu'il y en ait un). Si le contact est absent et a choisi un message d'absence, celui-ci s'affiche. Si le contact n'est pas connect&eacute;, aucune information n'est disponible. De m&ecirc;me, si le contact s'est connect&eacute; au moyen d'une autre version d'AOL Instant Messenger, il se peut que des informations suppl&eacute;mentaires soient affich&eacute;es &agrave; son sujet.</p>

 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

<a name="im_buddy_alerts"></a>  <a name="Instant_Messenger:Setting_Buddy_AlertsIDX"></a> <a name="buddy_alertsIDX"></a>
<h2>D&eacute;finition d'alertes de contact</h2>
<p>Les alertes de contact vous indiquent lorsque l'un de vos contacts est en ligne, ou quitte l'&eacute;tat Absent ou Inactif. Pour d&eacute;finir des alertes de contact&nbsp;:</p>
<ol>
<li>Dans le r&eacute;pertoire de contacts de la version autonome d'AIM, s&eacute;lectionnez le contact pour lequel vous souhaitez d&eacute;finir une alerte.</li>
<li>Ouvrez le menu Contacts, puis s&eacute;lectionnez Signaler la connexion de <i>nom du contact</i>. La bo&icirc;te de dialogue Signaler la connexion d'un contact s'affiche.</li>
<li>Cliquez sur l'une ou plusieurs des options suivantes&nbsp;: Me signaler lorsque le contact&nbsp;: se connecte, est de nouveau actif, est de nouveau pr&eacute;sent.</li>
<li> Cliquez sur Options&nbsp;: Afficher la fen&ecirc;tre de signal de connexion ou Signal sonore.</li>
</ol>
<p>Pour plus d'informations sur la notification sonore, consultez la rubrique <a href="#im_notif">Pr&eacute;f&eacute;rences Instant Messenger &mdash; Notification</a>.</p>
 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p> <a name="im_exportbuddy"></a>  <a name="Buddy_List:importingIDX"></a>  <a name="importing_Buddy_ListIDX"></a> <a name="exporting_buddy_listsIDX"></a> <a name="exporting_buddy_listsSDX"></a> <a name="importing_buddy_listsSDX"></a>


<h2>Importation et exportation de r&eacute;pertoires de contacts AIM</h2>

<p>Si vous avez utilis&eacute; une version pr&eacute;c&eacute;dente d'AOL Instant Messenger, vous pouvez transf&eacute;rer votre r&eacute;pertoire de contacts du AIM.    </p>
<ol>
    <li>Lancez AOL Instant Messenger et connectez-vous.</li>
    <li>Ouvrez le menu Mon AIM et s&eacute;lectionnez Enregistrer le contact AIM. Le fichier est enregistr&eacute; avec l'extension .blt.</li>
    <li>D&eacute;connectez-vous et quittez AOL Instant Messenger.</li>
    <li>Lancez Instant Messenger dans Netscape et connectez-vous.
</li>
    <li>Ouvrez le menu Fichier et choisissez Importer un liste de contacts.</li>
    <li>S&eacute;lectionnez le fichier que vous venez d'enregistrer pour importer le liste de contacts.</li>

</ol>

<p>Pour exporter le liste de contacts, ouvrez la fen&ecirc;tre de contacts&nbsp;:</p>

<ol>
    <li>Ouvrez le menu Fichier et choisissez Exporter un liste de contacts AIM.</li>
    <li>Entrez un nom pour la liste.</li>
    <li> Choisissez un emplacement d'enregistrement pratique et cliquez sur Enregistrer.</li>

</ol>

<p>&nbsp;</p>

<hr> <a name="im_buddy_customizing"></a>
<h1>V&eacute;rification de la pr&eacute;sence de vos contacts</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_turn_off_idle">D&eacute;sactivation de la fonction de signalisation d'inactivit&eacute;</a>  </p>
      <p><a href="#im_buddyicons">Utilisation des ic&ocirc;nes de contact</a>
  </p>

            </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="im_turn_off_idle"></a>  <a name="Instant_Messenger:turning_off_idle_reportingIDX"></a> <a name="idle_reporting,turning_off_in_AIMIDX"></a> <a name="idle_reportingSDX"></a>

<h2>D&eacute;sactivation de la fonction de signalisation d'inactivit&eacute;</h2>
<p>Si vous ne souhaitez pas que les autres utilisateurs sachent que vous avez &eacute;t&eacute; inactif, vous pouvez d&eacute;sactiver la fonction de signalisation d'inactivit&eacute; en proc&eacute;dant comme suit&nbsp;:</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.
<li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Confidentialit&eacute;. (Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la cat&eacute;gorie.)</li>
<li>
Assurez-vous que l'option "Permettre aux utilisateurs de voir combien de temps j'ai &eacute;t&eacute; inactif" n'est pas s&eacute;lectionn&eacute;e.
</li>
</ol>
<p>Pour plus d'informations, consultez la rubrique <a href="#im_privacypref">Pr&eacute;f&eacute;rences d'Instant Messenger &mdash; Confidentialit&eacute;</a>.</p>
 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_buddyicons"></a>  <a name="Buddy_Icons:usingIDX"></a>


<h2>Utilisation des ic&ocirc;nes de contact</h2>
<p>En tant qu'exp&eacute;diteur IM, vous pouvez agr&eacute;menter vos messages instantan&eacute;s (ou des messages envoy&eacute;s par des contacts s&eacute;lectionn&eacute;s) d'ic&ocirc;nes de contact&nbsp;; c'est-&agrave;-dire de graphiques qui vous repr&eacute;sentent vous, ou votre correspondant. En tant que destinataire, vous avez la possibilit&eacute; d'accepter ou de refuser les ic&ocirc;nes de contact. Il ne faut cependant pas confondre ce type d'op&eacute;ration avec le blocage d'un message. En effet, le message vous parviendra, mais l'ic&ocirc;ne de contact ne sera pas visible. Pour choisir votre ic&ocirc;ne de contact et d&eacute;finir les pr&eacute;f&eacute;rences qui y sont associ&eacute;es, vous devez acc&eacute;der au panneau des pr&eacute;f&eacute;rences Ic&ocirc;ne de contact. Pour plus d'informations, consultez la rubrique <a href="#im_buddyiconspref">Pr&eacute;f&eacute;rences d'Instant Messenger &mdash; Ic&ocirc;nes de contact</a>.</p>

 <p> [&nbsp;<a href="#im_buddy">Retour au d&eacute;but de la section</a>&nbsp;]</p>




<p>&nbsp;</p>
<hr> <a name="im_message"></a>
  <h1>Envoi de messages instantan&eacute;s</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="420" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_send">Envoi d'un message instantan&eacute;</a>  </p>
      <p><a href="#im_styles">Ajout de styles et de formats</a>  </p>
      <p><a href="#Adding_Smilies">Insertion de smileys</a>  </p>
      <p><a href="#im_hyper">Ajout de liens</a>  </p>
      <p><a href="#im_multiple">R&eacute;alisation de plusieurs conversations</a>  </p>
 <p><a href="#im_time_stamps">Utilisation de l'heure</a>  </p>
      <p><a href="#im_presence">Utilisation d'Instant Messenger &agrave; partir de Netscape Messagerie &amp; Forums</a>
  </p>
	<p><a href="#im_filetransfer">Envoi et r&eacute;ception de pi&egrave;ces jointes</a>
  </p>
      <p><a href="#im_end">Fin d'une conversation et d&eacute;connexion</a>  </p>
      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="im_send"></a>  <a name="Instant_Messenger:sending_a_messageIDX"></a> <a name="send:instant_messagesIDX"></a> <a name="sending:instant_messagesSDX"></a>

<h2>Envoi d'un message instantan&eacute;</h2>

<p>Proc&eacute;dez comme suit pour cr&eacute;er et envoyer un message instantan&eacute; :  </p>
<ol>
  <li>S&eacute;lectionnez Instant Messenger dans le menu Fen&ecirc;tre ou cliquez sur l'onglet "Mes Contacts AIM" dans Ma barre lat&eacute;rale. La fen&ecirc;tre de contacts AIM s'affiche. Vous devez &ecirc;tre connect&eacute; &agrave; AIM pour afficher cette fen&ecirc;tre.</li>

  <ul>
      <li>Pour envoyer un message instantan&eacute; &agrave; un contact de votre r&eacute;pertoire dont le nom figure dans l'onglet En ligne, double-cliquez sur son nom. Une fen&ecirc;tre s'ouvre, vous pouvez y taper votre message. Le champ A est automatiquement rempli.</li>
    <li>Pour envoyer un message instantan&eacute; &agrave; quelqu'un qui n'est pas en ligne ou ne figure pas dans votre liste de contacts, cliquez sur le bouton d'envoi <img src="chrome://aim/skin/btn2/sendim.gif"> (l'apparence du bouton peut &ecirc;tre diff&eacute;rente si vous utilisez un th&egrave;me autre que Modern) dans l'onglet En ligne. Entrez le nom de l'utilisateur dans le champ A de la fen&ecirc;tre Instant Message.</li>

  </ul>
  <li>Tapez votre message dans la zone de composition de la fen&ecirc;tre Instant Message.
 </li>
  <li>Cliquez sur le bouton d'envoi <img src="chrome://aim/skin/btn2/sendim.gif"> (le bouton affich&eacute; peut &ecirc;tre diff&eacute;rent si vous utilisez un th&egrave;me autre que Modern) ou appuyez sur Entr&eacute;e pour envoyer le message.</li>

</ol>

<p><b>Astuce&nbsp;:</b> Sous Windows et Linux, vous pouvez cliquer avec le bouton droit sur un nom et choisir de lui envoyer un message instantan&eacute; ou une invitation &agrave; discuter. Sous Mac, contr&ocirc;le-cliquez.    </p>
<p>Votre message s'affiche dans le volet sup&eacute;rieur de la fen&ecirc;tre de message. La r&eacute;ponse de votre contact y appara&icirc;tra &eacute;galement. Vous pouvez continuer &agrave; taper et envoyer des messages aussi longtemps que vous et votre contact le souhaitez.    </p>
 <p> [&nbsp;<a href="#im_message">Retour au d&eacute;but de la section</a>&nbsp;]</p>
  <p>&nbsp;</p> <a name="adding:styles_to_instant_messagesIDX"></a>  <a name="fonts:changing_in_instant_messagesIDX"></a> <a name="colors:changing_in_instant_messagesIDX"></a> <a name="pen:creating_in_instant_messagesIDX"></a> <a name="AIM_stylesSDX"></a> <a name="styles_in_AIMSDX"></a>


<a name="Adding_Styles_and_Formats"></a>
<h2>Ajout de styles et de formats</h2>

<p>Instant Messenger met &agrave; votre disposition une palette de polices et de styles, ainsi que diff&eacute;rentes couleurs de texte et d'arri&egrave;re-plan. Vous pouvez choisir ces options pour chaque message ou d&eacute;finir des valeurs par d&eacute;faut au moyen du panneau Styles des pr&eacute;f&eacute;rences d'Instant Messenger. Pour plus d'informations, consultez la rubrique <a href="#im_stylepref">Pr&eacute;f&eacute;rences d'Instant Messenger &mdash; Styles</a>. </p>

<ol>
    <li>Connectez-vous &agrave; AIM apr&egrave;s avoir ouvert le logiciel &agrave; partir du menu Fen&ecirc;tre ou de la barre lat&eacute;rale.</li>
    <li>Double-cliquez sur le nom d'un contact dans le liste des contacts, cliquez sur l'ic&ocirc;ne d'envoi d'un message instantan&eacute; dans la fen&ecirc;tre liste de contacts de la barre lat&eacute;rale d'Instant Messenger ou cliquez sur Envoyer un message dans le menu Contacts de la version autonome d'AIM. </li>
    <li>Tapez votre message dans la fen&ecirc;tre Message.</li>
    <li>S&eacute;lectionnez les options de mise en forme &agrave; utiliser.</li>

  </ol>

  <p>Vous pouvez formater du texte &agrave; partir de la barre d'outils de composition ou du menu Format. Le menu Format vous offre toutes les options de la barre d'outils de composition, plus quelques fonctions suppl&eacute;mentaires.</p>
  <p>La barre d'outils de composition vous permet d'effectuer les op&eacute;rations suivantes&nbsp;:</p>
  <ol>
  <li>S&eacute;lectionnez, dans la liste d&eacute;roulante situ&eacute;e dans la partie gauche de la fen&ecirc;tre, si vous souhaitez utiliser une police &agrave; chasse fixe ou variable. Une autre possibilit&eacute; consiste &agrave; choisir une police sp&eacute;cifique&nbsp;; g&eacute;n&eacute;ralement Arial, Helvetica, Courier ou Times. Nous attirons votre attention sur le fait que ces options s'excluent mutuellement. Concr&egrave;tement, cela signifie que vous ne pouvez pas choisir une police &agrave; chasse variable, puis s&eacute;lectionner un nom de police sp&eacute;cifique. L'ordinateur fournit sa police &agrave; chasse variable par d&eacute;faut.</li>
  <li>Cliquez sur le carr&eacute; noir pour afficher une palette dans laquelle vous pourrez choisir la couleur du texte s&eacute;lectionn&eacute;.</li>
  <li>Cliquez sur le carr&eacute; blanc pour afficher une palette dans laquelle vous pourrez choisir une couleur d'arri&egrave;re-plan.</li>
  <li>Cliquez sur le bouton -a ou +a pour agrandir ou r&eacute;duire le texte s&eacute;lectionn&eacute;.</li>
  <li>Cliquez sur le bouton B, I ou U pour mettre le texte s&eacute;lectionn&eacute; en gras, en italique ou le souligner.</li>
  <li>Cliquez sur la liste d&eacute;roulante des smileys pour ins&eacute;rer un &eacute;moticon.</li>
  </ol>
  <p>Le menu Format vous permet d'effectuer les op&eacute;rations suivantes&nbsp;:</p>
  <ol><li>S&eacute;lectionnez Police pour disposer de la m&ecirc;me palette de choix que dans la barre d'outils de composition.</li>
  <li>S&eacute;lectionnez Taille pour disposer de la m&ecirc;me palette de choix que dans la barre d'outils de composition avec, en plus, la possibilit&eacute; d'opter pour une taille de police tr&egrave;s petite, moyenne ou extra grande.</li>
  <li>S&eacute;lectionnez Style de texte pour disposer de la m&ecirc;me palette de choix que dans la barre d'outils de composition avec, en plus, la possibilit&eacute; de mettre le texte en exposant ou en indice.</li>
  <li>S&eacute;lectionnez Couleur de texte pour disposer de la m&ecirc;me palette de choix que dans la barre d'outils de composition.</li>
  <li>S&eacute;lectionnez Supprimer tous les styles pour r&eacute;tablir les valeurs par d&eacute;faut.</li>
  <li>S&eacute;lectionnez Annuler les liens pour supprimer tous les liens situ&eacute;s &agrave; l'int&eacute;rieur du document et pointant vers des URL externes.</li>
  </ol>
 <p> [&nbsp;<a href="#im_message">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="adding:smilies_to_instant_messagesIDX"></a>  <a name="smilies:adding_in_instant_messagesIDX"></a> <a name="smiliesSDX"></a><a name="emoticonsSDX"></a> <a name="Adding_Smilies"></a>
<h2>Insertion de smileys</h2>

<p>Pour incorporer des "smileys" dans un message (&eacute;moticons), cliquez sur le bouton de smiley de la barre d'outils de composition dans la fen&ecirc;tre de message et s&eacute;lectionnez l'image de votre choix. </p><p>Si vous ne pouvez pas voir le smiley, v&eacute;rifiez que l'option "Afficher les &eacute;moticons comme des images" est s&eacute;lectionn&eacute;e dans les pr&eacute;f&eacute;rences d'Instant Messenger. Pour plus d'informations, consultez la rubrique <a href="#im_prefs">Pr&eacute;f&eacute;rences d'Instant Messenger</a>.      </p>
 <p> [&nbsp;<a href="#im_message">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_hyper"></a>  <a name="adding:links_in_instant_messagesIDX"></a> <a name="links:instant_messagesIDX"></a> <a name="AIM_linksSDX"></a> <a name="links_Instant_MessengerSDX"></a>


<h2>Ajout de liens</h2>

<p>Pour ajouter un lien &agrave; un message, entrez l'URL compl&egrave;te (par exemple, <tt>http://www.aol.com ou mailto:jeandupont@aol.com</tt>). Le texte se transforme automatiquement en lien &agrave; l'envoi du message.    </p>
<p><b>Remarque&nbsp;:</b> Il n'est pas obligatoire d'entrer <tt>mailto:</tt> dans les URL de messagerie. En effet, <tt>mailto:</tt> est ajout&eacute; automatiquement.</p>
 <p> [&nbsp;<a href="#im_message">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p> <a name="im_multiple"></a>
<h2>R&eacute;alisation de plusieurs conversations</h2>

<p>Vous pouvez mener autant de conversations que vous le souhaitez. Une fen&ecirc;tre de message distincte s'affiche pour chaque conversation.    </p>
 <p> [&nbsp;<a href="#im_message">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="im_time_stamps"></a>  <a name="Instant_Messenger:time_stampsIDX"></a> <a name="time_stamps:AIMIDX"></a> <a name="time_stamps_AIMSDX"></a>

<h2>Utilisation de l'heure</h2>
<p>Ces indications donnent l'heure exacte de chaque d&eacute;claration effectu&eacute;e dans un message instantan&eacute;. Pour d&eacute;finir les pr&eacute;f&eacute;rences en mati&egrave;re d'heure, acc&eacute;dez &agrave; la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences. Pour plus d'informations, consultez la rubrique <a href="#Instant_Messenger_Preferences">Pr&eacute;f&eacute;rences d'Instant Messenger</a>. Quelles que soient les pr&eacute;f&eacute;rences d&eacute;finies, vous pouvez activer ou d&eacute;sactiver l'indication de l'heure pour chaque message. Pour ce faire<:hs>:</p>
<ol>
<li>Ouvrez une fen&ecirc;tre de composition d'un message instantan&eacute; en double-cliquant sur le nom d'un contact ou en s&eacute;lectionnant le nom du contact, puis en cliquant sur le bouton d'envoi d'un message instantan&eacute; <img src="chrome://aim/skin/btn2/sendim.gif"> dans la version autonome d'AIM ou l'onglet "Mes Contacts AIM" de Ma barre lat&eacute;rale.</li>
<li>Dans la zone de composition de la fen&ecirc;tre Instant Messenger, ouvrez le menu Afficher et cliquez sur l'option Afficher l'heure ou Masquer l'heure.</li>
</ol>
<p>Si vous choisissez l'option Masquer l'heure, aucune information temporelle ne sera affich&eacute;e. Si vous choisissez l'option Afficher l'heure, l'heure seront indiqu&eacute;es entre parenth&egrave;ses apr&egrave;s chaque d&eacute;claration.</p>
<p>&nbsp;</p>

  <a name="im_presence"></a>  <a name="Instant_Messenger:Netscape_Mail_presenceIDX"></a> <a name="Mail &amp; Newsgroups:Instant_Messenger_fromIDX"></a> <a name="Mail_and_AIMSDX"></a>

<h2>Utilisation d'Instant Messenger &agrave; partir de Netscape Messagerie &amp; Forums</h2>

<p>Vous pouvez facilement utiliser Instant Messenger &agrave; partir de Netscape Messagerie &amp; Forums pour correspondre rapidement avec des amis et coll&egrave;gues. Si un utilisateur enregistr&eacute; et confirm&eacute; d'Instant Messenger qui vous a envoy&eacute; un message est en ligne, une ic&ocirc;ne de pr&eacute;sence <img src="chrome://aim/skin/icons/biActive.gif"> s'affiche &agrave; c&ocirc;t&eacute; de son adresse &eacute;lectronique dans le champ De, A ou CC. Vous devez &ecirc;tre inscrit au service Instant Messenger pour voir ces ic&ocirc;nes. </p> <p>Pour envoyer un message instantan&eacute; &agrave; la personne, double-cliquez sur l'ic&ocirc;ne de pr&eacute;sence. Une fen&ecirc;tre Instant Messenger s'ouvre pour vous permettre de r&eacute;diger le message et de l'envoyer.    </p>
 <p> [&nbsp;<a href="#im_message">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p> <a name="im_filetransfer"></a>  <a name="Instant_Messenger:attachmentsIDX"></a> <a name="attachments_to_Instant_MessengerIDX"></a> <a name=sending:attachments to Instant MessengerSDX">
<h2>Envoi et r&eacute;ception de pi&egrave;ces jointes</h2>
<p>Vous pouvez envoyer des fichiers, tels que des documents de traitement de texte Word ou des fichiers graphiques, &agrave; d'autres utilisateurs et en recevoir d'autres contacts. Pour envoyer des fichiers joints&nbsp;:</p>
<ol>
<li>Cliquez avec le bouton droit de la souris sur le nom d'un contact, puis s&eacute;lectionnez sur Envoyer un fichier dans le menu contextuel ou s&eacute;lectionnez son nom, puis choisissez Envoyer un fichier au contact dans le menu Contacts.</li>
<li>Entrez le nom du fichier dans la bo&icirc;te de dialogue qui s'affiche. Cliquez sur le bouton Fichier pour localiser le fichier.</li>
<li>Entrez une description du contenu du fichier.</li>
<li>Cliquez sur Envoyer.</li>
</ol>
<p>Votre contact a maintenant la possibilit&eacute; d'accepter ou de refuser le fichier.</p>
<p>Pour accepter les fichiers qui vous sont envoy&eacute;s&nbsp;:</p>
<ol>
<li>Dans la bo&icirc;te de dialogue qui s'affiche &agrave; l'arriv&eacute;e du message, cliquez sur Parcourir pour localiser le r&eacute;pertoire dans lequel vous souhaitez t&eacute;l&eacute;charger le fichier en question.</li>
<li>Cliquez sur OK.</li>
</ol>
<p>Pour refuser le fichier, il vous suffit de cliquer sur Annuler.</p>

<p>&nbsp;</p>

<p><a name="im_end"></a>  <a name="Instant_Messenger:signing_offIDX"></a> <a name="signing_off_from_Instant_MessengerIDX"></a>  </p>
<h2>Fin d'une conversation et d&eacute;connexion</h2>

<p>Une conversation se termine lorsque les deux parties arr&ecirc;tent d'envoyer des messages instantan&eacute;s. Si l'autre personne continue d'envoyer des messages une fois la fen&ecirc;tre de message ferm&eacute;e, vous recevrez des notifications, &agrave; moins de <a href="#im_blockuser">bloquer</a> cet utilisateur. Pour fermer la fen&ecirc;tre de message, cliquez sur le bouton de fermeture.    </p>
<p>Pour vous d&eacute;connecter d'Instant Messenger, cliquez sur le bouton de d&eacute;connexion <img src="chrome://aim/skin/btn2/signoff.gif"> dans la fen&ecirc;tre du r&eacute;pertoire de contacts ou ouvrez le menu Fichier de cette fen&ecirc;tre et s&eacute;lectionnez "D&eacute;connecter" (vous &ecirc;tes d&eacute;connect&eacute; d'Instant Messenger, mais la fen&ecirc;tre reste ouverte) ou "D&eacute;connecter et fermer".   </p>
 <p> [&nbsp;<a href="#im_message">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="im_chat"></a>
<h1>Salons de discussion</h1>

<p>La fonction de discussion d'Instant Messenger permet d'&eacute;changer des messages avec plusieurs contacts dans des salons de discussion priv&eacute;s.  </p>
<p>
<table cellspacing="2" cellpadding="4" width="440" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_chatinvite">Invitations d'amis &agrave; une discussion</a>  </p>
      <p><a href="#im_chatsend">Envoi d'un message de discussion</a>  </p>
      <p><a href="#im_chatim">Envoi d'un message instantan&eacute; depuis un salon de discussion</a>
  </p>
      <p><a href="#im_cstyles">Ajout de styles et de formats</a>  </p>
      <p><a href="#im_chyper">Ajout de liens</a>  </p>
      <p><a href="#im_multiplechat">Organisation de plusieurs sessions de discussion</a>
  </p>
      <p><a href="#im_ignore">Blocage de messages de certains utilisateurs dans les salons de discussion</a>
  </p>
      <p><a href="#im_chatend">Fin d'une conversation et d&eacute;connexion</a>  </p>
      </td>
  </tr>

  </tbody>
</table>
    </p>
<p>&nbsp;</p> <a name="im_chatinvite"></a>  <a name="Instant_Messenger:chat_invitationsIDX"></a> <a name="invite_buddies_to_chatIDX"></a> <a name="chat_roomsSDX"></a>

<h2>Invitations d'amis &agrave; une discussion</h2>

<p>Pour inviter un contact &agrave; discuter&nbsp;:    </p>
<ol>
  <li>Ouvrez le menu Fen&ecirc;tre et s&eacute;lectionnez Instant Messenger. La fen&ecirc;tre du r&eacute;pertoire de contacts s'affiche. Vous devez &ecirc;tre connect&eacute; &agrave; Instant Messenger pour afficher cette fen&ecirc;tre.</li>
  <li>Dans la fen&ecirc;tre du r&eacute;pertoire de contacts, cliquez sur l'onglet En ligne.</li>
  <li>S&eacute;lectionnez les pseudonymes des amis &agrave; inviter au salon de discussion. Pour s&eacute;lectionner plusieurs pseudonymes, maintenez la touche Ctrl enfonc&eacute;e &agrave; chaque s&eacute;lection. Vous pouvez &eacute;galement s&eacute;lectionner un groupe entier.</li>
  <li>Cliquez sur le bouton Inviter &agrave; une discussion <img src="chrome://aim/skin/btn2/chat-sm.gif"> (le bouton affich&eacute; peut &ecirc;tre diff&eacute;rent si vous utilisez un th&egrave;me autre que Modern).</li>

  <p>La fen&ecirc;tre Invitation &agrave; une discussion s'ouvre.  Pour envoyer l'invitation &agrave; d'autres amis, entrez leurs pseudonymes dans la zone Pseudonymes des contacts &agrave; inviter en les s&eacute;parant par des virgules.</p>
    <li>Cliquez sur Inviter pour envoyer l'invitation.</li>

  <p>Une fois l'invitation accept&eacute;e, Instant Messenger affiche un message indiquant que le contact a acc&eacute;d&eacute; au salon. Vous pouvez commencer &agrave; entrer vos messages dans la zone de texte une fois la notification re&ccedil;ue. Le m&ecirc;me message s'affiche pour chaque invit&eacute;.
 </p>
</ol>

<p>Vous pouvez inviter un ami &agrave; rejoindre la discussion en cours. Pour ce faire, cliquez sur le bouton Inviter de la barre d'outils dans la fen&ecirc;tre Salon de discussion.    </p>
 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_chatsend"></a>  <a name="send:chat_messagesIDX"></a>
<h2>Envoi d'un message de discussion</h2>

<p>Pour envoyer un message de discussion :    </p>
<ol>
  <li>Entrez le message &agrave; envoyer dans la zone de texte de la fen&ecirc;tre Salon de discussion.  Vous pouvez envoyer des messages avec des liens et des &eacute;moticons (smileys) ou les formater &agrave; l'aide de styles tels que <b>gras</b>, <i>italique</i> ou <u>soulign&eacute;</u>. Utiliser des couleurs ou polices diff&eacute;rentes peut &eacute;galement renforcer vos messages.  </li>
  <li>Cliquez sur Envoyer.  </li>
</ol>

<p>Une fois la conversation termin&eacute;e, vous pouvez cliquer sur Enregistrer dans la barre d'outils de la fen&ecirc;tre Discuter pour enregistrer la conversation dans un fichier.    </p>
 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_chatim"></a>  <a name="send:instant_message_from_chatIDX"></a>

<h2>Envoi d'un message instantan&eacute; depuis un salon de discussion</h2>

<p>Vous pouvez envoyer directement un message instantan&eacute; &agrave; un utilisateur participant &agrave; une conversation depuis la fen&ecirc;tre Salon de discussion. Proc&eacute;dez comme suit&nbsp;:    </p>
<ol>
  <li>Dans la fen&ecirc;tre Salon de discussion, s&eacute;lectionnez le nom de la personne &agrave; laquelle envoyer un message instantan&eacute;.</li>
  <li>Cliquez sur le bouton Envoyer un message instantan&eacute; <img src="chrome://aim/skin/btn2/sendim.gif">.</li>
  <li>Entrez le message dans la fen&ecirc;tre qui s'affiche.</li>
  <li>Cliquez une nouvelle fois sur le bouton Envoyer un message instantan&eacute;.</li>

</ol>
 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_cstyles"></a>  <a name="adding:styles_to_chat_messagesIDX"></a> <a name="fonts:changing_in_chat_messagesIDX"></a>  <a name="colors:changing_in_chat_messagesIDX"></a> <a name="adding:smilies_(emoticons)_in_chat_messagesIDX"></a>  <a name="smilies:in chat messagesIDX"></a> <a name="emoticons:in chat_messengesIDX"></a>
<h2>Ajout de styles et de formats</h2>

<p>Instant Messenger permet de personnaliser les messages &agrave; l'aide de polices, couleurs et styles sp&eacute;ciaux et de smileys (&eacute;moticons)&nbsp;:    </p>
<ol>
  <li>S&eacute;lectionnez, dans la liste d&eacute;roulante situ&eacute;e dans la partie gauche de la fen&ecirc;tre, si vous souhaitez utiliser une police &agrave; chasse fixe ou variable. Une autre possibilit&eacute; consiste &agrave; choisir une police sp&eacute;cifique&nbsp;; g&eacute;n&eacute;ralement Arial, Helvetica, Courier ou Times. Nous attirons votre attention sur le fait que ces options s'excluent mutuellement. Concr&egrave;tement, cela signifie que vous ne pouvez pas choisir une police &agrave; chasse variable, puis s&eacute;lectionner un nom de police sp&eacute;cifique. L'ordinateur fournit sa police &agrave; chasse variable par d&eacute;faut.</li>
  <li>Cliquez sur le carr&eacute; noir pour afficher une palette dans laquelle vous pourrez choisir la couleur du texte s&eacute;lectionn&eacute;.</li>
  <li>Cliquez sur le carr&eacute; blanc pour afficher une palette dans laquelle vous pourrez choisir une couleur d'arri&egrave;re-plan.</li>
  <li>Cliquez sur le bouton -a ou +a pour agrandir ou r&eacute;duire le texte s&eacute;lectionn&eacute;.</li>
  <li>Cliquez sur le bouton G, I ou S pour mettre le texte s&eacute;lectionn&eacute; en gras, en italique ou le souligner.</li>
  <li>Cliquez sur la liste d&eacute;roulante des smileys pour ins&eacute;rer un &eacute;moticon.</li>
  </ol>


 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_chyper"></a>  <a name="adding:links_in_chat_messagesIDX"></a> <a name="links:chat_messagesIDX"></a>
<h2>Ajout de liens</h2>

<p>Pour ajouter un hyperlien &agrave; un message, entrez l'URL compl&egrave;te (par exemple, <tt>http://www.aol.com ou mailto:jeandupont@aol.com</tt>). Le texte se transforme automatiquement en hyperlien &agrave; l'envoi du message.    </p>
 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_multiplechat"></a>
<h2>Organisation de plusieurs sessions de discussion</h2>

<p>Vous pouvez mener jusqu'&agrave; trois sessions de discussion en m&ecirc;me temps. Une fen&ecirc;tre de discussion distincte s'affiche pour chaque conversation.    </p>
 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

  <a name="im_ignore"></a>  <a name="Instant_Messenger:ignoring_messagesIDX"></a> <a name="ignoring_instant_messagesIDX"></a>
<h2>Blocage de messages de certains utilisateurs dans les salons de discussion</h2>

<p>Pour arr&ecirc;ter de recevoir des messages d'un ou plusieurs participants du salon de discussion&nbsp;:
</p>
<ol>
    <li> S&eacute;lectionnez son pseudonyme dans la liste des participants au salon de discussion.</li>
  <li>  Cliquez sur Exclure. Un cercle rouge barr&eacute; s'affiche &agrave; c&ocirc;t&eacute; du pseudonyme s&eacute;lectionn&eacute;. Cliquez de nouveau sur Exclure pour d&eacute;sactiver cette fonction.</li>

</ol>

<p>Une fois que vous avez cliqu&eacute; sur Exclure, vous ne recevrez plus aucun messages des personnes dont vous avez s&eacute;lectionn&eacute; le pseudonyme. Toutefois, les autres participants au salon de discussion continueront &agrave; voir les messages envoy&eacute;s par ces personnes.    </p>
 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_chatend"></a>
<h2>Fin d'une conversation et d&eacute;connexion</h2>

<p>Une discussion se termine lorsque toutes les parties arr&ecirc;tent d'envoyer des messages instantan&eacute;s. Pour fermer la fen&ecirc;tre de discussion, cliquez sur le bouton de fermeture.    </p>
<p>Pour vous d&eacute;connecter d'Instant Messenger, ouvrez le menu Fichier et s&eacute;lectionnez D&eacute;connecter (d&eacute;connexion d'Instant Messenger, mais la fen&ecirc;tre reste ouverte) ou D&eacute;connecter et fermer.    </p>
 <p> [&nbsp;<a href="#im_chat">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="im_away"></a> <a name="Instant_Messenger:away_messagesIDX"></a> <a name="away_messages_AIM:aboutIDX"></a> <a name="away_messages_AIMSDX"></a> <a name="AIM_away_messagesSDX"></a>

<h1>Messages d'absence</h1>


<p>Si vous devez vous &eacute;loigner de l'ordinateur mais ne voulez pas vous d&eacute;connecter, vous pouvez utiliser un message d'absence pour signaler aux autres que vous &ecirc;tes momentan&eacute;ment indisponible.
   </p>
<p>Pour les absences planifi&eacute;es, vous pouvez activer votre message d'absence pour indiquer le moment de votre retour. Instant Messenger affiche ce message lorsque quelqu'un demande des informations vous concernant et r&eacute;pond automatiquement avec votre message d'absence &agrave; quelqu'un qui vous envoie un message lorsque vous &ecirc;tes absent.  </p>
<p>
<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_awaycreate">Cr&eacute;ation d'un message d'absence</a>  </p>
      <p><a href="#im_awayon">Activation et d&eacute;sactivation d'un message d'absence</a>  </p>
      <p><a href="#im_awaydelete">Suppression d'un message d'absence</a>  </p>
      </td>
  </tr>

  </tbody>
</table>
<p>&nbsp;</p> <a name="im_awaycreate"></a>  <a name="away_messages_AIM:creatingIDX"></a>
<h2>Cr&eacute;ation d'un message d'absence</h2>

<p>Pour cr&eacute;er un message d'absence :    </p>
<ol>
  <li>Ouvrez le menu Fen&ecirc;tre et s&eacute;lectionnez Instant Messenger. La fen&ecirc;tre autonome du r&eacute;pertoire de contacts s'affiche. Vous devez &ecirc;tre connect&eacute; &agrave; Instant Messenger pour afficher cette fen&ecirc;tre.</li>
  <li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.  </li>
  <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Absent. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.  </li>
  <li>Veillez &agrave; s&eacute;lectionner "R&eacute;pondre automatiquement par un message d'absence".  </li>
  <li>Pour cr&eacute;er un message, cliquez sur Nouveau message. La bo&icirc;te de dialogue Modifier le message d'absence s'affiche.</li>
  <li>Entrez l'intitul&eacute; du nouveau message d'absence dans le champ correspondant.  </li>
  <li>Tapez le message dans la zone "Message &agrave; envoyer lorsque vous recevez un message".</li>
  <li>Cliquez sur OK pour enregistrer les modifications et fermer la bo&icirc;te de dialogue.</li>

</ol>

<p>Instant Messenger ajoute le nouveau message &agrave; la liste des messages d'absence. Lorsque vous activez le message d'absence, il est envoy&eacute; aux utilisateurs qui vous transmettent un message instantan&eacute;.    </p>
 <p> [&nbsp;<a href="#im_away">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_awayon"></a>  <a name="away_messages_AIM:turning_onIDX"></a>  <a name="activating_away_messagesIDX"></a>

<h2>Activation et d&eacute;sactivation d'un message d'absence</h2>

<p>Pour activer ou d&eacute;sactiver le message d'absence&nbsp;:    </p>
<ol>
  <li>Ouvrez le menu Fen&ecirc;tre et s&eacute;lectionnez Instant Messenger. La fen&ecirc;tre de contacts AIM s'affiche. Vous devez &ecirc;tre connect&eacute; &agrave; Instant Messenger pour afficher cette fen&ecirc;tre.</li>
  <li>Cliquez sur le bouton du message d'absence <img src="chrome://aim/skin/btn2/away.gif"> ou sur la fl&egrave;che vers le bas en regard de ce bouton, puis s&eacute;lectionnez le message de votre choix dans le menu contextuel. </li>
  <li>Pour d&eacute;sactiver le message d'absence, cliquez sur "Pr&eacute;sent !" dans la fen&ecirc;tre Instant Messenger.</li>

</ol>

 <p> [&nbsp;<a href="#im_away">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_awaydelete"></a>  <a name="away_messages_AIM:deletingIDX"></a> <a name="deleting:away_messagesIDX"></a>
<h2>Suppression d'un message d'absence</h2>

<p>Pour supprimer un message d'absence&nbsp;:    </p>
<ol>
  <li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
  <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Absent. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.</li>
  <li>S&eacute;lectionnez le message d'absence &agrave; supprimer.  </li>
  <li>Cliquez sur Supprimer.</li>
  <li>Cliquez sur OK pour enregistrer vos modifications.</li>

</ol>

   <p> [&nbsp;<a href="#im_away">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="im_access"></a> <a name="Instant_Messenger:controlling_accessIDX"></a> <a name="controlling_accessSDX"></a>
<h1>Contr&ocirc;le d'acc&egrave;s</h1>


<p>Si un autre utilisateur d'Instant Messenger vous envoie des messages d&eacute;rangeants ou choquants, vous pouvez lui interdire de vous envoyer des messages.    </p>
<p>Vous pouvez &eacute;galement d&eacute;finir des pr&eacute;f&eacute;rences de confidentialit&eacute; pour d&eacute;terminer les utilisateurs autoris&eacute;s &agrave; vous envoyer des messages et la quantit&eacute; d'informations vous concernant accessible aux autres utilisateurs d'Instant Messenger.  </p>
<p>
<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_specifying_access">Sp&eacute;cification des personnes autoris&eacute;es &agrave; vous contacter</a>  </p>
      <p><a href="#im_blockuser">Blocage d'un utilisateur</a>    </p>
      </td>
  </tr>

  </tbody>
</table>
    </p>
<p>&nbsp;</p> <a name="im_specifying_access"></a>  <a name="Instant_Messenger:allowing_users_to_contact_youIDX"></a> <a name="allowing_contact_youSDX"></a>
<h2>Sp&eacute;cification des personnes autoris&eacute;es &agrave; vous contacter</h2>

<p>Proc&eacute;dez comme suit pour d&eacute;finir qui peut vous envoyer des messages et la quantit&eacute; d'informations vous concernant accessible aux autres utilisateurs&nbsp;:    </p>
<ol>
  <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Confidentialit&eacute;. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.</li>
  <li>Dans "Qui peut me contacter", s&eacute;lectionnez l'une des options suivantes&nbsp;:</li>

  <ul>
  <li><b>Tous les utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour n'emp&ecirc;cher personne de vous envoyer des messages.</li>
  <li><b>Autoriser uniquement les membres de mon liste contacts&nbsp;:</b> S&eacute;lectionnez cette option pour ne recevoir de messages que des membres de votre liste de contacts AIM.</li>
  <li><b>Autoriser ces utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour choisir les personnes autoris&eacute;es &agrave; vous envoyer des messages. Cliquez sur Ajouter et entrez le pseudonyme des personnes choisies.</li>
  <li><b>Emp&ecirc;cher tous les utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour ne recevoir de messages de personne.</li>
  <li><b>Bloquer ces utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour ne pas recevoir de messages de certaines personnes. Cliquez sur Ajouter et entrez le pseudonyme des personnes que vous souhaitez bloquer.</li>
  <li><b>Bloquer la r&eacute;ception des invitations&nbsp;:</b> S&eacute;lectionnez cette option pour emp&ecirc;cher l'affichage des messages &agrave; l'&eacute;cran lorsque quelqu'un veut vous inviter &agrave; discuter.</li>

  <li>Dans la partie inf&eacute;rieure de la bo&icirc;te de dialogue, utilisez la liste d&eacute;roulante pour choisir la quantit&eacute; d'informations &agrave; afficher aux utilisateurs connaissant votre adresse &eacute;lectronique.</li>
  <li>Cliquez sur OK.</li>
</ul>
</ol>
     <p> [&nbsp;<a href="#im_access">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

  <a name="im_blockuser"></a>  <a name="Instant_Messenger:blocking_usersIDX"></a> <a name="blocking_Instant_Messenger_usersIDX"></a> <a name="blocking_Instant_Messenger_usersSDX"></a>
<h2>Blocage d'un utilisateur</h2>

<p>Vous pouvez bloquer un ou plusieurs utilisateurs pour leur emp&ecirc;cher de vous envoyer des messages. Cette fonction est utile pour les utilisateurs envoyant des messages choquants ou si vous souhaitez simplement ne pas recevoir de messages pendant un certain temps.    </p>
<ol>
    <li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Confidentialit&eacute;. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.</li>
    <li>S&eacute;lectionnez "Emp&ecirc;cher tous les utilisateurs" ou "Bloquer ces utilisateurs".</li>
    <li>Si vous avez s&eacute;lectionn&eacute; "Bloquer ces utilisateurs", cliquez sur Ajouter et entrez le pseudonyme de la personne &agrave; bloquer.</li>

</ol>

<p>Pour supprimer une personne de la liste des utilisateurs bloqu&eacute;s, cliquez sur son pseudonyme puis sur Supprimer.       </p>
<p>Vous pouvez &eacute;galement bloquer directement un utilisateur dans la fen&ecirc;tre Instant Message&nbsp;: </p>

<ol>
  <li>Dans la fen&ecirc;tre Instant Message, cliquez sur le bouton Bloquer. </li>
  <li>Cliquez sur OK pour confirmer le blocage de l'utilisateur sp&eacute;cifique.</li>

</ol>

 <p> [&nbsp;<a href="#im_access">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="im_warnings"></a> <a name="warning_AIM_usersSDX"></a> <a name="warning_AIM_usersIDX"></a>
<h1>Bl&acirc;mes</h1>

<p>Si un autre utilisateur d'Instant Messenger vous envoie des messages d&eacute;rangeants ou choquants, vous avez deux solutions.  Vous pouvez le bl&acirc;mer ou le bloquer.  </p>
<p>
<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_warnuser">Bl&acirc;me d'un utilisateur</a>  </p>
      <p><a href="#im_warnview">Affichage du niveau de bl&acirc;me d'un utilisateur</a>  </p>
      </td>
  </tr>

  </tbody>
</table>
      </p>
<p>&nbsp;</p> <a name="im_warnuser"></a>  <a name="Instant_Messenger:warning_usersIDX"></a>
<h2>Bl&acirc;me d'un utilisateur</h2>

<p>Pour bl&acirc;mer un utilisateur qui vous a envoy&eacute; un message choquant, cliquez sur Bl&acirc;mer dans la fen&ecirc;tre Instant Message dans laquelle vous avez re&ccedil;u le message.    </p>
<p>La bl&acirc;me avertit l'exp&eacute;diteur et r&eacute;duit sa capacit&eacute; &agrave; envoyer et recevoir des messages. Apr&egrave;s des bl&acirc;mes fr&eacute;quents, l'utilisateur ne pourra plus &eacute;changer de messages avec quiconque. L'utilisateur ne pourra recommencer &agrave; envoyer et recevoir des messages qu'apr&egrave;s une p&eacute;riode de "r&eacute;flexion".    </p>
<p>Lorsque vous cliquez sur Bl&acirc;mer, vous pouvez choisir d'imposer un bl&acirc;me anonyme. Les bl&acirc;mes anonymes sont moins s&eacute;v&egrave;res et les utilisateurs les recevant n'en connaissent pas la provenance.    </p>
<p>A propos des bl&acirc;mes re&ccedil;us et envoy&eacute;s&nbsp;:  </p>
<ul>
  <li>Vous ne pouvez envoyer qu'un bl&acirc;me par message.</li>
  <li>Si un utilisateur vous bl&acirc;me, envisagez de mettre &agrave; fin &agrave; la conversation. Chaque nouveau message envoy&eacute; permet &agrave; cet utilisateur de vous bl&acirc;mer &agrave; nouveau.</li>

</ul>

<p>Vous pouvez &eacute;galement emp&ecirc;cher un ou plusieurs utilisateurs de vous envoyer des messages. Voir <a href="#im_blockuser">"Blocage d'un utilisateur"</a> pour plus d'informations.
 </p>
 <p> [&nbsp;<a href="#im_privacy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_warnview"></a>
<h2>Affichage du niveau de bl&acirc;me d'un utilisateur</h2>

<p>Le niveau de bl&acirc;me d'un utilisateur est affich&eacute; &agrave; c&ocirc;t&eacute; de son pseudonyme dans la fen&ecirc;tre de contacts AIM.    </p>
 <p> [&nbsp;<a href="#im_privacy">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>


<hr> <a name="im_trouble"></a> <a name="troubleshooting:Instant_MessengerIDX"></a> <a name="Instant_Messenger:troubleshootingIDX"></a>
  <h1>D&eacute;pannage</h1>

<p>
<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_cantsignon">Echec de connexion</a>  </p>
      <p><a href="#im_cantsee">Fen&ecirc;tre de contacts AIM vide</a>  </p>
      <p><a href="#im_cantsend">Echec d'envoi de messages instantan&eacute;s</a>  </p>
      </td>
  </tr>

  </tbody>
</table>
    </p>
<p>&nbsp;</p> <a name="im_cantsignon"></a> <a name="sign_on_problems_AIMSDX"></a>
<h2>Echec de connexion</h2>

<p>V&eacute;rifiez les &eacute;l&eacute;ments suivants&nbsp;:    </p>
<ul>
  <li>Le mot de passe entr&eacute; est-il valide&nbsp;? Le mot de passe est sensible &agrave; la casse, ce qui signifie que vous devez veiller au respect des majuscules et des minuscules. Faites une nouvelle tentative.</li>
    <li>Votre requ&ecirc;te de connexion a-t-elle &eacute;t&eacute; refus&eacute;e&nbsp;? Le cas &eacute;ch&eacute;ant, vous vous &ecirc;tes connect&eacute; trop souvent sur une courte p&eacute;riode. Attendez quelques minutes et r&eacute;essayez. De nouvelles tentatives de connexion prolongeront le d&eacute;lai d'attente n&eacute;cessaire.</li>
    <li>Etes-vous actuellement connect&eacute; &agrave; Internet&nbsp;?  Si ce n'est pas le cas, si vous avez pu vous connecter ult&eacute;rieurement, v&eacute;rifiez ce qui suit&nbsp;:</li>
</ul>

  <ul>
  <li>Votre connexion &agrave; un fournisseur de services Internet fonctionne-t-elle correctement&nbsp;? Si ce n'est pas le cas, contactez le fournisseur de votre connexion et pr&eacute;parez-vous &agrave; changer de configuration.</li>
    <li>Votre connexion en r&eacute;seau local fonctionne-t-elle correctement&nbsp;? Si ce n'est pas le cas, contactez l'administrateur r&eacute;seau et pr&eacute;parez-vous &agrave; changer de configuration.</li>

  </ul>


<p>Vous ne pourrez peut-&ecirc;tre pas vous connecter dans les cas suivants&nbsp;:    </p>
<ul>
  <li>En cas de probl&egrave;me DNS sur le r&eacute;seau ou aupr&egrave;s de votre fournisseur de services Internet.  Contactez votre fournisseur ou administrateur syst&egrave;me ou r&eacute;essayez ult&eacute;rieurement.</li>
    <li>Votre r&eacute;seau utilise un pare-feu.  Le cas &eacute;ch&eacute;ant, contactez l'administrateur syst&egrave;me pour plus d'informations sur la configuration d'un serveur proxy.  Une fois ces informations obtenues, vous devez les entrer dans vos pr&eacute;f&eacute;rences de connexion.
  </li>
    <li>Le service Instant Messenger est temporairement indisponible. Essayez de vous reconnecter ult&eacute;rieurement.</li>

</ul>

<p>Si aucun des cas ci-dessus ne vous concerne, un probl&egrave;me temporaire au niveau du r&eacute;seau emp&ecirc;che probablement toute connexion. Il vous suffit de patienter et de r&eacute;essayer ult&eacute;rieurement.    </p>
 <p> [&nbsp;<a href="#im_trouble">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_cantsee"></a> <a name="buddy_list_problems_AIMSDX"></a>

<h2>Fen&ecirc;tre de contacts AIM vide</h2>
<p>V&eacute;rifiez les points suivants&nbsp;:</p>
<ul>

<li>Avez-vous ajout&eacute; des contacts &agrave; votre liste&nbsp;? Si ce n'est pas le cas, cliquez sur l'onglet "Mes Contacts AIM" dans la fen&ecirc;tre de contacts AIM et cliquez sur le bouton Ajouter un contact.    </li>
<li>Affichez-vous l'onglet En ligne de la fen&ecirc;tre de liste du contacts&nbsp;? Si ce n'est pas le cas, cliquez sur l'onglet En ligne de la fen&ecirc;tre du liste de contacts AIM pour afficher les contacts en ligne.
  </li>
<li>L'un de vos contacts est-il connect&eacute;&nbsp;? Si ce n'est pas le cas, le liste de contacts AIM est vide. Dans le menu Contacts, choisissez Enregistrer un ami pour inviter un ami &agrave; s'inscrire au service Instant Messenger.    </li>
<li>L'option "Emp&ecirc;cher tous les utilisateurs" est-elle s&eacute;lectionn&eacute;e&nbsp;? Si c'est le cas, cela emp&ecirc;che tous les utilisateurs de vous voir et vous emp&ecirc;che d'afficher des contacts dans la fen&ecirc;tre de contacts. Pour d&eacute;s&eacute;lectionner cette option, dans le menu Edition, choisissez Pr&eacute;f&eacute;rences. Cliquez sur la cat&eacute;gorie Confidentialit&eacute; sous Instant Messenger et d&eacute;s&eacute;lectionnez l'option.    </li>
<li>Tous vos contacts vous ont-ils bloqu&eacute;&nbsp;? Si tel est le cas, dans le menu Contacts, choisissez Enregistrer un ami pour inviter un autre ami &agrave; s'inscrire au service AOL Instant Messenger.    </li>
</ul>
 <p> [&nbsp;<a href="#im_trouble">Retour au d&eacute;but de la section</a>&nbsp;]

<p>&nbsp;</p>

  <a name="im_cantsend"></a> <a name="sending_problems_AIMSDX"></a>

<h2>Echec d'envoi de messages instantan&eacute;s</h2>
<p>V&eacute;rifiez les points suivants&nbsp;:</p>
<ul>

<li>Votre contact bloque-t-il votre message instantan&eacute;&nbsp;? Si tel est le cas, dans le menu Contacts, choisissez Enregistrer un ami pour inviter un autre ami &agrave; s'inscrire au service AOL Instant Messenger.    </li>
<li>Votre contact est-il connect&eacute;&nbsp;? Si ce n'est pas le cas, vous devez attendre et r&eacute;essayer ult&eacute;rieurement, lorsqu'il sera connect&eacute;.    </li>
</ul>
 <p> [&nbsp;<a href="#im_trouble">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="im_prefs"></a> <a name="preferences:AIMIDX"></a>
<h1>D&eacute;finition des pr&eacute;f&eacute;rences d'Instant Messenger</h1>

<p>Si vous avez d&eacute;j&agrave; utilis&eacute; une autre version d'AOL Instant Messenger et install&eacute; Netscape 7.0 sur votre machine, vous devrez red&eacute;finir vos pr&eacute;f&eacute;rences. Contrairement aux liste de contacts AIM, les pr&eacute;f&eacute;rences ne sont pas transf&eacute;r&eacute;es automatiquement entre les diff&eacute;rentes versions d'AIM.  </p>


<table cellspacing="2" cellpadding="4" width="324" bgcolor="#cccccc">
  <tbody>
    <tr>
  <td class="inthissection">
      <p>Dans cette section&nbsp;:  </p>
      <p><a href="#im_gen">Pr&eacute;f&eacute;rences g&eacute;n&eacute;rales d'AIM</a>  </p>
      <p><a href="#im_privacypref">Confidentialit&eacute;</a>
  </p>
<p><a href="#im_buddyiconpref">Ic&ocirc;nes des contacts</a>
  </p>

      <p><a href="#im_notif">Notification</a>
  </p>
      <p><a href="#im_awaypref">Absent</a>
      </p>
<p><a href="#im_stylespref">Styles</a>
  </p>

      <p><a href="#im_connect">Connexion</a>
  </p>
      </td>
  </tr>

  </tbody>
</table>

<p>&nbsp;</p> <a name="im_gen"></a> <a name="AIM_preferencesSDX"></a> <a name="preferences_AIMSDX"></a>

 <a name="im_genpref"></a>
<h2>Pr&eacute;f&eacute;rences d'Instant Messenger &ndash; G&eacute;n&eacute;ral</h2>


<p>Cette section vous explique comment utiliser le panneau des pr&eacute;f&eacute;rences d'Instant Messenger en vue de configurer les param&egrave;tres g&eacute;n&eacute;raux des messages. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
    <li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Cliquez sur Instant Messenger.</li>
</ol>


<p>Dans la section "Connexion &agrave; Instant Messenger" du panneau, d&eacute;finissez vos pr&eacute;f&eacute;rences pour les options suivantes&nbsp;:    </p>
<ul>
<li><b>Lancer automatiquement au d&eacute;marrage du syst&egrave;me&nbsp;:</b> Instant Messenger est configur&eacute; pour s'ex&eacute;cuter automatiquement au d&eacute;marrage de votre ordinateur. Si vous ne souhaitez pas utiliser cette option, il vous suffit de la d&eacute;s&eacute;lectionner. Cette option est disponible &agrave; condition qu'elle soit prise en charge sur votre syst&egrave;me et que vous n'ayez pas encore configur&eacute; le lancement automatique du client ICQ autonome ou d'une autre version du client AOL IM.</li>
<p>Cette option est contr&ocirc;l&eacute;e par la pr&eacute;f&eacute;rence principale d'Instant Messenger. Cependant, elle reste active, que vous utilisiez AIM pour Netscape ou ICQ pour Netscape. Elle ouvre la fen&ecirc;tre AIM (ou ICQ), mais n'ouvre pas de session automatiquement, sauf si vous avez &eacute;galement s&eacute;lectionn&eacute; l'option "S'identifier au lancement" dans AIM ou "Connexion au d&eacute;marrage " dans ICQ.</p>
<!--<li><b>Afficher la fen&ecirc;tre Aujourd'hui &agrave; la connexion :</b> Cette option ouvre le mini navigateur Today au lieu de le laisser ferm&eacute; jusqu'&agrave; ce que vous cliquiez sur le bouton Aujourd'hui.</li>-->
<li><b>D&eacute;sactiver la connexion automatique aux sites Web &agrave; l'aide du service de pseudonyme:</b> Cette option inverse la configuration par d&eacute;faut selon laquelle vous &ecirc;tes connect&eacute; automatiquement aux sites d&eacute;finis pour utiliser votre pseudonyme et votre mot de passe AOL.</li>
</ul>
<p>Dans la section "Cr&eacute;ation et mise en forme de messages" du panneau, d&eacute;finissez vos pr&eacute;f&eacute;rences pour les options suivantes&nbsp;:    </p>
<ul>
<li><b>Passer &agrave; la ligne avec la touche Entr&eacute;e&nbsp;:</b> Pour que la touche Entr&eacute;e ins&egrave;re un saut de ligne, cochez cette option. D&eacute;s&eacute;lectionnez-la pour que la touche Entr&eacute;e envoie le message.</li>
<li><b>Ins&eacute;rer un retrait avec la touche Tab&nbsp;:</b> Pour que la touche Tab ins&egrave;re une tabulation, cochez cette option. D&eacute;s&eacute;lectionnez-la pour que la touche Tab permette de basculer d'un champ &agrave; l'autre dans la fen&ecirc;tre Instant Message.</li>
<li><b>Afficher l'heure des messages dans les nouvelles fen&ecirc;tres:</b> Pour que les messages envoy&eacute;s et re&ccedil;us indiquent leur heure d'envoi, cochez cette option. Notez que vous pouvez modifier ce param&egrave;tre pour chaque message. Cette pr&eacute;f&eacute;rence d&eacute;termine l'utilisation par d&eacute;faut de l'heure. </li>
<li><b>Afficher les &eacute;moticons comme des images&nbsp;:</b> Cette option permet de d&eacute;finir si les &eacute;moticons (ou smileys) s'affichent dans les messages instantan&eacute;s ou de discussion.  </li>
</ul>
<p>Dans la section "Cr&eacute;ation et mise en forme de messages" du panneau, d&eacute;finissez vos pr&eacute;f&eacute;rences pour les options suivantes&nbsp;:    </p>
<ul>
  <li><b>Afficher l'&eacute;tat en ligne dans l'enveloppe du message&nbsp;:</b> Pour afficher l'ic&ocirc;ne de pr&eacute;sence en ligne <img src="chrome://aim/skin/icons/biActive.gif"> pour tous les contacts en ligne dans l'enveloppe d'un message Netscape Messagerie &amp; Forums, cochez cette option.   </li>
</ul>

 <p> [&nbsp;<a href="#im_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_privacypref"></a>  <a name="Instant_Messenger:privacyIDX"></a> <a name="Instant_Messenger_privacySDX"></a>

<h2>Pr&eacute;f&eacute;rences d'Instant Messenger &ndash; Confidentialit&eacute;</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Confidentialit&eacute; d'Instant Messenger. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
<li>Connectez-vous &agrave; AIM. Vous devez &ecirc;tre connect&eacute; pour &ecirc;tre en mesure de modifier les pr&eacute;f&eacute;rences de confidentialit&eacute;.</li>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Confidentialit&eacute;. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.</li>
</ol>
<p>Dans la section "Qui peut me contacter" de ce panneau, cliquez sur la case en regard des options propos&eacute;es afin de d&eacute;finir vos pr&eacute;f&eacute;rences pour les options suivantes&nbsp;:    </p>
<ul>
  <li><b>Tous les utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour n'emp&ecirc;cher personne de vous envoyer des messages.</li>
  <li><b>Autoriser uniquement les membres de mon liste de contacts&nbsp;:</b> S&eacute;lectionnez cette option pour ne recevoir de messages que des membres de votre liste de contacts AIM.</li>
  <li><b>Autoriser ces utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour choisir les personnes autoris&eacute;es &agrave; vous envoyer des messages. Cliquez sur Ajouter et entrez le pseudonyme des personnes choisies.</li>
  <li><b>Emp&ecirc;cher tous les utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour ne recevoir de messages de personne.</li>
  <li><b>Bloquer ces utilisateurs&nbsp;:</b> S&eacute;lectionnez cette option pour ne pas recevoir de messages de certaines personnes. Cliquez sur Ajouter et entrez le pseudonyme des personnes choisies.</li>
  <li><b>Bloquer la r&eacute;ception des invitations&nbsp;:</b> Cochez cette case pour emp&ecirc;cher l'affichage des messages &agrave; l'&eacute;cran lorsque quelqu'un veut vous inviter &agrave; discuter.</li>
<li><b>Communiquer aux autres utilisateurs mon d&eacute;lai d'inactivit&eacute;&nbsp;:</b> Cochez cette case si vous souhaitez que les autres utilisateurs sachent quand vous vous absentez de votre poste de travail (inactif), ainsi que la dur&eacute;e d'inactivit&eacute;.</li>
</ul>
  <p>Dans la section "Permettre aux utilisateurs qui connaissent mon adresse &eacute;lectronique de voir" de ce panneau, s&eacute;lectionnez l'une des options suivantes dans la liste d&eacute;roulante&nbsp;:</p>
    <ul>
  	<li><b>Mon pseudonyme&nbsp;:</b> Choisissez cette option pour permettre aux utilisateurs qui connaissent votre adresse &eacute;lectronique de trouver votre pseudonyme &agrave; l'aide de la fonction Rechercher un contact.
 	</li>
      <li><b>Savoir que je suis enregistr&eacute; &agrave; AIM&nbsp;:</b> Choisissez cette option pour permettre aux utilisateurs qui connaissent votre adresse &eacute;lectronique de savoir uniquement que vous poss&eacute;dez un compte &agrave; l'aide de la fonction Rechercher un contact.  	</li>
  	<li>  	<b>Ne rien apprendre de moi&nbsp;:</b> Choisissez cette option pour n'offrir aux utilisateurs qui connaissent votre adresse &eacute;lectronique aucune possibilit&eacute; d'apprendre quoi que ce soit sur vous &agrave; l'aide de la fonction Rechercher un contact.  	</li>

    </ul>


 <p> [&nbsp;<a href="#im_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>


<p>&nbsp;</p> <a name="im_buddyiconspref"></a> <a name="Instant_Messenger:buddy_iconsIDX"></a> <a name=buddy_iconsSDX></a> <a name=buddy_iconsIDX></a>
<h2>Pr&eacute;f&eacute;rences d'Instant Messenger &mdash; Ic&ocirc;nes des contacts</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Ic&ocirc;nes des contacts d'Instant Messenger. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
<li>Connectez-vous &agrave; AIM. Vous devez &ecirc;tre connect&eacute; pour &ecirc;tre en mesure de modifier les pr&eacute;f&eacute;rences des ic&ocirc;nes de contact.</li>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
<li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Ic&ocirc;nes des contacts. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.</li>

</ol>
<p>Le panneau de pr&eacute;f&eacute;rences Ic&ocirc;nes des contacts vous permet de s&eacute;lectionner une ic&ocirc;ne qui sera envoy&eacute;e avec tous les messages instantan&eacute;s. Il vous offre &eacute;galement la possibilit&eacute; de choisir une ic&ocirc;ne pour un ou plusieurs amis de votre liste de contacts AIM. Enfin, il vous permet de configurer vos pr&eacute;f&eacute;rences en tant que destinataire.
<p>Pour configurer vos pr&eacute;f&eacute;rences en mati&egrave;re d'ic&ocirc;nes de contact en tant qu'exp&eacute;diteur, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
<li>Choisissez une ic&ocirc;ne de contact dans l'une des cat&eacute;gories affich&eacute;es dans le panneau des pr&eacute;f&eacute;rences.</li>
<li>Vous pouvez &eacute;galement parcourir votre disque dur &agrave; la recherche d'une image &agrave; utiliser.</li></ol>
<p>Plusieurs formats d'image sont accept&eacute;s&nbsp;: .gif, .jpg, .bmp, .ico et .xbm. La taille maximale de l'image est limit&eacute;e &agrave; 7&nbsp;168&nbsp;octets. Que vous choisissiez l'une des images pr&eacute;d&eacute;finies ou optiez pour une image personnelle, le syst&egrave;me proc&eacute;dera &agrave; son redimensionnement afin de la faire tenir dans la section sup&eacute;rieure gauche du panneau. Lorsque vous envoyez un message instantan&eacute;, l'ic&ocirc;ne s'affiche dans la partie inf&eacute;rieure de la fen&ecirc;tre de message.</p>
<p>Pour d&eacute;finir une ic&ocirc;ne de contact pour un membre de votre liste de contacts AIM, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
<li>S&eacute;lectionnez le nom du contact pour lequel vous souhaitez d&eacute;finir une ic&ocirc;ne.</li>
<li>Choisissez une ic&ocirc;ne de contact dans l'une des cat&eacute;gories affich&eacute;es dans le panneau des pr&eacute;f&eacute;rences.</li>
<li>Vous pouvez &eacute;galement parcourir votre disque dur &agrave; la recherche d'une image &agrave; utiliser.</li></ol>
<p>Plusieurs formats d'image sont accept&eacute;s&nbsp;: .gif, .jpg, .bmp, .ico et .xbm. La taille maximale de l'image est limit&eacute;e &agrave; 7&nbsp;168&nbsp;octets. Que vous choisissiez l'une des images pr&eacute;d&eacute;finies ou optiez pour une image personnelle, le syst&egrave;me proc&eacute;dera &agrave; son redimensionnement afin de la faire tenir dans la section sup&eacute;rieure gauche du panneau. Lorsque vous envoyez un message instantan&eacute;, l'ic&ocirc;ne s'affiche dans la partie inf&eacute;rieure de la fen&ecirc;tre de message.</p>
<p><b>Remarque&nbsp;:</b> L'ic&ocirc;ne que vous avez attribu&eacute;e au contact remplace toute ic&ocirc;ne que ce dernier aurait pu d&eacute;finir. Lorsque vous recevrez des images de ce contact, vous verrez s'afficher l'ic&ocirc;ne que vous lui avez affect&eacute;e. Si le contact a d&eacute;fini une ic&ocirc;ne, celle-ci ne sera pas visible.</p>


<p>Pour configurer vos pr&eacute;f&eacute;rences en mati&egrave;re d'ic&ocirc;nes de contact en tant que destinataire, proc&eacute;dez comme suit&nbsp;:</p>
<ul><li>Dans la section Afficher les ic&ocirc;nes des contacts, les options suivantes sont disponibles&nbsp;: Accepter des utilisateurs de la liste de contacts, Ne jamais accepter les ic&ocirc;nes des contacts et Ne jamais afficher les ic&ocirc;nes des contacts.</li>
<li>Vous pouvez &eacute;galement cocher la case Afficher une bo&icirc;te de dialogue.</li>
</ul>
<p>Si vous cochez cette case, une bo&icirc;te de dialogue s'affichera &agrave; chaque fois qu'un contact vous enverra un message accompagn&eacute; d'une ic&ocirc;ne. Dans ce cas, vous aurez la possibilit&eacute; d'accepter ou de refuser l'ic&ocirc;ne au cas par cas.</p>
<p><b>Remarque&nbsp;:</b> Le refus des ic&ocirc;nes de contact et le blocage des utilisateurs sont deux notions bien distinctes. Ainsi, vous continuerez &agrave; recevoir les messages instantan&eacute;s envoy&eacute;s par les contacts non bloqu&eacute;s m&ecirc;me si vous refusez toutes les ic&ocirc;nes de contact. Les messages s'afficheront simplement sans ic&ocirc;nes.</p>
<p>&nbsp;</p> <a name="im_notif"></a> <a name="Instant_Messenger:notificationIDX"></a> <a name=notification,AIMSDX></a> <a name=notification,AIMIDX></a>
<h2>Pr&eacute;f&eacute;rences d'Instant Messenger &ndash; Notification</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Notification d'Instant Messenger. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
    <li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Notification. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.</li>
</ol>



<p>S&eacute;lectionnez les options disponibles afin de d&eacute;finir vos pr&eacute;f&eacute;rences pour les fonctions suivantes&nbsp;:    </p>
<ul>
  <li><b>Emettre un son lors de&nbsp;:</b> Si vous cochez cette case, le syst&egrave;me &eacute;mettra un son par d&eacute;faut pour tous les &eacute;v&eacute;nements r&eacute;pertori&eacute;s. D&eacute;s&eacute;lectionnez les &eacute;v&eacute;nements pour lesquels vous ne souhaitez pas entendre de son. Vous pouvez localiser un son en cliquant sur le bouton Parcourir. Acc&eacute;dez ensuite au Panneau de configuration, puis double-cliquez sur Sons et multim&eacute;dia. Apr&egrave;s avoir choisi un son, vous pouvez l'&eacute;couter en cliquant sur le bouton Aper&ccedil;u. Le signal sonore par d&eacute;faut est &eacute;mis si vous d&eacute;cidez de lire un son, mais ne sp&eacute;cifiez aucune option personnelle.</li>
  <li><b>Faire clignoter la fen&ecirc;tre de discussion lors de la r&eacute;ception de messages&nbsp;:</b> Cochez cette case pour que la fen&ecirc;tre de discussion clignote lorsque quelqu'un vous envoie un message de discussion pendant que vous travaillez dans une autre fen&ecirc;tre.  </li>
  <li><b>Afficher les annonces lorsque les utilisateurs entrent et sortent du salon&nbsp;:</b> Cochez cette case pour afficher une annonce lorsque des utilisateurs entrent et sortent d'un salon de discussion.  </li>

</ul>


<p> [&nbsp;<a href="#im_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="im_awaypref"></a>
<h2>Pr&eacute;f&eacute;rences d'Instant Messenger &ndash; Absent</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Absent d'Instant Messenger. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
<li>Connectez-vous &agrave; AIM. Vous devez &ecirc;tre connect&eacute; pour &ecirc;tre en mesure de modifier les pr&eacute;f&eacute;rences du panneau Absent.</li>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
<li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Absent. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste.</li>
</ol>


<p>Cochez les cases correspondant &agrave; vos pr&eacute;f&eacute;rences parmi les suivantes&nbsp;:    </p>
<ul>
<li><b>R&eacute;pondre automatiquement par un message d'absence&nbsp;:</b> Si vous s&eacute;lectionnez cette option et activez votre message d'absence, il est automatiquement transmis &agrave; ceux qui vous envoient un message. Pour activer le message, cliquez sur le bouton de message d'absence <img src="chrome://aim/skin/btn2/away.gif"> dans la fen&ecirc;tre du contacts AIM ou sur la fl&egrave;che vers le bas en regard de ce bouton, puis s&eacute;lectionnez le message de votre choix dans le menu d&eacute;roulant qui s'affiche.</li>
<li><b>D&eacute;sactiver les sons pendant mon absence&nbsp;:</b> Si vous s&eacute;lectionnez cette option, Netscape Instant Messenger n'&eacute;met aucun son lorsque vos contacts vous envoient des messages instantan&eacute;s en votre absence.</li>
<li><b>Nouveau message&nbsp;:</b>Pour ajouter un message d'absence, cliquez sur Nouveau message et entrez un intitul&eacute; et un corps de message dans les champs de texte. S&eacute;lectionnez un message et cliquez sur Edition ou Supprimer pour le modifier ou le supprimer.</li>

</ul>

<p> [&nbsp;<a href="#im_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

  <a name="im_stylepref"></a>  <a name="Instant_Messenger:stylesIDX"></a> <a name="Instant_Messenger_Preferences_&mdash;_Styles"></a>
<h2>Pr&eacute;f&eacute;rences d'Instant Messenger &ndash; Styles</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Styles d'Instant Messenger. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
 <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Styles. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Instant Messenger pour d&eacute;velopper la liste. Pour plus d'informations sur la cr&eacute;ation de styles pour chaque message, consultez la rubrique <a href="#Adding_Styles_and_Formats">Ajout de styles et de formats</a>.</li>
</ol>

<p>Voici la description des options de la section Styles&nbsp;:</p>

<p><b>Police</b>    </p>

<p>La liste d&eacute;roulante Polices vous permet de s&eacute;lectionner le type de police qui sera utilis&eacute; lors de la composition des messages, &agrave; savoir&nbsp;: police &agrave; chasse fixe ou variable. Vous pouvez &eacute;galement choisir le nom d'une police &agrave; utiliser. Arial, Helvetica, Courier et Times constituent les options standard.</p>

<p>S&eacute;lectionnez la taille de votre police&nbsp;: petite, moyenne ou grande.</p>

<p><b>Styles de texte</b>    </p>

<p>Dans la section Styles de texte, vous pouvez faire en sorte que votre texte apparaisse en gras, en italique ou soulign&eacute;. Si vous cliquez sur Aucun (Normal), votre texte appara&icirc;tra au format standard.</p>
<p><b>Couleurs du texte et de l'arri&egrave;re-plan&nbsp;:</b>    </p>
<p>Si vous cliquez sur le bouton Texte ou Arri&egrave;re-plan dans la section Couleurs du texte et de l'arri&egrave;re-plan, une palette de couleurs appara&icirc;t. Vous avez alors la possibilit&eacute; de choisir une couleur pour le texte ou l'arri&egrave;re-plan en fonction du bouton sur lequel vous avez cliqu&eacute;. </p>

<p>Ces pr&eacute;f&eacute;rences sont activ&eacute;es d&egrave;s que vous cliquez sur OK. Ces options de couleur et de police sont parfois d&eacute;sign&eacute;es sous le nom g&eacute;n&eacute;rique de "crayon". <a name="Instant_Messenger:penIDX"></a></p>

<p> [&nbsp;<a href="#im_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<p>&nbsp;</p>

<a name="im_connect"></a>  <a name="Instant_Messenger:connection_settingsIDX"></a>
<h2>Pr&eacute;f&eacute;rences d'Instant Messenger &ndash; Connexion</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau Connexion AIM. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:</p>
<ol>
    <li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>
    <li>Sous la cat&eacute;gorie Instant Messenger, cliquez sur Connexion. Si aucune sous-cat&eacute;gorie n'est visible, cliquez sur ICQ pour d&eacute;velopper la liste.</li>
</ol>

<p>Si vous acc&eacute;dez &agrave; Internet par le biais d'un fournisseur d'acc&egrave;s &agrave; Internet, vous ne devrez probablement pas modifier la bo&icirc;te de dialogue de pr&eacute;f&eacute;rences de connexion. Si vous acc&eacute;dez &agrave; Internet au travers du pare-feu d'un r&eacute;seau local (par exemple, sur votre lieu de travail), votre administrateur r&eacute;seau peut devoir vous communiquer des informations afin que vous puissiez configurer la partie Serveur Proxy de la section Connexion.    </p>
<p><b>H&ocirc;te</b>    </p>
<p>Ce champ contient l'adresse Internet du serveur de messagerie instantan&eacute;e int&eacute;gr&eacute; de Netscape, lequel prend en charge AOL Instant Messenger pour Netscape et ICQ pour Netscape. Normalement, vous ne devez pas modifier cette zone. Si votre serveur proxy doit r&eacute;soudre le nom d'h&ocirc;te, il peut &ecirc;tre n&eacute;cessaire d'entrer l'adresse IP plut&ocirc;t que le nom du serveur dans cette zone. Vous pouvez obtenir cette adresse&nbsp;IP aupr&egrave;s de votre administrateur r&eacute;seau.   </p>
<p><b>Port</b>    </p>
<p>Cette zone contient le num&eacute;ro du port par d&eacute;faut &agrave; utiliser sur le serveur de messagerie instantan&eacute;e int&eacute;gr&eacute; de Netscape. Normalement, vous ne devez pas modifier cette zone.     </p>
<p><b>Se connecter par proxy</b>    </p>
<p>Si vous cochez cette case, le logiciel Instant Messenger active les commandes du serveur proxy.  Entrez les informations ci-dessous apr&egrave;s les avoir demand&eacute;es &agrave; votre administrateur r&eacute;seau.  </p>
<p><b>H&ocirc;te (Serveur Proxy)</b>    </p>
<p>Entrez le nom du serveur proxy d&eacute;fini par votre administrateur r&eacute;seau.    </p>
<p><b>Port (Serveur Proxy)</b>    </p>
<p>Entrez le num&eacute;ro de port d&eacute;fini par votre administrateur r&eacute;seau.    </p>
<p><b>Nom d'utilisateur (Authentification)</b>    </p>

<p>Entrez le nom de l'utilisateur authentifi&eacute; d&eacute;fini par votre administrateur r&eacute;seau.    </p>
<p><b>Mot de passe (Authentification)</b>    </p>
<p>Entrez le mot de passe d'authentification d&eacute;fini par votre administrateur r&eacute;seau.    </p>
<p><b>Protocole</b>    </p>
<p>Indiquez le protocole sp&eacute;cifi&eacute; par votre administrateur r&eacute;seau&nbsp;: SOCKS 4, SOCKS 5, HTTPS ou HTTP.</p>
 <p> [&nbsp;<a href="#icq_prefs">Retour au d&eacute;but de la section</a>&nbsp;]</p>
<hr>
<p><i>
  <!-- #BeginDate format:Sw1 -->19 juin 2002<!-- #EndDate --> </i></p>
<hr>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation.

</body>
</html>
