<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Utilisation du logiciel Messagerie &amp; forums de Netscape</title> <link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">
</head>
<body bgcolor="#FFFFFF">

<a name="using_mailSDX"></a> <a name="starting_mailSDX"></a> <a name="opening_mailSDX"></a> <a name="mail_using"></a>

<div class="boilerplate">Ce document est fourni par Nestcape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>
<hr>
<h1>Utilisation du logiciel Messagerie &amp; forums de Netscape</h1>

<p>Netscape Messagerie &amp; et forums permet d&eacute;sormais de g&eacute;rer toutes vos communications Internet &agrave; partir d'un seul et m&ecirc;me endroit. Vous pouvez configurer et g&eacute;rer plusieurs comptes de messagerie professionnels et priv&eacute;s ainsi que des forums Internet, le tout &agrave; partir d'une seule et m&ecirc;me fen&ecirc;tre &mdash; la fen&ecirc;tre Messagerie &amp; forums. Vous pouvez en outre acc&eacute;der aux comptes de messagerie tant Netscape Webmail qu'AOL &agrave; partir de la fen&ecirc;tre Messagerie &amp; forums.</p>

<p>Pour commencer &agrave; utiliser Netscape Mail &amp; forums :</p>

<ul>
<li>Cliquez sur l'ic&ocirc;ne Messagerie &amp; forums dans l'angle inf&eacute;rieur gauche d'une fen&ecirc;tre Netscape Navigator.</li>
</ul>

<table>
<tr>
<td colspan="4"> <img src="images/mailicon.gif" hspace="0" vspace= "0"></td>
</tr>

<tr>
<td width="20"><b>&nbsp;</b></td>
<td><b>Ic&ocirc;ne Messagerie &amp; forums</b></td>
</tr>
</table>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="370" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#mail_start">Premiers pas dans Netscape Messagerie &amp; forums</a></p>

<p><a href="#READING_MESSAGES">Lecture de messages</a></p>

<p><a href="#SENDING_MESSAGES">Envoi de messages</a></p>

<p><a href="#CREATE_HTML">Cr&eacute;ation de messages en HTML</a></p>

<p><a href="#USING_ATTACHMENTS">Utilisation de pi&egrave;ces jointes</a></p>

<p><a href="#about_deleting_email">Suppression de messages</a></p>

<p><a href="#use_add_book">Utilisation des carnets d'adresses</a></p>

<p><a href="#ORGANIZING_MAIL">Organisation des messages</a></p>

<p><a href="#importing_mail">Importation de messages d'autres programmes</a></p>

<p><a href="#STARTING_NEWSGROUPS">Premiers pas dans les forums</a></p>

<p><a href="#WORKING_OFFLINE">Travail hors ligne</a></p>

<p><a href="mail_sec_help.html#secure_mail_first">Signature et chiffrement des messages</a></p>

<p><a href="#account_settings_intro">Param&egrave;tres de compte de messagerie/forum</a></p>

<p><a href="#SETTING_MAIL_PREFS">Pr&eacute;f&eacute;rences de messagerie et forums</a></p>
</td>
</tr>
</table>



<hr> <a name="mail_start"></a>
<h1>Pr&eacute;sentation de Netscape Messagerie &amp; forums</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="420" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#MAIL_NEWS_WIZARD">Utilisation de l'assistant de configuration de compte de messagerie</a></p>

<p><a href="#account_settings">Configuration d'autres comptes de messagerie et de forum</a></p>

<p><a href="#account_settings_change">Modification des param&egrave;tres d'un compte</a></p>

<p><a href="#INSTANT_MESSENGER">Utilisation d'AOL Instant Messenger avec Netscape Messagerie &amp; forums</p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="AOL_accountSDX"></a> <a name="new_AOL_accountSDX"></a> <a name="newsgroup_accountSDX"></a> <a name="news_accountSDX"></a> <a name="new_news_accountSDX"></a> <a name="new_newsgroup_accountSDX"></a> <a name="IMAP_accountSDX"></a> <a name="new_IMAP_accountSDX"></a> <a name="pop_accountSDX"></a> <a name="new_pop_accountSDX"></a> <a name="Mail_and_Newsgroups:Account_Setup_WizardIDX"></a> <a name="MAIL_NEWS_WIZARD"></a>

<h2>Utilisation de l'assistant de configuration de compte de messagerie</h2>

<a name="NEWSGROUP"></a>

<p>Pour configurer un compte de messagerie ou de forum, ouvrez le menu Fen&ecirc;tre et choisissez Messagerie &amp; forums. Si vous n'avez pas encore configur&eacute; un compte, l'Assistant des comptes appara&icirc;t automatiquement, vous permettant de configurer un compte.</p>

<p>L'Assistant des comptes vous guide dans la cr&eacute;ation d'un nouveau compte. Si vous ignorez un param&egrave;tre, cliquez sur Annuler et consultez votre fournisseur d'acc&egrave;s &agrave; Internet (FAI) ou le service d'assistance.</p>

<p>Si un compte est d&eacute;j&agrave; d&eacute;fini, l'Assistant des comptes n'appara&icirc;t pas automatiquement lorsque la fen&ecirc;tre Mail s'ouvre. Apr&egrave;s avoir ouvert la fen&ecirc;tre Mail, ouvrez le menu Fichier et choisissez Nouveau, puis Compte. Pour plus de d&eacute;tails, voir <a href="#account_settings">Configuration d'autres comptes de messagerie et de forum</a>.</p>

<p>&nbsp;</p>

<a name="AOL_Mail:setting_upIDX"></a> <a name="Netscape_Webmail:setting_upIDX"></a> <a name="AOL_WebMail"></a>

<h3>Configuration d'un compte AOL ou Netscape WebMail</h3>

<p>America Online (AOL) est un des FAI les plus populaires. Netscape Webmail est un service de messagerie gratuit facile d'emploi et accessible partout.</p>

<p>Si vous avez d&eacute;j&agrave; un compte AOL ou Netscape Webmail, vous pouvez utiliser l'Assistant des comptes pour configurer Netscape Messagerie &amp; forums afin d'acc&eacute;der au courrier &agrave; partir de votre compte. Dans le menu Edition, choisissez Param&egrave;tres de compte de messagerie/forum, puis cliquez sur Ajouter un compte.</p>

<p>Si vous n'avez pas encore de compte Netscape Webmail, vous pouvez demander un compte gratuit en cliquant sur l'ic&ocirc;ne "WebMail Gratuit" dans le volet des dossiers.</p>

<p><strong>Remarque</strong>&nbsp;: AOL Instant Messenger doit &ecirc;tre install&eacute; pour que vous puissiez configurer et utiliser un compte AOL ou Netscape Webmail. AOL Instant Messenger est install&eacute; par d&eacute;faut lorsque vous installez Netscape 7.0.</p>

<p>&nbsp;</p>

<h3>Configuration de comptes avec un FAI ou fournisseur de messagerie</h3>

<p>Avant de configurer un compte de messagerie, vous devez avoir obtenu de votre FAI ou fournisseur de messagerie les informations suivantes :</p>

<ul>
<li>votre nom d'utilisateur</li>

<li>votre adresse &eacute;lectronique</li>

<li>le nom des serveurs de messagerie entrant et sortant</li>

<li>le type de serveur entrant (<a href= "glossary.html#IMAP_glossary">IMAP</a> ou <a href= "glossary.html#POP_glossary">POP</a>)</li>
</ul>

<p>Avant de configurer un compte de forum, vous devez avoir obtenu de votre FAI ou fournisseur de messagerie les informations suivantes :</p>

<ul>
<li>votre adresse &eacute;lectronique</li>

<li>le nom du serveur de forums</li>

<li>le nom du compte</li>
</ul>

<p>Pour configurer un nouveau compte de messagerie ou de forum, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>Cliquez sur Ajouter un compte pour lancer l'Assistant des comptes.

<p>Les informations demand&eacute;es par l'Assistant des comptes d&eacute;pendent du type de nouveau compte que vous sp&eacute;cifiez dans la premi&egrave;re fen&ecirc;tre. Les titres en gras ci-dessous correspondent aux fen&ecirc;tres qui appara&icirc;tront pendant la configuration d'un compte FAI ou de fournisseur de messagerie.</p>
</li>

<li><b>Configuration d'un nouveau compte :</b> Choisissez le type de compte &agrave; configurer, puis cliquez sur Suivant.</li>

<li><b>Identit&eacute; :</b> Entrez le nom et l'adresse &eacute;lectronique appropri&eacute;s pour ce compte, puis cliquez sur Suivant.</li>

<li><b>Informations sur le serveur :</b> Indiquez si vous voulez un compte POP ou un compte IMAP. Tous les FAI prennent en charge les deux options. Pour plus d'informations, voir  <a href= "#IMAP_and_POP3">Param&egrave;tres de compte de messagerie/forum - Param&egrave;tres du serveur</a>.


<p>Vous devez &eacute;galement indiquer le nom de votre serveur de messagerie entrant et de votre serveur sortant (SMTP). C'est le nom du serveur de messagerie qui envoie vos messages (&eacute;galement appel&eacute; "h&ocirc;te SMTP"). Cliquez sur Suivant pour continuer.</p>


<p><b>Remarque</b>&nbsp;: Vous ne devez sp&eacute;cifier qu'un seul serveur de messagerie sortant (SMTP), m&ecirc;me si vous disposez de plusieurs comptes de messagerie. Le nom de votre h&ocirc;te SMTP n'est pas n&eacute;cessairement indiqu&eacute; de mani&egrave;re explicite dans les informations de configuration de compte qui vous ont &eacute;t&eacute; fournies. Par exemple, l'h&ocirc;te SMTP peut &ecirc;tre identique &agrave; l'h&ocirc;te POP3 ou IMAP. En cas de doute, contactez votre FAI ou administrateur syst&egrave;me.</p>
</li>

<li><b>Nom d'utilisateur :</b> Entrez le nom d'utilisateur que vous a attribu&eacute; votre FAI ou votre fournisseur de messagerie, puis cliquez sur Suivant.</li>

<li><b>Nom du compte :</b> Entrez le nom que vous souhaitez utiliser pour vous r&eacute;f&eacute;rer &agrave; ce compte, puis cliquez sur Suivant.</li>

<li><b>F&eacute;licitations !</b> V&eacute;rifiez que les informations entr&eacute;es sont correctes. Au besoin, v&eacute;rifiez les informations entr&eacute;es avec votre FAI ou administrateur syst&egrave;me. Lorsque vous &ecirc;tes s&ucirc;r que ces informations sont correctes, cliquez sur Terminer pour configurer votre compte.</li>

<li>Le nouveau compte appara&icirc;t dans la liste du c&ocirc;t&eacute; gauche de la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum. Cliquez sur OK pour commencer &agrave; utiliser votre nouveau compte.</li>
</ol>

<p>Vous &ecirc;tes maintenant pr&ecirc;t &agrave; r&eacute;cup&eacute;rer les messages de votre compte. Pour des instructions d&eacute;taill&eacute;es, consultez la rubrique <a href="#notifying">R&eacute;cup&eacute;ration des nouveaux messages</a>.</p>

<p>[&nbsp;<a href="#mail_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="add_POP_accountSDX"></a> <a name="add_IMAP_accountSDX"></a> <a name="new_accountSDX"></a> <a name="new_email_accountSDX"></a> <a name="add_email_accountSDX"></a> <a name="adding:mail_accountIDX"></a> <a name="adding:newsgroup_accountIDX"></a> <a name="Mail_and_Newsgroups:adding_accountsIDX"></a> <a name="account_settings"></a>

<h2>Configuration d'autres comptes de messagerie et de forum</h2>

<p>La bo&icirc;te de dialogue Param&egrave;tres du compte permet d'ajouter un nouveau compte ou de modifier des informations relatives &agrave; un compte existant, notamment&nbsp;:</p>

<ul>
<li>les param&egrave;tres de serveur de messagerie et de forums (par exemple, les pr&eacute;f&eacute;rences de t&eacute;l&eacute;chargement et de suppression de message)</li>

<li>les param&egrave;tres de stockage des dossiers et copies de messages</li>

<li>votre adresse de r&eacute;ponse, le nom de votre entreprise et votre signature</li>
</ul>

<p>Pour ajouter un nouveau compte ou modifier les param&egrave;tres d'un compte existant, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche. Elle permet d'effectuer les t&acirc;ches suivantes&nbsp;:</li>

<ul>
<li><b>Ajouter un compte :</b> Cliquez sur ce bouton pour configurer un nouveau compte de messagerie ou de forum. Veillez &agrave; entrer les informations de compte exactement tel qu'il vous est communiqu&eacute;. Cliquez sur Suivant ou Pr&eacute;c&eacute;dent pour vous d&eacute;placer dans les &eacute;crans ou cliquez sur Annuler pour arr&ecirc;ter la cr&eacute;ation du compte.</li>

<li><b>D&eacute;finir par d&eacute;faut&nbsp;:</b> S&eacute;lectionnez un compte, puis cliquez sur ce bouton pour faire appara&icirc;tre le compte s&eacute;lectionn&eacute; au d&eacute;but de la liste des comptes dans la fen&ecirc;tre Mail. Les changements prendront effet au prochain d&eacute;marrage de Messagerie &amp; forums.

<p>Le compte par d&eacute;faut est celui auquel vous souhaitez vous connecter et (dans le cas de comptes IMAP uniquement) o&ugrave; vous souhaitez v&eacute;rifier automatiquement la pr&eacute;sence de nouveaux messages au d&eacute;marrage Messagerie &amp; forums. Pour les comptes POP, vous devez toujours cliquer sur le bouton Obtenir msg pour r&eacute;cup&eacute;rer les nouveaux messages.</p>
</li>

<a name="delete_mail_accountSDX"></a> <a name="remove_mail_accountSDX"></a>

<li><b>Supprimer :</b> S&eacute;lectionnez un compte, puis cliquez sur ce bouton pour le supprimer enti&egrave;rement de votre fen&ecirc;tre Mail.</li>

<li><b>Serveur sortant (SMTP)&nbsp;:</b> Cliquez sur ce bouton (au pied de la liste des comptes) pour modifier les informations relatives au serveur de messagerie sortant. Consultez la rubrique <a href="#PREFERENCES_MAILNEWS_SMTP">Param&egrave;tres de compte de messagerie/forum - Serveur sortant (SMTP)</a> pour plus d'informations.</li>
</ul>
</li>

<li>Cliquez sur les en-t&ecirc;tes sous le nom d'un compte et modifiez les param&egrave;tres correspondants dans le panneau de droite.</li>

<li>Cliquez sur OK pour enregistrer vos modifications.</li>
</ol>

<p>[&nbsp;<a href="#mail_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Mail_and_Newsgroups:changing_account_settingsIDX"></a>

<p>&nbsp;</p>

<h2>Modification des param&egrave;tres d'un compte</h2>

<p>Pour afficher ou modifier des informations relatives &agrave; un compte de messagerie ou de forum existant, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>Cliquez sur le nom du compte &agrave; gauche de la bo&icirc;te de dialogue Param&egrave;tres du compte. Des informations relatives au compte, telles que votre adresse &eacute;lectronique et le fichier de signature, s'affichent &agrave; droite de la bo&icirc;te de dialogue.</li>

<li>Cliquez sur un de ces &eacute;l&eacute;ments sous le nom d'un compte pour voir les param&egrave;tres correspondants :</li>

<ul>
<li><b>Param&egrave;tres du serveur </b>: Les param&egrave;tres disponibles d&eacute;pendent du type de serveur (serveur IMAP, POP ou de forum). Pour plus d'informations, voir  <a href="#IMAP_and_POP3">Param&egrave;tres de compte de messagerie/forum - Param&egrave;tres du serveur</a>.

<p><b>Important</b>&nbsp;: Pour changer le type du serveur (p. ex. de POP en IMAP), vous devez tout d'abord supprimer le compte existant. Vous devez ensuite quitter Netscape et le red&eacute;marrer. Vous pouvez ensuite rouvrir la bo&icirc;te de dialogue Param&egrave;tres du compte de messagerie/forum et recr&eacute;er un compte avec le nouveau type de serveur en cliquant sur Ajouter un compte.</p>
</li>

<li><b>Copies &amp; dossiers </b>: Ces param&egrave;tres d&eacute;terminent si vous voulez envoyer des messages automatiques (copies carbones invisibles) et o&ugrave; vous souhaitez enregistrer une copie de vos messages sortants, brouillons et mod&egrave;les de messages. Pour plus d'informations, voir <a href= "#PREFERENCES_MAILNEWS_COPIES">Param&egrave;tres de compte de messagerie/forum - Copies &amp; dossiers</a>.</li>

<li><b>Adressage </b>: Ces param&egrave;tres permettent de remplacer les param&egrave;tres de serveur d'annuaire globaux sp&eacute;cifi&eacute;s pour tous les carnets d'adresses dans la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences. Pour plus d'informations, voir  <a href= "#addressing_settings">Param&egrave;tres de compte de messagerie/forum - Adressage</a>.</li>

<li><b>Hors ligne &amp; espace disque (comptes IMAP et de forum uniquement) </b>: Ces param&egrave;tres s'appliquent lorsque vous travaillez hors ligne (d&eacute;connect&eacute; de l'Internet) ou que vous devez &eacute;conomiser le temps de t&eacute;l&eacute;chargement et l'espace disque. Pour plus d'informations, voir <a href="#OFFLINE_IMAP">Param&egrave;tres de session hors ligne et d'espace disque (IMAP)</a> ou  <a href= "#OFFLINE_NEWS">Param&egrave;tres de session hors ligne et d'espace disque (forum)</a>.</li>

<li><b>Espace disque (comptes POP uniquement) </b>: Ce param&egrave;tre d&eacute;termine la taille maximale des messages que vous &ecirc;tes pr&ecirc;t &agrave; charger sur votre disque dur. Pour plus d'informations, voir  <a href= "#OFFLINE_POP">Param&egrave;tres d'espace disque (POP)</a>.</li>

<li><b>S&eacute;curit&eacute; </b>: Ces param&egrave;tres d&eacute;terminent les <a href= "glossary.html#certificate">certificats</a> utilis&eacute;s pour signer num&eacute;riquement et chiffrer les messages &eacute;lectroniques que vous envoyez. Les signatures num&eacute;riques vous permettent de vous identifier de mani&egrave;re fiable vis-&agrave;-vis de vos correspondants dans les messages &eacute;lectroniques que vous envoyez. Le chiffrement contribue &agrave; garantir la confidentialit&eacute; de vos messages pendant leur transit sur Internet. Pour plus d'informations, voir  <a href="#security_settings">Param&egrave;tres de compte de messagerie/forum - S&eacute;curit&eacute;</a>.</li>
</ul>
</li>

<li>Cliquez sur OK pour enregistrer vos modifications.</li>
</ol>

<p>[&nbsp;<a href="#mail_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="IMSDX"></a> <a name="Mail_and_Newsgroups:instant_messengerIDX"></a> <a name="INSTANT_MESSENGER"></a>

<h2>Utilisation d'AOL Instant Messenger avec Netscape Messagerie &amp; forums</h2>

<p>Si vous utilisez AOL Instant Messenger, Netscape Messagerie &amp; forums vous permet de correspondre rapidement avec des amis et coll&egrave;gues pendant que vous g&eacute;rez votre courrier. Par exemple, vous pouvez ajouter rapidement des entr&eacute;es de votre r&eacute;pertoire de contacts &agrave; votre carnet d'adresses et envoyer &agrave; des coll&egrave;gues en ligne des messages instantan&eacute;s &agrave; partir de toute fen&ecirc;tre de message.</p>

<p>Une fois connect&eacute; &agrave; AOL Instant Messenger, vous pouvez voir si les exp&eacute;diteurs ou destinataires de messages entrants le sont &eacute;galement. Lorsque l'ic&ocirc;ne de pr&eacute;sence IM <img src= "images/biActive.gif" width="16" height="15" alt="" border="0"> s'affiche &agrave; droite d'un nom dans l'enveloppe du message, cliquez sur le nom et s&eacute;lectionnez Envoyer un message instantan&eacute; dans la liste d&eacute;roulante pour lancer une session de messagerie.</p>

<p><strong>Remarque</strong>&nbsp;: Pour que vous puissiez voir l'ic&ocirc;ne de pr&eacute;sence IM d'une personne,&nbsp;le pseudonyme de cette personne doit figurer dans un de vos carnets d'adresses.</p>

<p>Pour vous connecter &agrave; AOL Instant Messenger&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et s&eacute;lectionnez Instant Messenger ou cliquez sur l'ic&ocirc;ne Instant Messenger dans la barre d'&eacute;tat.</li>

<li>Entrez vos pseudonyme et mot de passe, puis cliquez sur l'ic&ocirc;ne de connexion.</li>
</ol>

<table>
<tr>
<td colspan="4"> <img src="images/imtaskbar.gif" hspace="0" vspace= "0"></td>
</tr>

<tr>
<td width="20"><b>&nbsp;</b></td>
<td><b>Ic&ocirc;ne AOL Instant Messenger</b></td>
</tr>
</table>

<p>Pour plus d'informations sur l'utilisation d'AOL Instant Messenger, voir  <a href="im_help.html#im_start">Pr&eacute;sentation d'Instant Messenger.</a></p>

<p>[&nbsp;<a href="#mail_start">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="read_mailSDX"></a> <a name="Mail_and_Newsgroups:reading_messagesIDX"></a>

<hr> <a name="READING_MESSAGES"></a>
<h1>Lecture de messages</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#notifying">Recherche de nouveaux messages</a></p>

<p><a href="#VIEW_MESSENGER_WINDOW">S&eacute;lection de l'affichage de la fen&ecirc;tre Mail</a></p>

<p><a href="#thread_mail">Tri des messages</a></p>

<p><a href="#PRINTSAVE_MAIL">Enregistrement et impression de messages</a></p>

<p><a href="#scripts">Contr&ocirc;le des images, scripts et plugins</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="get_mailSDX"></a> <a name="biffSDX"></a> <a name="Mail_and_Newsgroups:getting_new_messagesIDX"></a> <a name="notifying"></a>

<h2>Recherche de nouveaux messages</h2>

<p>Pour un compte IMAP, vous pouvez r&eacute;cup&eacute;rer automatiquement les nouveaux messages et les afficher dans la bo&icirc;te de r&eacute;ception en ouvrant Messagerie &amp; forums et en s&eacute;lectionnant la bo&icirc;te de r&eacute;ception du compte IMAP.</p>

<p>Pour un compte POP, vous devez cliquer s&eacute;lectionner la bo&icirc;te de r&eacute;ception et cliquer sur Obtenir msg pour r&eacute;cup&eacute;rer vos messages. Par d&eacute;faut, les messages provenant de votre compte POP sont supprim&eacute;s du serveur POP une fois que vous les avez r&eacute;cup&eacute;r&eacute;s. Vous pouvez <a href="#POP_SERVER">changer vos param&egrave;tres de serveur POP</a> pour enregistrer une copie des messages sur le serveur en plus de les t&eacute;l&eacute;charger sur votre ordinateur.</p>

<p>Vous pouvez &eacute;galement configurer Messagerie &amp; forums pour r&eacute;cup&eacute;rer les nouveaux messages au d&eacute;marrage et v&eacute;rifier leur arriv&eacute;e &agrave; intervalles r&eacute;guliers.</p>

<table>
<tr>
<td colspan="4"> <img src="images/mailicon.gif" hspace="0" vspace= "0"></td>
</tr>

<tr>
<td width="20"><b>&nbsp;</b></td>
<td><b>Ic&ocirc;ne Messagerie &amp; forums</b></td>
</tr>
</table>

<p>L'ic&ocirc;ne Mail et forums de la barre d'&eacute;tat affiche une fl&egrave;che verte pour vous avertir de l'arriv&eacute;e de nouveaux messages.</p>

<table>
<tr>
<td colspan="4"> <img src="images/newmail.gif" hspace="0" vspace= "0"></td>
</tr>

<tr>
<td width="20"><b>&nbsp;</b></td>
<td><b>Notification de courrier</b></td>
</tr>
</table>

<p>Pour configurer un compte de messagerie pour v&eacute;rifier automatiquement l'arriv&eacute;e de nouveaux messages, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>Si vous avez plusieurs comptes, s&eacute;lectionnez-en un et cliquez sur la cat&eacute;gorie Param&egrave;tres du serveur correspondante.</li>

<li>S&eacute;lectionnez une ou les deux options suivantes dans la section Param&egrave;tres du serveur :</li>

<ul>
<li><strong>Rechercher les nouveaux messages au d&eacute;marrage </strong>: S&eacute;lectionnez cette case &agrave; cocher si vous souhaitez v&eacute;rifier automatiquement l'arriv&eacute;e de nouveaux messages sur ce compte chaque fois que vous lancez Messagerie &amp; forums. Pour les comptes POP, Messagerie &amp; forums v&eacute;rifie l'arriv&eacute;e de nouveaux messages mais ne les t&eacute;l&eacute;charge pas &agrave; moins que vous cliquiez sur Obtenir msg ou que vous s&eacute;lectionniez "T&eacute;l&eacute;charger automatiquement tous les nouveaux messages".</li>

<li><strong>V&eacute;rifier les nouveaux messages toutes les ___ minutes </strong>: S&eacute;lectionnez cette case &agrave; cocher si vous souhaitez sp&eacute;cifier le nombre de minutes entre les v&eacute;rifications de courrier. Vous pouvez &eacute;galement v&eacute;rifier l'arriv&eacute;e de nouveaux messages &agrave; tout moment en cliquant sur Obtenir msg dans la fen&ecirc;tre Mail.</li>
</ul>
</li>

<li>Cliquez sur OK. Les param&egrave;tres prendront effet au d&eacute;marrage suivant de Netscape Messagerie &amp; forums.</li>
</ol>

<p>Pour configurer Netscape Messagerie &amp; forums afin qu'il &eacute;mette un son ou affiche une alerte lorsque de nouveaux messages vous parviennent, voir  <a href= "#PREFERENCES_MAILNEWS_MAIN_PANE">Pr&eacute;f&eacute;rences de messagerie et forums &ndash; Messagerie &amp; forums</a>.</p>

<p>Vous pouvez toujours r&eacute;cup&eacute;rer les messages manuellement &agrave; tout moment. Pour r&eacute;cup&eacute;rer les nouveaux messages du compte ou du forum s&eacute;lectionn&eacute;, proc&eacute;dez comme suit&nbsp;:</p>

<ul>
<li>Cliquez sur Obtenir msg dans la barre d'outils de messagerie.</li>

<li>Ouvrez le menu Fichier (dans la fen&ecirc;tre Mail) et s&eacute;lectionnez Retirer les nouveaux messages.</li>
</ul>

<p>Pour r&eacute;cup&eacute;rer les nouveaux messages pour tous vos comptes, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Cliquez sur le triangle du bouton Obtenir msg dans la barre d'outils de messagerie.</li>

<li>S&eacute;lectionnez Retirer tous les nouveaux messages. Netscape Messagerie &amp; forums r&eacute;cup&egrave;re les nouveaux messages pour tous vos comptes de messagerie.

<p>Si vous n'&ecirc;tes actuellement connect&eacute; &agrave; aucun de vos comptes de messagerie, Messagerie &amp; forums vous invite &agrave; entrer vos nom d'utilisateur et mot de passe avant de r&eacute;cup&eacute;rer les nouveaux messages. Si vous les avez d&eacute;j&agrave; enregistr&eacute;s &agrave; l'aide du Gestionnaire de mots de passe, Messagerie &amp; forums ne vous invite pas &agrave; entrer ces informations.</p>
</li>
</ol>

<p><strong>Remarque&nbsp;:</strong> Vous pouvez aussi ouvrir le menu Fichier (dans la fen&ecirc;tre Mail) et s&eacute;lectionner "Retirer les nouveaux messages pour".</p>

<p>Pour r&eacute;cup&eacute;rer les nouveaux messages pour un compte de messagerie sp&eacute;cifique, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Cliquez sur le triangle du bouton Obtenir msg dans la barre d'outils de messagerie.</li>

<li>S&eacute;lectionnez le compte de messagerie pour lequel r&eacute;cup&eacute;rer le courrier.</li>
</ol>

<p><b>Remarque&nbsp;:</b> Messagerie &amp; forums vous invite &agrave; introduire votre mot de passe la premi&egrave;re fois que vous r&eacute;cup&eacute;rez des messages pour un compte. Vous pouvez &agrave; ce moment-l&agrave; demander &agrave; Messagerie &amp; forums de m&eacute;moriser votre mot de passe dans le Gestionnaire de mots de passe.</p>

<p>Le Gestionnaire de mots de passe peut enregistrer tous vos noms d'utilisateur et vos mots de passe sur votre ordinateur et les introduire automatiquement &agrave; votre place. Pour plus d'informations, voir <a href= "using_priv_help.html#using_password">Utilisation du Gestionnaire de mots de passe</a>.</p>

<p>[&nbsp;<a href="#READING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="display_mailSDX"></a> <a name="see_mailSDX"></a> <a name="Mail_and_Newsgroups:mail_window_layoutIDX"></a> <a name="VIEW_MESSENGER_WINDOW"></a>

<h2>S&eacute;lection de l'affichage de la fen&ecirc;tre Mail</h2>

<p>Vous pouvez personnaliser la pr&eacute;sentation de la fen&ecirc;tre Mail (la fen&ecirc;tre qui s'affiche lorsque vous s&eacute;lectionnez Messagerie &amp; forums dans le menu Fen&ecirc;tre)&nbsp;:</p>

<ul>
<li>Ouvrez le menu Afficher et choisissez Afficher/Masquer pour masquer ou afficher la barre d'outils de messagerie, la barre de recherche ou la barre d'&eacute;tat.</li>

<li>Ouvrez le menu Afficher, choisissez Afficher/Masquer et choisissez l'option Ma barre lat&eacute;rale pour la d&eacute;s&eacute;lectionner (la masquer).</li>

<li>Agrandissez et r&eacute;duisez un volet pour alterner entre un affichage &agrave; trois ou deux volets. Choisissez un <a href="#WINDOWSETTINGS">affichage par d&eacute;faut</a> dans la section Messagerie et forums de la fen&ecirc;tre Pr&eacute;f&eacute;rences. Si vous modifiez l'affichage par d&eacute;faut, vous devez quitter Messagerie &amp; forums et relancer Netscape pour que les changements entrent en vigueur.</li>
</ul>

<p>[&nbsp;<a href="#READING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:sorting_and_threading_messagesIDX"></a> <a name="thread_mail"></a>

<h2>Tri des messages</h2>

<p>Pour trier les messages par cat&eacute;gories telles que l'objet, l'exp&eacute;diteur, la date ou la priorit&eacute;, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ul>
<li>Cliquez sur le titre de colonne appropri&eacute; dans la fen&ecirc;tre de liste des messages. Ou ouvrez le menu Afficher, s&eacute;lectionnez Trier par et choisissez la colonne &agrave; trier.</li>
</ul>

<p>Pour reclasser les en-t&ecirc;tes de colonne, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ul>
<li>Cliquez sur un titre de colonne et faites-le glisser vers la gauche ou vers la droite pour repositionner la colonne.</li>
</ul>

<p>Pour grouper des messages par fil de discussion (sujet), afin que chaque message soit affich&eacute; avec toutes ses r&eacute;ponses&nbsp;:</p>

<ul>
<li>Cliquez sur le bouton Fil &agrave; gauche des titres de colonne Objet, Exp&eacute;diteur et Date.</li>
</ul>

<table>
<tr>
<td colspan="4">&nbsp; &nbsp; &nbsp;  <img src= "images/threadbutton.gif" width="270" height="25" hspace="0" vspace="0"></td>
</tr>

<tr>
<td><b>&nbsp;</b></td>
<td><b>Bouton Fil</b></td>
</tr>
</table>

<p><strong>Astuce&nbsp;</strong>: Pour vous aider &agrave; identifier les messages non lus dans un fil de discussion r&eacute;duit dont vous avez lu le message parent, Netscape Messagerie &amp; forums souligne ce dernier.</p>

<p>&nbsp;</p>

<p>[&nbsp;<a href="#READING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Outlook_ExpressSDX"></a> <a name="eml_file_formatSDX"></a> <a name="message_file_formatSDX"></a> <a name="printing_mailSDX"></a> <a name="printing_messagesSDX"></a> <a name="print:messagesIDX"></a> <a name="Mail_and_Newsgroups:saving_and_printing_messagesIDX"></a> <a name="PRINTSAVE_MAIL"></a>

<h2>Enregistrement et impression de messages</h2>

<p>Pour enregistrer un message sous la forme de texte brut ou de fichier HTML ou Outlook Express :</p>

<ol>
<li>Dans la fen&ecirc;tre Mail, s&eacute;lectionnez le message.</li>

<li>Ouvrez le menu Fichier et choisissez Enregistrer sous, puis Fichier.</li>

<li>Indiquez le type de fichier &agrave; enregistrer (HTML, Texte, ou fichier de messagerie). Choisissez Fichier de messagerie si vous souhaitez enregistrer le message de mani&egrave;re &agrave; pouvoir l'ouvrir dans Microsoft Outlook ou Outlook Express.</li>

<li>Changez l'extension du fichier en .html, .txt ou .eml, selon le type de fichier choisi &agrave; l'&eacute;tape 3.</li>

<li>Entrez la destination du fichier et cliquez sur Enregistrer.</li>
</ol>

<p>Pour imprimer un message s&eacute;lectionn&eacute;&nbsp;:</p>

<ul>
<li>Cliquez sur Imprimer.</li>
</ul>

<p>&nbsp;</p>

<p>[ <a href="#READING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="javascript_in_mailSDX"></a> <a name="mail_privacy_and_securitySDX"></a> <a name="message_privacy_and_securitySDX"></a> <a name="attachmentsSDX"></a> <a name="scripts"></a>

<h2>Contr&ocirc;le des images, scripts et plugins</h2>

<p>Par d&eacute;faut, vous pouvez voir les images distantes dans les messages &eacute;lectroniques que vous recevez. Pour &eacute;viter le t&eacute;l&eacute;chargement des images int&eacute;gr&eacute;es dans les pages Web jointes &agrave; des messages :</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Images. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.</li>

<li>Cochez "Ne chargez pas d'images distantes dans les messages &eacute;lectroniques &amp; et de forums".</li>

<li>Cliquez sur OK pour appliquer cette modification.</li>
</ol>

<p>Par d&eacute;faut, JavaScript n'est pas activ&eacute; et les plugins sont activ&eacute;s pour les messages que vous recevez. Pour changer ces param&egrave;tres :</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Avanc&eacute;, cliquez sur Scripts et plugins. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur la cat&eacute;gorie Avanc&eacute; pour d&eacute;velopper la liste.</li>

<li>Sous "Activer JavaScript pour", cochez "Messagerie &amp; forums" de mani&egrave;re &agrave; activer JavaScript pour les pages Web affich&eacute;es dans des messages &eacute;lectroniques.</li>

<li>Sous "Activer les plugins pour", d&eacute;s&eacute;lectionnez "Messagerie &amp; forums" pour d&eacute;sactiver les plugins.</li>

<li>Cliquez sur OK pour appliquer cette modification.</li>
</ol>

<p>&nbsp;</p>

<p>[ <a href="#READING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="Mail_and_Newsgroups:sending_messagesIDX"></a> <a name="SENDING_MESSAGES"></a> <a name="send_mailSDX"></a>

<h1>Envoi de messages</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="360" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#COMPOSING_MESSAGES">Composition de messages</a></p>

<p><a href="#NEW_MESSAGE_WINDOW">Utilisation de la fen&ecirc;tre de composition de message</a></p>

<p><a href="#ADDRESSING_MESSAGE">Adressage d'un message</a></p>

<p><a href="#SENDING_OPTIONS">S&eacute;lection des options d'envoi de message</a></p>

<p><a href="#mail_replyto">R&eacute;ponse &agrave; un message</a></p>

<p><a href="#FORWARD_MESSAGES">Transfert d'un message</a></p>

<p><a href="#using_return_receipts">Confirmation de l'ouverture de votre message</a></p>

<p><a href="#saving_message_draft">Enregistrement et modification d'un brouillon de message</a></p>

<p><a href="#mail_template">Cr&eacute;ation et utilisation de mod&egrave;les</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="write_mailSDX"></a> <a name="Mail_and_Newsgroups:composing_messagesIDX"></a> <a name="COMPOSING_MESSAGES"></a>

<h2>Composition de messages</h2>

<p>Vous pouvez adresser, r&eacute;diger, envoyer un nouveau message ou y r&eacute;pondre comme suit&nbsp;:</p>

<ul>
<li>Dans n'importe quelle fen&ecirc;tre Netscape, ouvrez le menu Fichier et choisissez Nouveau, puis Message.</li>

<li>Cliquez sur Composer dans la barre d'outils de messagerie.</li>

<li>Alors qu'un message est affich&eacute;, cliquez sur R&eacute;pondre, Transf&eacute;rer ou R&eacute;pondre &agrave; tous dans la barre d'outils de messagerie.</li>

<li>Dans la fen&ecirc;tre Carnet d'adresses, s&eacute;lectionnez une adresse et cliquez sur Composer dans le Carnet d'adresses.</li>
</ul>

<p><b>Astuce&nbsp;:</b> Utilisez la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum pour sp&eacute;cifier l'&eacute;diteur de texte HTML &agrave; utiliser pour composer les messages envoy&eacute;s &agrave; partir de ce compte. Vous pouvez sp&eacute;cifier un &eacute;diteur diff&eacute;rent pour chacun de vos comptes. S&eacute;lectionnez le compte et cochez "Composer les messages en format HTML" pour utiliser l'&eacute;diteur de texte HTML pour tous les messages. Voir <a href="#account_settings_change">Modification des param&egrave;tres d'un compte</a> pour plus d'informations.</p>

<p>La composition de messages au format HTML permet d'utiliser diff&eacute;rents styles de texte (gras, italique), polices et couleurs de texte, des tableaux, des listes num&eacute;rot&eacute;es ou &agrave; puces et des images dans vos messages. Cependant, certains destinataires ne pourront lire que les messages en texte brut. Pour utiliser occasionnellement l'&eacute;diteur de texte brut, vous pouvez maintenir la touche Maj enfonc&eacute;e tout en cliquant sur le bouton Composer ou R&eacute;pondre.</p>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:Compose_windowIDX"></a> <a name="NEW_MESSAGE_WINDOW"></a>

<h2>Utilisation de la fen&ecirc;tre de composition de message</h2>

<p>Utilisez la fen&ecirc;tre de composition pour adresser, composer et envoyer des messages. Sp&eacute;cifiez d'abord si vous souhaitez composer des messages en texte brut ou en HTML dans la section <a href= "#PREFERENCES_MAILNEWS_IDENTITY">Param&egrave;tres du compte</a> de la fen&ecirc;tre Pr&eacute;f&eacute;rences (ouvrez le menu Edition et choisissez Param&egrave;tres de compte de messagerie/forum).</p>

<p>Pour afficher la fen&ecirc;tre de composition, cliquez sur le bouton Composer dans la barre d'outils de messagerie.</p>

<p>La fen&ecirc;tre Composer contient les &eacute;l&eacute;ments suivants&nbsp;:</p>

<ul>
<li>Barre d'outils de messagerie</li>

<li style="list-style: none">
<p>Vous pouvez cliquer sur les boutons suivants&nbsp;:</p>

<ul>
<li><b>Envoyer&nbsp;</b>: Pour envoyer un message termin&eacute;.</li>

<li><b>Adresse&nbsp;</b>: Pour rechercher des noms dans vos carnets d'adresses.</li>

<li><b>Joindre&nbsp;</b>: Pour joindre un fichier &agrave; un message. Pour plus d'informations, voir <a href= "#USING_ATTACHMENTS">Utilisation de pi&egrave;ces jointes</a>.</li>

<li><b>Orthographe&nbsp;</b>: Pour v&eacute;rifier l'orthographe du texte du message.</li>

<li><b>S&eacute;curit&eacute; </b>: Pour afficher des informations sur le mode d'envoi de votre message&nbsp;: chiffr&eacute; et/ou sign&eacute; num&eacute;riquement.</li>

<li><b>Enregistrer&nbsp;</b>: Pour enregistrer le message comme brouillon.</li>
</ul>
</li>

<li>Zone d'adressage : Permet d'introduire les adresses &eacute;lectroniques des destinataires.</li>

<li>Zone Documents joints : Lorsque vous joignez des fichiers &agrave; un message (en cliquant dans cette zone ou sur le bouton Joindre), les noms de fichiers apparaissent dans la zone Documents joints, &agrave; droite de la zone d'adressage.</li>

<li>Zone de corps du message&nbsp;: Zone destin&eacute;e &agrave; recevoir le contenu de votre message.</li>
</ul>

<p>Si vous avez choisi de composer des messages &agrave; l'aide de l'&eacute;diteur HTML, une autre barre d'outils s'affiche avec les m&ecirc;mes boutons de formatage de texte que Netscape Composer.</p>

<p>Pour de l'aide sur l'utilisation de l'&eacute;diteur HTML, voir  <a href= "composer_help.html#page_change">Formatage de vos pages Web</a>.</p>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="mail_addressesSDX"></a> <a name="email_addresses:in_mail_messagesIDX"></a> <a name="Mail_and_Newsgroups:addressing_messagesIDX"></a> <a name="ADDRESSING_MESSAGE"></a>

<h2>Adressage d'un message</h2>

<p>Pour adresser un message &eacute;lectronique&nbsp;:</p>

<ol>
<li>Entrez le nom du destinataire dans la zone d'adressage.</li>


<p>Si vous avez activ&eacute; le <a href="#pinpoint">remplissage automatique de l'adresse</a> (il l'est par d&eacute;faut), il suffit de taper les premi&egrave;res lettres du nom du destinataire et d'attendre que Netscape Messagerie &amp; forums compl&egrave;te l'adresse. Vous pouvez &eacute;galement taper une partie du nom et appuyer imm&eacute;diatement sur Entr&eacute;e pour que Netscape Messagerie &amp; forums essaie de compl&eacute;ter l'adresse.</p>
</li>

<li>Si plusieurs adresses sont trouv&eacute;es, s&eacute;lectionnez-en une et appuyez sur Entr&eacute;e.</li>


<p><b>Remarque</b>&nbsp;: Utilisez des virgules pour s&eacute;parer plusieurs adresses sur la m&ecirc;me ligne. N'en utilisez pas pour s&eacute;parer les noms ou pr&eacute;noms. Voici un exemple d'entr&eacute;es multiples :</p>
<p><tt>user1@netscape.net,user2@netscape.net</tt></p>
</li>

<li>Pour que ce message soit envoy&eacute; &agrave; partir d'un compte diff&eacute;rent, cliquez sur "De" pour s&eacute;lectionner celui de votre choix. Pour plus d'informations, voir <a href= "#SENTFROM">Modification du compte d'origine d'un message</a>.</li>

<li>Au besoin, cliquez sur "A" pour s&eacute;lectionner un autre type de destinataire&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>A&nbsp;</b>: Pour les principaux destinataires du message.</li>

<li><b>Copies &agrave;&nbsp;</b>: Pour les destinataires secondaires (copie carbone).</li>

<li><b>Copies cach&eacute;es&nbsp;</b>: Pour les destinataires secondaires invisibles aux autres destinataires, y compris ceux de la liste Cc (copie carbone invisible).</li>

<li><b>R&eacute;ponse&nbsp;</b>: Pour les destinataires d'une r&eacute;ponse dont l'adresse &eacute;lectronique est diff&eacute;rente de l'adresse d'origine du message.</li>

<li><b>Forum&nbsp;</b>: Pour l'envoi d'un message &agrave; un groupe de discussion.</li>

<li><b>Suivi&nbsp;</b>: Pour rediriger un message afin que les r&eacute;ponses correspondantes parviennent &agrave; un autre groupe de discussion que le groupe original.</li>
</ul>
</li>
</ol>

<p><b>Astuce&nbsp;</b>: Vous pouvez rapidement adresser un message en cliquant sur l'adresse &eacute;lectronique contenue dans un message que vous lisez et en s&eacute;lectionnant Composer le message &agrave; dans le menu contextuel.</p>

<a name="SENTFROM"></a>

<p><b>Modification du compte d'origine d'un message</b></p>

<p>Si vous avez plusieurs comptes de messagerie, celui affich&eacute; dans la zone De est bas&eacute; sur le compte (ou serveur) s&eacute;lectionn&eacute; lorsque vous avez choisi de cr&eacute;er un message. Toutefois, Netscape Messagerie &amp; forums permet &eacute;galement de modifier le compte d'origine d'un message pendant sa composition. Cliquez sur la zone De pour afficher la liste des comptes et s&eacute;lectionner le compte de votre choix. Une copie du message est enregistr&eacute;e dans le dossier Sent associ&eacute; au compte d'origine. <a name="pinpoint"></a></p>

<p><b>A propos du remplissage automatique de l'adresse</b></p>

<p>Le remplissage automatique de l'adresse permet d'adresser ais&eacute;ment un courrier &agrave; partir de la fen&ecirc;tre de composition sans devoir rechercher des noms ni les taper en entier. Messagerie &amp; forums v&eacute;rifie automatiquement vos carnets d'adresses ainsi qu'un serveur d'annuaire <a href="glossary.html#LDAP_glossary">LDAP</a> (le cas &eacute;ch&eacute;ant) et compl&egrave;te le nom s'il trouve une correspondance unique. Il &eacute;vite &eacute;galement les erreurs en affichant tous les choix possibles avec des informations suppl&eacute;mentaires s'il trouve plusieurs correspondances. Le remplissage automatique d'adresses est activ&eacute; par d&eacute;faut.</p>

<p>Si vous ne souhaitez pas utiliser une adresse fournie par Messagerie &amp; forums , il suffit d'appuyer sur la touche Retour arri&egrave;re ou Suppr pour effacer des caract&egrave;res et entrer une autre adresse.</p>

<p>Pour d&eacute;sactiver le remplissage automatique de l'adresse&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie et forums, cliquez sur Adressage. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>

<li>Dans la section Remplissage automatique de l'adresse, d&eacute;s&eacute;lectionnez "Carnets d'adresses locaux" et "Serveur de r&eacute;pertoire".</li>

<li>Cliquez sur OK.</li>
</ol>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:sending_optionsIDX"></a> <a name="SENDING_OPTIONS"></a>

<h2>S&eacute;lection des options d'envoi de message</h2>

<p>Lorsque vous composez un message, vous pouvez s&eacute;lectionner les options d'envoi de message suppl&eacute;mentaires suivantes dans le menu Options&nbsp;:</p>

<ul>
<li><b>S&eacute;lectionner des adresses&nbsp;:</b> Cette option permet de s&eacute;lectionner l'adresse &eacute;lectronique du destinataire dans vos carnets d'adresses ou dans un annuaire distant. Pour chercher une adresse dans un carnet d'adresses ou un r&eacute;pertoire, entrez les premi&egrave;res lettres du pr&eacute;nom ou du nom du destinataire pour commencer la recherche. S&eacute;lectionnez une adresse et cliquez sur A&nbsp;:, Copies &agrave;&nbsp;: ou Copies cach&eacute;es&nbsp;: pour adresser le message.</li>

<li><b>Orthographe :</b>V&eacute;rifie l'orthographe du texte du message avant son envoi. Vous pouvez &eacute;galement cliquer sur le bouton Orthographe.</li>

<li><b>Reboucler&nbsp;:</b>Si vous composez un message &agrave; l'aide de l'&eacute;diteur de texte brut, vous pouvez utiliser cette commande pour adapter la longueur des lignes de texte &agrave; la largeur de la fen&ecirc;tre de composition. Cette commande limite les lignes au nombre de caract&egrave;res sp&eacute;cifi&eacute; dans les pr&eacute;f&eacute;rences de <a href="#PREFERENCES_MAILNEWS_MESSAGES">Composition</a>. Elle est essentiellement utile lorsque vous r&eacute;pondez &agrave; un message contenant de longues lignes en le citant.

<p>Vous pouvez utiliser la commande Param&egrave;tres de compte de messagerie/forum dans le menu Edition pour sp&eacute;cifier l'utilisation de l'&eacute;diteur de texte brut pour la composition de messages. Dans la bo&icirc;te de dialogue Param&egrave;tres du compte, s&eacute;lectionnez le compte et d&eacute;s&eacute;lectionnez "Composer les messages en format HTML" pour utiliser l'&eacute;diteur de texte brut pour tous les messages. Pour utiliser occasionnellement l'&eacute;diteur de texte brut, vous pouvez maintenir la touche Maj enfonc&eacute;e tout en cliquant sur le bouton Composer ou R&eacute;pondre.</p>
</li>

<li><b>Accus&eacute;s de r&eacute;ception&nbsp;:</b> Choisissez cette option pour demander un message de confirmation lorsque le destinataire affiche (ouvre) votre message. Soyez conscient que le destinataire peut choisir de ne pas vous envoyer un accus&eacute; de r&eacute;ception. Cette option permet d'activer ou de d&eacute;sactiver les demandes d'accus&eacute; de r&eacute;ception message par message. Pour demander automatiquement des accus&eacute;s de r&eacute;ception pour tous les messages que vous envoyez, utilisez les pr&eacute;f&eacute;rences d'accus&eacute; de r&eacute;ception. Pour plus d'informations, voir <a href="#PREFERENCES_MAILNEWS_RECEIPTS">Pr&eacute;f&eacute;rences de messagerie et forums - Accus&eacute;s de r&eacute;ception</a>.</li>

<li><b>Format&nbsp;:</b>Envoie le message en texte brut ou HTML (format&eacute;) ou les deux. Si vous s&eacute;lectionnez "D&eacute;tection auto", Messagerie &amp; forums vous demande le format &agrave; utiliser si la capacit&eacute; du programme de messagerie du destinataire &agrave; afficher un message HTML est inconnue. Le format s&eacute;lectionn&eacute; ici remplace le format d'envoi sp&eacute;cifi&eacute; &agrave; l'aide de la commande Pr&eacute;f&eacute;rences du menu Edition.</li>

<li><b>Priorit&eacute;&nbsp;:</b> Indiquez si la priorit&eacute; du message est la plus faible, faible, normale, &eacute;lev&eacute;e ou la plus &eacute;lev&eacute;e.</li>

<li><b>Envoyer une copie &agrave; :</b>S&eacute;lectionnez cette option pour enregistrer une copie suppl&eacute;mentaire du message envoy&eacute; dans un dossier autre que le dossier Sent par d&eacute;faut. S&eacute;lectionnez ensuite le dossier d&eacute;sir&eacute;.</li>

<li><strong>S&eacute;curit&eacute; :</strong> Choisissez cette option pour changer les options de s&eacute;curit&eacute; par d&eacute;faut de ce message.</li>
</ul>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="mail_replyto"></a> <a name="Mail_and_Newsgroups:replying_to_messagesIDX"></a>

<h2>R&eacute;ponse &agrave; un message</h2>

<p>Pour r&eacute;pondre &agrave; un message &eacute;lectronique&nbsp;:</p>

<ul>
<li>S&eacute;lectionnez le message.</li>

<li>Cliquez sur R&eacute;pondre pour ne r&eacute;pondre qu'&agrave; l'exp&eacute;diteur.</li>

<li>Cliquez sur R&eacute;pondre &agrave; tous pour r&eacute;pondre &agrave; tous les destinataires du message.</li>
</ul>

<p>Pour inclure le message d'origine chaque fois que vous r&eacute;pondez &agrave; un message et sp&eacute;cifier la fa&ccedil;on de placer le message d'origine dans la r&eacute;ponse :</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums, cliquez sur <a href= "#PREFERENCES_MAILNEWS_MESSAGES">Composition</a>. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>

<li>S&eacute;lectionnez "Inclure automatiquement le message d'origine en r&eacute;pondant &agrave; l'exp&eacute;diteur".</li>

<li>Sp&eacute;cifiez o&ugrave; placer la r&eacute;ponse dans le message. L'option par d&eacute;faut est "commencer la r&eacute;ponse au-dessus du texte ins&eacute;r&eacute;".</li>

<li>Cliquez sur OK.</li>
</ol>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:forwarding_messagesIDX"></a> <a name="FORWARD_MESSAGES"></a>

<h2>Transfert d'un message</h2>

<p>Lorsque vous transf&eacute;rez un message, vous pouvez sp&eacute;cifier o&ugrave; placer le nouveau texte par rapport au texte original : <i>ins&eacute;r&eacute;</i> (dans le corps du message, option par d&eacute;faut) ou en tant que pi&egrave;ce jointe.</p>

<p>Pour transf&eacute;rer un message&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le message et cliquez sur Transf&eacute;rer.</li>

<li>Entrez le nom ou l'adresse &eacute;lectronique du destinataire.</li>

<li>Cliquez sur Envoyer.</li>
</ol>

<p>Pour d&eacute;finir les param&egrave;tres par d&eacute;faut de transfert des messages&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums, cliquez sur <a href= "#PREFERENCES_MAILNEWS_MESSAGES">Composition</a>. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>

<li>Pour transf&eacute;rer des messages, choisissez Incorpor&eacute; (dans le corps du message) ou En tant que fichier joint.</li>

<li>Cliquez sur OK.</li>
</ol>

<p><strong>Astuce&nbsp;</strong>: Pour remplacer le mode de transfert par d&eacute;faut d'un message, s&eacute;lectionnez le message, ouvrez le menu Message et choisissez Transf&eacute;rer en tant que, puis choisissez Incorpor&eacute; ou En tant que fichier joint.</p>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="getting_message_receiptsSDX"></a> <a name="message_confirmationSDX"></a> <a name="confirm_receiptSDX"></a> <a name="getting_mail_receiptsSDX"></a> <a name="return_receiptsSDX"></a> <a name="MDN_receiptSDX"></a> <a name="read_receiptSDX"></a> <a name="return_receipts:usingIDX"></a> <a name="Mail_and_Newsgroups:return_receiptsIDX"></a> <a name="using_return_receipts"></a>

<h2>Confirmation de l'ouverture de votre message</h2>

<p>Vous pouvez utiliser des accus&eacute;s de r&eacute;ception pour &ecirc;tre averti quand un destinataire a affich&eacute; (ouvert) votre message. Pour cela, le destinataire doit utiliser un programme de messagerie conforme &agrave; la norme MDN (Message Disposition Notification). Soyez conscient que le destinataire peut choisir de ne pas vous envoyer un accus&eacute; de r&eacute;ception, m&ecirc;me si vous en avez demand&eacute; un. Les messages que vous envoyez &agrave; un forum ne peuvent pas inclure une demande d'accus&eacute; de r&eacute;ception, car les serveurs de forums ne prennent pas en charge cette fonction.</p>

<p>Pour demander des accus&eacute;s de r&eacute;ception pour tous les messages que vous envoyez, vous pouvez activer les pr&eacute;f&eacute;rences globales d'accus&eacute; de r&eacute;ception. Utilisez &eacute;galement les pr&eacute;f&eacute;rences d'accus&eacute; de r&eacute;ception pour sp&eacute;cifier comment g&eacute;rer les demandes d'accus&eacute; de r&eacute;ception que vous recevez. Vous pouvez remplacer ces pr&eacute;f&eacute;rences globales pour chaque compte.</p>

<p>Pour demander un accus&eacute; de r&eacute;ception message par message :</p>

<ul>
<li>Dans une fen&ecirc;tre de composition de message, ouvrez le menu Options et choisissez Accus&eacute; de r&eacute;ception.</li>
</ul>

<p>Pour demander automatiquement un accus&eacute; de r&eacute;ception lors de l'envoi de messages &agrave; partir de chacun de vos comptes de messagerie :</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums, cliquez sur <a href= "#PREFERENCES_MAILNEWS_RECEIPTS">Accus&eacute;s de r&eacute;ception</a>. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>

<li>S&eacute;lectionnez "Lors de l'envoi de messages, toujours demander un accus&eacute; de r&eacute;ception".</li>

<li>Cliquez sur OK.</li>
</ol>

<p>Pour plus d'informations sur le r&eacute;glage des pr&eacute;f&eacute;rences d'accus&eacute; de r&eacute;ception, voir <a href="#PREFERENCES_MAILNEWS_RECEIPTS">Pr&eacute;f&eacute;rences de messagerie et forums - Accus&eacute;s de r&eacute;ception</a>.</p>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>


<a name="mail_draftSDX"></a> <a name="Mail_and_Newsgroups:saving_messages_draftsIDX"></a> <a name="saving_message_draft"></a>

<h2>Enregistrement et modification d'un brouillon de message</h2>

<p>Pour enregistrer un message comme brouillon &agrave; compl&eacute;ter ult&eacute;rieurement&nbsp;:</p>

<ul>
<li>Dans la fen&ecirc;tre de composition, cliquez sur Enregistrer ou ouvrez le menu Fichier et s&eacute;lectionnez Enregistrer sous Brouillon. Par d&eacute;faut, le message est enregistr&eacute; dans le dossier Drafts du compte en cours.

<p><b>Remarque</b>&nbsp;: Le message reste ouvert apr&egrave;s son enregistrement comme brouillon.</p>
</li>
</ul>

<p>Pour modifier ou envoyer un brouillon, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Cliquez sur le dossier Drafts du compte o&ugrave; vous avez cr&eacute;&eacute; le brouillon du message.</li>

<li>S&eacute;lectionnez le message &agrave; modifier.</li>

<li>Dans l'angle sup&eacute;rieur droit du message, cliquez sur Modifier brouillon.</li>

<li>Modifiez le message au besoin.</li>

<li>Cliquez sur Envoyer pour l'envoyer ou sur Enregistrer pour l'enregistrer et l'achever ult&eacute;rieurement.</li>

<li style="list-style: none">
<p><b>Remarque</b>&nbsp;: Une fois envoy&eacute;, le message est retir&eacute; du dossier Drafts.</p>
</li>
</ol>

<p><b>Astuce&nbsp;</b>: Vous pouvez &eacute;galement double-cliquer sur le message pour l'ouvrir pour modification. Cela est particuli&egrave;rement utile si le volet de message est ferm&eacute;.<br>
</p>

<p>Pour supprimer un ou plusieurs brouillons dont vous n'avez plus besoin, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Cliquez sur le dossier Drafts du compte o&ugrave; vous avez cr&eacute;&eacute; le brouillon du message.</li>

<li>S&eacute;lectionnez les brouillons &agrave; supprimer.</li>

<li>Cliquez sur Supprimer dans la barre d'outils de messagerie.</li>
</ol>

<p>[&nbsp;<a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="mail_template"></a> <a name="templates_for_messagesIDX"></a> <a name="Mail_and_Newsgroups:message_templatesIDX"></a> <a name="default_font:for_mail_messagesIDX"></a> <a name="default_font_for_mail_messagesSDX"></a>

<h2>Cr&eacute;ation et utilisation de mod&egrave;les</h2>

<p>Les mod&egrave;les sont utiles pour d&eacute;finir le format par d&eacute;faut des messages que vous envoyez r&eacute;guli&egrave;rement, tels que des rapports d'&eacute;tat hebdomadaires. Vous pouvez enregistrer un message comme mod&egrave;le &agrave; partir de n'importe quelle fen&ecirc;tre dans laquelle il est affich&eacute;, notamment d'une fen&ecirc;tre de composition de message.</p>

<p>Pour enregistrer un message comme mod&egrave;le&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre Mail, cliquez sur Composer pour cr&eacute;er un nouveau message, puis d&eacute;finissez la police, la taille de texte, la couleur de texte, la couleur de fond et tout autre r&eacute;glage par d&eacute;faut souhait&eacute;.</li>

<p>Ou bien, ouvrez un message existant poss&eacute;dant le formatage voulu.</p>

<li>Alors que le message est affich&eacute;, ouvrez le menu Fichier, choisissez Enregistrer sous, puis Mod&egrave;le. Le message est enregistr&eacute; comme mod&egrave;le dans le dossier Templates du compte de messagerie en cours.</li>
</ol>

<p>Pour composer un message &agrave; l'aide d'un mod&egrave;le&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre Mail, cliquez sur le dossier Templates du compte o&ugrave; vous avez cr&eacute;&eacute; le mod&egrave;le de message.</li>

<li>Double-cliquez sur le mod&egrave;le pour l'ouvrir.</li>

<li>Modifiez le message, puis enregistrez-le (pour le placer dans le dossier Brouillons) ou envoyez-le.</li>

<li style="list-style: none">
<p><b>Remarque</b>&nbsp;: L'envoi du message ne supprime pas le mod&egrave;le du dossier Templates. Le mod&egrave;le est conserv&eacute; pour un usage futur.</p>
</li>
</ol>

<p>Pour supprimer un ou plusieurs mod&egrave;les dont vous n'avez plus besoin, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Cliquez sur le dossier Templates du compte o&ugrave; vous avez cr&eacute;&eacute; les mod&egrave;les.</li>

<li>S&eacute;lectionnez les mod&egrave;les &agrave; supprimer.</li>

<li>Cliquez sur Supprimer dans la barre d'outils de messagerie.</li>
</ol>

<p>[ <a href="#SENDING_MESSAGES">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:creating_HTML_mail_messagesIDX"></a>


<hr> <a name="CREATE_HTML"></a>
<h1>Cr&eacute;ation de messages en HTML</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="410" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#Using_HTML">Utilisation du langage HTML dans vos messages</a></p>

<p><a href="#About_HTML_Send">S&eacute;lection des options d'envoi de messages en HTML</a></p>

<p><a href="#HTML_ADDRESSBOOK">Sp&eacute;cification de destinataires pour les messages HTML</a></p>

<p><a href="#View_source">Affichage de la source des messages HTML</a></p>

<p><a href="#HTML_MAIL_QUESTION">Utilisation de la bo&icirc;te de dialogue de question sur les messages HTML</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="HTML_mailSDX"></a> <a name="HTML:using_in_mail_messagesIDX"></a> <a name="Mail_and_Newsgroups:using_HTML_in_messagesIDX"></a> <a name="Using_HTML"></a>

<h2>Utilisation du langage HTML dans vos messages</h2>

<p>Les messages HTML peuvent comprendre du texte format&eacute;, des liens, des images et des tableaux, tout comme une page Web. Toutefois, certains destinataires peuvent &ecirc;tre dans l'impossibilit&eacute; de recevoir des messages HTML. Netscape Messagerie &amp; forums permet de composer des messages &agrave; l'aide de l'&eacute;diteur de formatage HTML (texte riche) ou de texte brut pour chacun de vos comptes de messagerie. En outre, vous pouvez d&eacute;finir si vos destinataires doivent recevoir des messages HTML ou en texte brut par d&eacute;faut et comment Netscape Messagerie &amp; forums doit traiter les messages lorsque la capacit&eacute; des destinataires &agrave; recevoir des messages HTML format&eacute;s est inconnue.</p>

<p>Pour sp&eacute;cifier l'utilisation de l'&eacute;diteur HTML par d&eacute;faut pour la composition de messages, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez le compte de messagerie ou de forum &agrave; utiliser.</li>

<li>S&eacute;lectionnez "Composer les messages en format HTML". La barre d'outils de formatage s'affiche dans la fen&ecirc;tre de composition. D&eacute;s&eacute;lectionnez cette case pour utiliser l'&eacute;diteur de texte brut pour ce compte.</li>
</ol>

<p>[&nbsp;<a href="#CREATE_HTML">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="HTML:editing_in_mail_messagesIDX"></a> <a name="Mail_and_Newsgroups:editing_HTMLIDX"></a> <a name="edit_HTML_elements"></a>

<h3>Modification ou insertion de code HTML</h3>

<p>Si vous &ecirc;tes familiaris&eacute; avec le code source HTML, vous pouvez modifier ou ins&eacute;rer des &eacute;tiquettes HTML, des attributs de style et des codes JavaScript dans votre message &eacute;lectronique. Dans le cas contraire, il est pr&eacute;f&eacute;rable de ne pas les modifier. Pour travailler avec du code HTML, utilisez l'une des deux m&eacute;thodes suivantes&nbsp;:</p>

<ul>
<li>Placez le curseur l&agrave; o&ugrave; vous souhaitez ins&eacute;rer le code HTML, ouvrez le menu Ins&eacute;rer et choisissez HTML. Dans la bo&icirc;te de dialogue Ins&eacute;rer HTML, entrez des &eacute;tiquettes HTML et du texte, puis cliquez sur Ins&eacute;rer pour ins&eacute;rer vos changements.</li>

<li>S&eacute;lectionnez la source HTML &agrave; modifier, puis ouvrez le menu Ins&eacute;rer et choisissez HTML. Dans la bo&icirc;te de dialogue Ins&eacute;rer HTML, modifiez des &eacute;tiquettes HTML et du texte, puis cliquez sur Ins&eacute;rer pour ins&eacute;rer vos changements.</li>

<li>S&eacute;lectionnez un &eacute;l&eacute;ment tel qu'un tableau, un marqueur nomm&eacute;, une image, un lien ou une ligne horizontale. Double-cliquez sur l'&eacute;l&eacute;ment pour ouvrir la bo&icirc;te de dialogue Propri&eacute;t&eacute;s correspondante. Cliquez sur Edition avanc&eacute;e pour ouvrir l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es. Vous pouvez utiliser l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es pour ajouter des attributs HTML et des codes JavaScript &agrave; des objets.</li>
</ul>

<p>Pour plus d'informations sur la modification du code source HTML, voir <a href= "composer_help.html#PROPERTY_EDITOR">Utilisation de l'Editeur de propri&eacute;t&eacute;s avanc&eacute;es</a>.</p>

<p>[&nbsp;<a href="#CREATE_HTML">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:HTML_mail_sending_optionsIDX"></a> <a name="About_HTML_Send"></a>

<h2>S&eacute;lection des options d'envoi de messages en HTML</h2>

<p>Par d&eacute;faut, Messagerie &amp; forums demande confirmation avant d'envoyer des messages HTML lorsque la capacit&eacute; du programme de messagerie du destinataire &agrave; afficher le texte format&eacute; en HTML est inconnue.</p>

<p>Pour choisir des options de format d'envoi pour les messages &eacute;lectroniques, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums , cliquez sur <a href= "#PREFERENCES_MAILNEWS_FORMATTING">Format d'envoi</a>. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.

<p><b>Remarque</b>&nbsp;: Cette pr&eacute;f&eacute;rence ne s'applique qu'au courrier &eacute;lectronique, pas aux messages de forums.</p>
</li>

<li>S&eacute;lectionnez l'option d&eacute;sir&eacute;e et cliquez sur OK.</li>
</ol>

<p>Si vous vous rendez compte, pendant la composition d'un message, qu'un ou plusieurs destinataires ne sont peut-&ecirc;tre pas &agrave; m&ecirc;me de recevoir du courrier format&eacute; HTML, vous pouvez ais&eacute;ment le convertir en un autre format en cliquant sur Envoyer&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre de composition, ouvrez le menu Options et choisissez Format.</li>

<li>S&eacute;lectionnez le format &agrave; utiliser pour l'envoi du message&nbsp;dans le sous-menu :</li>

<ul>
<li><strong>D&eacute;tection auto </strong>: Messagerie &amp; forum choisit le format appropri&eacute; pour le texte du message. S'il ne peut pas d&eacute;terminer le format, il vous demande de choisir un format.</li>

<li><strong>Messages en texte brut</strong>&nbsp;: Le message ne peut pas afficher le formatage tel que le gras, mais tous les programmes de messagerie seront capables de l'afficher.</li>

<li><strong>Texte HTML uniquement</strong>&nbsp;: Certains programmes de messagerie peuvent &eacute;prouver de la difficult&eacute; &agrave; afficher un message format&eacute; en HTML. Choisissez cette option uniquement si vous &ecirc;tes s&ucirc;r que le programme de messagerie du destinataire est capable d'afficher les messages format&eacute;s en HTML.</li>

<li><strong>Texte normal et HTML </strong>: Ce format  utilise davantage d'espace disque, mais peut &ecirc;tre le meilleur choix si vous n'&ecirc;tes pas s&ucirc;r si le programme du destinataire peut afficher les messages en HTML.</li>
</ul>
</li>

<li>Une fois le message compos&eacute;, cliquez sur Envoyer.</li>
</ol>

<p>[&nbsp;<a href="#CREATE_HTML">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:HTML_mail_recipientsIDX"></a> <a name="HTML_ADDRESSBOOK"></a>

<h2>Sp&eacute;cification de destinataires pour les messages HTML</h2>

<p>Vous pouvez gagner du temps en indiquant si les contacts de votre carnet d'adresses pr&eacute;f&egrave;rent recevoir des messages HTML ou en texte brut.</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses.</li>

<li>S&eacute;lectionnez le carnet d'adresses &agrave; gauche et la carte du contact &agrave; droite.</li>

<li>Cliquez sur Propri&eacute;t&eacute;s pour afficher la bo&icirc;te de dialogue "Carte pour".</li>

<li>Dans l'onglet Nom, utilisez la liste d&eacute;roulante "Pr&eacute;f&egrave;re recevoir les messages format&eacute;s en" pour s&eacute;lectionner HTML si vous savez que ce contact peut lire les messages HTML (tels que ceux comprenant des liens, des images ou des tableaux).</li>

<p>S'il ne peut lire que les messages envoy&eacute;s en texte normal (sans formatage), choisissez Texte normal. Si vous n'en &ecirc;tes pas certain, choisissez Inconnu.</p>

<p>Si vous choisissez  Inconnu, Netscape Messagerie &amp; forums d&eacute;termine le format d'envoi en fonction des param&egrave;tres Format d'envoi de Messagerie &amp; forums dans la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences. Si Messagerie &amp; forums ne peut toujours pas d&eacute;terminer le format correct, il vous invite &agrave; en s&eacute;lectionner un lors de l'envoi du message.</p>

<li>Cliquez sur OK.</li>
</ol>

<p>[&nbsp;<a href="#CREATE_HTML">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:HTML_Message_SourceIDX"></a> <a name="View_source"></a>

<h2>Affichage de la source des messages HTML</h2>

<p>Vous pouvez afficher rapidement le code HTML et autre qui g&eacute;n&egrave;re un message HTML re&ccedil;u&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre de liste des messages, ouvrez le message.</li>

<li>Ouvrez le menu Afficher et s&eacute;lectionnez Source du message.</li>
</ol>

<p>[&nbsp;<a href="#CREATE_HTML">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="HTML_MAIL_QUESTION"></a>

<h2>Utilisation de la bo&icirc;te de dialogue de question sur les messages HTML</h2>

<p>La bo&icirc;te de dialogue de question sur les messages HTML s'affiche lorsque vous essayez d'envoyer un message &agrave; quelqu'un dont le programme ne peut pas afficher les messages en HTML ou lorsque Netscape Messagerie &amp; forums  ne peut pas d&eacute;terminer si votre destinataire peut afficher les messages de ce type. En cas de doute, envoyez le message &agrave; la fois en HTML et en texte brut.</p>

<p>[&nbsp;<a href="#CREATE_HTML">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:using_attachmentsIDX"></a>

<hr> <a name= "USING_ATTACHMENTS"></a>
<h1>Utilisation de pi&egrave;ces jointes</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#attaching_file">Annexe d'un fichier ou d'une page Web</a></p>

<p><a href="#viewing_attachments">Affichage et ouverture de pi&egrave;ces jointes</a></p>

<p><a href="#saving_attachment">Enregistrement de pi&egrave;ces jointes</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="attaching_files_to_messagesIDX"></a> <a name="Mail_and_Newsgroups:attaching_filesIDX"></a> <a name="attaching_file"></a>

<h2>Annexe d'un fichier ou d'une page Web</h2>

<p>Pour joindre un fichier &agrave; un message sortant&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre de composition, cliquez sur Joindre ou ouvrez le menu Fichier et s&eacute;lectionnez Joindre un fichier. La bo&icirc;te de dialogue "Entrer le fichier &agrave; joindre" s'affiche.

<p><b>Astuce&nbsp;</b>: Vous pouvez &eacute;galement cliquer dans la zone Documents joints pour joindre un fichier.</p>
</li>

<li>Entrez le nom du fichier &agrave; joindre ou s&eacute;lectionnez-en un sur le disque dur.</li>

<li>Cliquez sur Ouvrir. Le nom du fichier s'affiche dans la zone Documents joints.</li>
</ol>

<p><b>Astuce&nbsp;</b>: Vous pouvez &eacute;galement glisser-d&eacute;poser un ou plusieurs fichiers de votre bureau vers la zone Documents joints de la fen&ecirc;tre de composition.</p>

<p>Pour joindre une page Web &agrave; un message sortant&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre de composition, ouvrez le menu Fichier et s&eacute;lectionnez Joindre une page Web.</li>

<li>Dans la bo&icirc;te de dialogue, entrez l'URL de la page et cliquez sur OK. L'URL de la page s'affiche dans la zone Documents joints.</li>
</ol>

<p><b>Astuce&nbsp;</b>: Lorsque vous affichez une page dans Navigator, vous pouvez envoyer la page &agrave; un correspondant en ouvrant le menu Fichier et en choisissant Envoyer la page.</p>

<p>[&nbsp;<a href="#USING_ATTACHMENTS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:viewing_attachmentsIDX"></a> <a name="viewing_attachments"></a>

<h2>Affichage et ouverture de pi&egrave;ces jointes</h2>

<p>Si vous recevez une pi&egrave;ce jointe d'un type de fichier affichable par Netscape (notamment fichiers image et HTML), elle s'affiche de fa&ccedil;on <i>incorpor&eacute;e</i> (dans le corps du message). Pour d'autres types de fichier, Messagerie &amp; forums permet d'ouvrir la pi&egrave;ce jointe &agrave; l'aide d'une autre application ou de l'enregistrer sur le disque dur.</p>

<p>Pour ouvrir la pi&egrave;ce jointe, assurez-vous d'avoir un programme permettant d'ouvrir les fichiers de ce type. Par exemple, pour ouvrir un fichier .DOC, veillez &agrave; disposer d'un programme pouvant ouvrir les fichiers .DOC.</p>

<p>Pour ouvrir une pi&egrave;ce jointe&nbsp;:</p>

<ol>
<li>Double-cliquez  sur la pi&egrave;ce jointe d&eacute;sir&eacute;e (si elles sont plusieurs).</li>

<li>Dans la bo&icirc;te de dialogue de t&eacute;l&eacute;chargement, pr&eacute;cisez ce que vous souhaitez que Netscape fasse de la pi&egrave;ce jointe :
<p><br></p>
<ul>
<li>Si Netscape d&eacute;tecte sur votre disque dur une application qui peut ouvrir la pi&egrave;ce jointe, vous pouvez l'ouvrir &agrave; l'aide de cette application. Cliquez sur "Choisir" pour utiliser une application diff&eacute;rente pour ouvrir la pi&egrave;ce jointe.</li>

<li>Si Netscape ne d&eacute;tecte sur votre disque dur aucune application permettant d'ouvrir la pi&egrave;ce jointe, vous pouvez l'enregistrer. Vous ne pourrez pas ouvrir la pi&egrave;ce jointe, mais vous pourrez l'enregistrer sur votre disque dur jusqu'&agrave; ce que vous ayez install&eacute; une application permettant de l'ouvrir.</li>

<li>Cliquez sur "Avanc&eacute;" pour ajouter un nouveau type de fichier &agrave; la liste des applications auxiliaires. Netscape utilise les applications auxiliaires pour d&eacute;terminer comment les diff&eacute;rents types de fichiers doivent &ecirc;tre ouverts par d'autres applications &agrave; partir de Netscape. Pour plus d'informations, voir <a href= "nav_help.html#nav_helperapps">Gestion de diff&eacute;rents types de fichiers</a>.</li>
</ul>
</li>

<li>Cliquez sur OK.</li>

</ol>

<p><b>Remarque&nbsp;:</b> Si vous utilisez un serveur de messagerie IMAP pour l'affichage du courrier, toutes les pi&egrave;ces jointes restent sur le serveur.</p>

<p>[&nbsp;<a href="#USING_ATTACHMENTS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:saving_attachmentsIDX"></a> <a name="saving_attachment"></a>

<h2>Enregistrement de pi&egrave;ces jointes</h2>

<p>Pour enregistrer une pi&egrave;ce jointe&nbsp;:</p>

<ol>
<li>A droite de l'enveloppe du message, sous "Documents joints", s&eacute;lectionnez la pi&egrave;ce jointe &agrave; enregistrer.</li>

<li>Cliquez avec le bouton droit (Contr&ocirc;le-cliquez sous Mac) sur la pi&egrave;ce jointe et s&eacute;lectionnez Enregistrer sous dans le menu contextuel.</li>

<li>Choisissez le nom de fichier et l'emplacement de la pi&egrave;ce jointe sur le disque dur et cliquez sur OK. Messagerie &amp; forums t&eacute;l&eacute;charge la pi&egrave;ce jointe et l'enregistre &agrave; l'emplacement sp&eacute;cifi&eacute;.</li>
</ol>

<p><b>Astuce&nbsp;:</b> Pour enregistrer toutes les pi&egrave;ces jointes, cliquez avec le bouton droit sur la premi&egrave;re de la liste et s&eacute;lectionnez Tout enregistrer. Vous pouvez alors sp&eacute;cifier l'emplacement o&ugrave; enregistrer toutes les pi&egrave;ces jointes.</p>

<p>[ <a href="#USING_ATTACHMENTS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:deleting_messagesIDX"></a> <a name="delete_mailSDX"></a>

<hr> <a name="about_deleting_email"></a>
<h1>Suppression de messages</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#delete_POP_IMAP">Suppression de messages POP ou IMAP</a></p>

<p><a href="#moving_to_trash">D&eacute;placement de messages de et vers la corbeille</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="delete_POP_IMAP"></a>

<h2>Suppression de messages POP ou IMAP</h2>

<p>La suppression des messages d&eacute;pend du type de serveur de messagerie&nbsp;: POP ou IMAP. Les messages POP supprim&eacute;s sont automatiquement plac&eacute;s dans le dossier Trash. Les utilisateurs IMAP peuvent d&eacute;finir diff&eacute;rentes options pour la suppression de messages.</p>

<p>Pour supprimer des messages du dossier Inbox ou d'autres dossiers, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Dans la liste des messages, s&eacute;lectionnez les messages et cliquez sur Supprimer. Par d&eacute;faut, Messagerie &amp; forums place les messages s&eacute;lectionn&eacute;s dans le dossier Trash.</li>

<li>Pour supprimer d&eacute;finitivement les messages, ouvrez le menu Fichier et choisissez Vider la corbeille.</li>
</ol>

<p>Pour supprimer des messages sans les ouvrir, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>Ouvrez le menu Afficher, choisissez Afficher/Masquer et d&eacute;s&eacute;lectionnez Volet des messages.

<p>Ou bien, cliquez sur la poign&eacute;e du Volet des messages (la zone stri&eacute;e centr&eacute;e sur le bas de la liste des messages) pour fermer le volet des messages.</p>
</li>

<li>Dans la liste des messages, s&eacute;lectionnez les messages et cliquez sur Supprimer.</li>
</ol>

<p>Pour d&eacute;finir les pr&eacute;f&eacute;rences de suppression des messages IMAP&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>Recherchez le compte IMAP d&eacute;sir&eacute; et cliquez sur la cat&eacute;gorie Param&egrave;tres du serveur pour ce compte.</li>

<li>S&eacute;lectionnez les <a href="#delete_method">options</a> de suppression de messages et cliquez sur OK.</li>
</ol>

<p>[&nbsp;<a href="#about_deleting_email">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="moving_to_trash"></a>

<h2>D&eacute;placement de messages de et vers la corbeille</h2>

<p>Si vous utilisez un serveur POP pour transmettre vos messages ou si vous configurez le serveur IMAP pour utiliser le dossier Trash, proc&eacute;dez comme suit pour supprimer des messages du dossier Inbox ou d'autres&nbsp;:</p>

<ol>
<li>Dans la liste des messages, s&eacute;lectionnez les messages &agrave; supprimer.</li>

<li>Cliquez sur Supprimer. Messagerie &amp; forums place les messages dans le dossier Trash.</li>
</ol>

<p>Pour r&eacute;cup&eacute;rer des messages du dossier Trash&nbsp;:</p>

<ol>
<li>Cliquez sur le dossier Trash.</li>

<li>S&eacute;lectionnez les messages &agrave; r&eacute;cup&eacute;rer et faites-les glisser vers un autre dossier.</li>
</ol>

<p>Pour supprimer d&eacute;finitivement des messages&nbsp;:</p>

<ul>
<li>Ouvrez le menu Fichier et choisissez Vider la corbeille.</li>
</ul>

<p>[ <a href="#about_deleting_email">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:using_address_booksIDX"></a>

<hr> <a name="use_add_book"></a>
<h1>Utilisation des carnets d'adresses</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="410" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#about_address_books">A propos des carnets d'adresses</a></p>

<p><a href="#adding_names">Ajout d'entr&eacute;es aux carnets d'adresses</a></p>

<p><a href="#CREATE_ADD_BOOK">Cr&eacute;ation d'un carnet d'adresses</a></p>

<p><a href="#ADD_USER_PROPERTIES">Cr&eacute;ation d'une carte de carnet d'adresses</a></p>

<p><a href="#ADD_LIST_MAILING_LIST">Cr&eacute;ation d'une liste de diffusion</a></p>

<p><a href="#EDIT_LIST_MAILING_LIST">Modification d'une liste de diffusion</a></p>

<p><a href="#mail_ab_search">Recherche dans des carnets d'adresses et r&eacute;pertoires</a></p>

<p><a href="#import_address_book">Importation de carnets d'adresses</a></p>

<p><a href="#export_address_book">Exportation de carnets d'adresses</a></p>

<p><a href="#AB_Sync">Synchronisation des entr&eacute;es avec le carnet d'adresses WebMail ou AOL</a></p>

<p><a href="#ADD_LDAP">Ajout et suppression d'annuaires LDAP</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="about_address_books"></a>

<h2>A propos des carnets d'adresses</h2>

<p>Les carnets d'adresses contiennent les adresses &eacute;lectroniques et informations de contact des personnes auxquelles vous envoyez fr&eacute;quemment des messages, telles que vos coll&egrave;gues, amis et proches. Netscape Messagerie &amp; forums fournit deux carnets d'adresses&nbsp;: le carnet d'adresses personnel et le carnet d'adresses collect&eacute;es, et vous pouvez en cr&eacute;er d'autres. Vous pouvez &eacute;galement importer des carnets d'adresses d'autres programmes de messagerie et d'anciennes versions de Netscape. Le contenu de ces carnets est enregistr&eacute; localement sur le disque dur.</p>

<p>Le carnet d'adresses peut &eacute;galement contenir des adresses &eacute;lectroniques d'un annuaire LDAP, situ&eacute; sur un serveur d'annuaire LDAP. Le serveur d'annuaire enregistre les adresses &eacute;lectroniques de personnes non incluses dans vos carnets d'adresses locaux. Le protocole LDAP (Lightweight Directory Access Protocol) est une m&eacute;thode standard d'acc&egrave;s &agrave; des services d'annuaire sur Internet ou en intranet (p. ex. carnets d'adresses au niveau de l'entreprise).</p>

<h4>Carnet d'adresses personnel</h4>

<p>Utilisez le Carnet d'adresses personnel pour ajouter des noms sp&eacute;cifiques de votre choix. Vous pouvez cr&eacute;er des listes de diffusion et modifier des adresses individuelles. Si vous poss&eacute;dez un compte Netscape WebMail ou AOL, vous pouvez synchroniser les entr&eacute;es des carnets d'adresses correspondants avec celles du carnet d'adresses personnel.</p>

<h4>Adresses collect&eacute;es</h4>

<p>Le carnet d'adresses Adresses collect&eacute;es rassemble automatiquement les adresses de courrier &eacute;lectronique contenues dans les messages entrants et sortants. Pour les messages entrants, le carnet d'adresses collect&eacute;es stocke l'adresse de l'exp&eacute;diteur de chaque message d&egrave;s son ouverture. Les adresses des messages sortants sont enregistr&eacute;es d&egrave;s que vous cliquez sur Envoyer. Vous pouvez s&eacute;lectionner les adresses &agrave; collecter (uniquement celles des messages de courrier ou &eacute;galement des messages de discussion) en modifiant les <a href= "#PREFERENCES_MAILNEWS_ADDRESSING"> pr&eacute;f&eacute;rences de collecte d'adresses &eacute;lectroniques</a>.</p>

<h4>Annuaire LDAP (le cas &eacute;ch&eacute;ant)</h4>

<p>Un annuaire LDAP (&eacute;galement appel&eacute; service de consultation d'adresses) stocke les adresses &eacute;lectroniques de destinataires ne figurant pas dans vos carnets d'adresses locaux. Les annuaires LDAP permettent d'acc&eacute;der &agrave; de grandes bases de donn&eacute;es d'adresses &eacute;lectroniques g&eacute;r&eacute;es de mani&egrave;re centrale, particuli&egrave;rement utiles avec le <a href="#AUTO_COMPLETE">remplissage automatique de l'adresse</a>.</p>

<p>La collecte automatique d'adresses est activ&eacute;e par d&eacute;faut. Pour modifier les param&egrave;tres de collecte automatique des adresses, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie et forums, cliquez sur Adressage. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>

<li>Sous Collecte d'adresses &eacute;lectroniques, s&eacute;lectionnez&nbsp;:
<p><br></p>
<ul>
<li>L'utilisation de cette fonction pour les messages entrants ou sortants ou les deux.</li>

<li>L'utilisation de cette fonction pour les messages de forums.</li>

<li>La limitation de la taille du carnet d'adresses collect&eacute;es. La taille par d&eacute;faut est de 700 cartes. Si une nouvelle carte d&eacute;passe la limite, la carte la plus ancienne est supprim&eacute;e et la nouvelle ajout&eacute;e, ce qui conserve un nombre total de cartes &eacute;gal.</li>
</ul>
</li>

<li>Cliquez sur OK.</li>
</ol>
<p><br></p>
<h4>Ouverture de la fen&ecirc;tre Carnet d'adresses</h4>

<p>Pour ouvrir la fen&ecirc;tre Carnet d'adresses&nbsp;:</p>

<ul>
<li>Ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses, ou cliquez sur l'ic&ocirc;ne du Carnet d'adresses dans l'angle inf&eacute;rieur gauche de toute fen&ecirc;tre Netscape.</li>

<li style="list-style: none">
<table>
<tr>
<td colspan="4"> <img src="images/taskbar-ab.gif" hspace="0" vspace= "0"></td>
</tr>

<tr>
<td width="80"><b>&nbsp;</b></td>
<td><b>Ic&ocirc;ne Carnet d'adresses</b></td>
</tr>
</table>
</li>
</ul>
<p><br></p>
<h4>Modification de l'affichage de la fen&ecirc;tre Carnet d'adresses</h4>

<p>Pour personnaliser l'affichage de la fen&ecirc;tre Carnet d'adresses et des cartes&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses. La fen&ecirc;tre Carnet d'adresses s'ouvre.</li>

<li>Dans la fen&ecirc;tre Carnet d'adresses, ouvrez le menu Afficher et choisissez l'une des options d'affichage suivantes&nbsp;:</li>

<li style="list-style: none">
<ul>
<li>Choisissez Afficher/Masquer, puis s&eacute;lectionnez l'&eacute;l&eacute;ment &agrave; d&eacute;s&eacute;lectionner (masquer) ou &agrave; cocher (afficher).</li>

<li>S&eacute;lectionnez Afficher le nom comme et choisissez l'affichage des noms des cartes (Pr&eacute;nom/Nom, Nom/Pr&eacute;nom ou Nom complet).</li>

<li>Choisissez Trier par, puis s&eacute;lectionnez une option de tri.</li>
</ul>
</li>
</ol>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="email_addresses:address_books_andIDX"></a> <a name="adding:address_book_entriesIDX"></a> <a name="address_books:adding_entriesIDX"></a> <a name="adding_names"></a>

<h2>Ajout d'entr&eacute;es aux carnets d'adresses</h2>

<p>Vous pouvez ajouter des entr&eacute;es aux carnets d'adresses de l'une des fa&ccedil;ons suivantes&nbsp;:</p>

<ul>
<li>Cliquez sur un nom dans le champ De ou dans un autre champ de destinataire (par exemple, A ou Cc) dans un message re&ccedil;u et s&eacute;lectionnez "Ajouter au carnet d'adresses" dans la liste d&eacute;roulante.</li>

<li>Dans la fen&ecirc;tre Carnet d'adresses, cliquez sur Nouvelle carte pour cr&eacute;er une carte.</li>

<li><a href="#AB_Sync">Synchronisez les entr&eacute;es</a> avec le carnet d'adresses WebMail ou AOL (vous devez poss&eacute;der un compte Netscape WebMail ou un pseudonyme AOL).</li>

<li>Ouvrez un message pour ajouter automatiquement l'adresse de l'exp&eacute;diteur &agrave; votre carnet d'adresses collect&eacute;es (s'il est activ&eacute;).</li>

<li>Dans la fen&ecirc;tre Carnet d'adresses, copiez des entr&eacute;es vers un autre carnet d'adresses en s&eacute;lectionnant les entr&eacute;es et en les faisant glisser sur le nom du carnet d'adresses de destination.</li>
</ul>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="address_books:creatingIDX"></a> <a name="CREATE_ADD_BOOK"></a>

<h2>Cr&eacute;ation d'un carnet d'adresses</h2>

<p>Netscape Messagerie &amp; forums fournit un carnet d'adresses personnel par d&eacute;faut, mais vous pouvez en cr&eacute;er d'autres.</p>

<p>Pour cr&eacute;er un carnet d'adresses&nbsp;:</p>

<ol>
<li>Cliquez sur l'ic&ocirc;ne du Carnet d'adresses dans l'angle inf&eacute;rieur gauche d'une fen&ecirc;tre Netscape ou ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses. La fen&ecirc;tre Carnet d'adresses s'ouvre.

<table>
<tr>
<td colspan="4"> <img src="images/taskbar-ab.gif" hspace="0" vspace= "0"></td>
</tr>

<tr>
<td width="80"></td>
<td><b>Ic&ocirc;ne Carnet d'adresses</b></td>
</tr>
</table>
</li>

<li>Dans la fen&ecirc;tre Carnet d'adresses, ouvrez le menu Fichier, choisissez Nouveau, puis Carnet d'adresses. La bo&icirc;te de dialogue Nouveau carnet d'adresses s'affiche.</li>

<li>Entrez le nom du carnet d'adresses et cliquez sur OK.</li>
</ol>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="ADD_USER_PROPERTIES"></a>

<h2>Cr&eacute;ation d'une carte de carnet d'adresses</h2>

<p>Les cartes de carnets d'adresses peuvent &ecirc;tre utilis&eacute;es pour stocker des noms, adresses postales, adresses &eacute;lectroniques, num&eacute;ros de t&eacute;l&eacute;phone et informations telles que la pr&eacute;f&eacute;rence de r&eacute;ception de messages en texte brut ou HTML.</p>

<p>Pour cr&eacute;er une carte de carnet d'adresses&nbsp;:</p>

<ol>
<li>Cliquez sur l'ic&ocirc;ne Carnet d'adresses dans la barre d'&eacute;tat ou ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses.</li>

<li>Cliquez sur Nouvelle carte. Si vous avez plusieurs carnets d'adresses, s&eacute;lectionnez celui auquel ajouter la carte.</li>

<li>Chaque bo&icirc;te de dialogue Nouvelle carte comprend quatre onglets&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>Nom</b> : Entrez les informations suivantes&nbsp;:
<p><br></p>
<ul>
<li>Nom et Pr&eacute;nom (nom et pr&eacute;nom de la personne &agrave; afficher dans le carnet d'adresses).</li>

<li>Nom &agrave; Afficher (nom affich&eacute; dans la zone "A" de la fen&ecirc;tre de composition).</li>

<li>Pseudonyme (diminutif ou alias du nom r&eacute;el)</li>

<li>Courrier &eacute;lectronique (adresse principale et secondaire)</li>

<li>Pr&eacute;f&egrave;re recevoir les messages format&eacute;s en&nbsp;: Si vous savez que ce destinataire peut lire les messages HTML (tels que ceux contenant des liens, des images ou des tableaux), s&eacute;lectionnez HTML. S'il ne peut lire que les messages envoy&eacute;s en texte normal (sans formatage), choisissez Texte normal. Si vous n'en &ecirc;tes pas certain, choisissez Inconnu. Si vous choisissez  Inconnu, Netscape Messagerie &amp; forums d&eacute;termine le format d'envoi en fonction des param&egrave;tres Format d'envoi de Messagerie &amp; forums dans la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences. Si Messagerie &amp; forums ne peut toujours pas d&eacute;terminer le format correct, il vous invite &agrave; en s&eacute;lectionner un lors de l'envoi du message.</li>

<li>T&eacute;l&eacute;phones (entrez les num&eacute;ros de t&eacute;l&eacute;phone de cette personne)</li>
</ul>
</li>

<li><b>Adresse&nbsp;</b>: Entrez des informations compl&eacute;mentaires telles que l'adresse postale, le num&eacute;ro de t&eacute;l&eacute;phone et l'URL.

<a name="get_a_mapSDX"></a> <a name="map_button_in_address_bookSDX"></a> <a name="mapquestSDX"></a> <a name="get_directionsSDX"></a>

<!--<p><strong>Astuce&nbsp;</strong>: Si vous entrez des informations d'adresse, Netscape affiche un bouton R&eacute;cup&eacute;rer une carte face &agrave; l'adresse lorsque vous affichez la carte de cette entr&eacute;e dans votre carnet d'adresses. Le bouton R&eacute;cup&eacute;rer une carte affiche une page Web contenant une carte pour l'adresse.</p>-->
</li>

<li><b>Instant Messenger </b>: Entrez le pseudonyme de la personne et s&eacute;lectionnez un groupe de AIM contacts.
<p><b>Remarque</b>&nbsp;: Vous devez &ecirc;tre connect&eacute; &agrave; AOL Instant Messenger pour entrer des informations dans cet onglet.</p></li>

<li><b>Autre </b>: Entrez d'autres informations de votre choix.</li>
</ul>
</li>
</ol>

<p><b>Astuce&nbsp;</b>: Pour ajouter rapidement des entr&eacute;es au carnet d'adresses, cliquez sur des adresses &eacute;lectroniques dans les messages re&ccedil;us et s&eacute;lectionnez Ajouter au carnet d'adresses dans la liste d&eacute;roulante. La bo&icirc;te de dialogue Nouvelle carte s'affiche et permet d'entrer les informations.</p>

<p>&nbsp;</p>

<a name="mail_card_properties"></a>

<h3>Affichage ou modification des propri&eacute;t&eacute;s de carte</h3>

<p>Pour afficher ou modifier les propri&eacute;t&eacute;s d'une carte :</p>

<ol>
<li>S&eacute;lectionnez la carte dans la liste d'entr&eacute;es de la fen&ecirc;tre Carnet d'adresses.</li>

<li>Cliquez sur Propri&eacute;t&eacute;s.</li>
</ol>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="address_books:creating_mailing_listsIDX"></a> <a name="sending_a_message_to_a_groupSDX"></a> <a name="distribution_listSDX"></a> <a name="ADD_LIST_MAILING_LIST"></a>

<h2>Cr&eacute;ation d'une liste de diffusion</h2>

<p>Si vous envoyez r&eacute;guli&egrave;rement des messages &agrave; un groupe de destinataires, vous pouvez leur adresser rapidement un message &agrave; l'aide d'une liste de diffusion contenant les noms de votre choix.</p>

<p>Pour cr&eacute;er une liste de diffusion et l'ajouter au carnet d'adresses&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre Carnet d'adresses, cliquez sur Nouvelle liste.</li>

<li>Entrez les informations suivantes dans la bo&icirc;te de dialogue Liste de diffusion&nbsp;:

<ul>
<li>Cliquez sur la liste d&eacute;roulante "Ajouter &agrave;&nbsp;:" pour choisir un carnet d'adresses dans lequel enregistrer la liste.</li>

<li>Nom de la liste&nbsp;: Lorsque vous entrez le nom de la liste dans la zone "A" d'un message, tous ses membres le re&ccedil;oivent.</li>

<li>Pseudonyme&nbsp;: Alias (ou abr&eacute;viation) du nom de la liste.</li>

<li>Description : S'affiche apr&egrave;s le nom de la liste dans la ligne d'adresse de la fen&ecirc;tre de composition.</li>
</ul>
</li>
<li>Tapez des adresses &eacute;lectroniques pour les ajouter &agrave; la liste de diffusion.</li>

<li>Cliquez sur OK.</li>
</ol>

<p>Dans le c&ocirc;t&eacute; gauche de la fen&ecirc;tre Carnet d'adresses, la liste de diffusion appara&icirc;t sous le carnet d'adresses o&ugrave; vous l'avez ajout&eacute;e.</p>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="EDIT_LIST_MAILING_LIST"></a>

<h2>Modification d'une liste de diffusion</h2>

<p>Les listes de diffusion sont stock&eacute;es dans le carnet d'adresses dans lequel elles ont &eacute;t&eacute; cr&eacute;&eacute;es.</p>

<p>Pour supprimer un membre de la liste, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses.</li>

<li>D&eacute;veloppez le carnet d'adresses contenant votre liste de diffusion en cliquant sur le petit triangle &agrave; c&ocirc;t&eacute; de son nom.</li>

<li>Cliquez sur la liste de diffusion. Les membres s'affichent &agrave; droite du nom de la liste de diffusion.</li>

<li>Cliquez sur l'entr&eacute;e &agrave; supprimer.</li>

<li>Cliquez sur le bouton Supprimer.</li>
</ol>

<p>Pour ajouter des membres &agrave; une liste de diffusion&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses.</li>

<li>D&eacute;veloppez le carnet d'adresses contenant votre liste de diffusion en cliquant sur le petit triangle &agrave; c&ocirc;t&eacute; de son nom.</li>

<li>Cliquez sur la liste de diffusion.</li>

<li>Cliquez sur Propri&eacute;t&eacute;s.</li>

<li>Ajoutez ou supprimez des entr&eacute;es au besoin.</li>

<li>Cliquez sur OK lorsque vous avez termin&eacute;.</li>
</ol>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="address_books:searchingIDX"></a> <a name="mail_ab_search"></a>

<h2>Recherche dans des carnets d'adresses et cotacts AIM</h2>

<p>Netscape Messagerie &amp; forums permet de rechercher rapidement un nom ou une adresse dans un carnet d'adresses ou un contacts AIM ou d'utiliser une combinaison de crit&egrave;res pour y effectuer une recherche plus sp&eacute;cifique.</p>

<p>Pour chercher rapidement un nom ou une adresse &eacute;lectronique dans un carnet d'adresses ou un contacts AIM, &agrave; partir de la fen&ecirc;tre Carnet d'adresses :</p>

<ol>
<li>Dans la liste des carnets d'adresses, s&eacute;lectionnez le carnet d'adresses ou le contacts AIM &agrave; parcourir.</li>

<li>Dans le champ "Le nom ou l'adresse de messagerie contient", tapez le nom ou l'adresse &eacute;lectronique &agrave; rechercher. Vous pouvez taper une partie du nom ou de l'adresse &eacute;lectronique ou le texte exact &agrave; rechercher.

<p>D&egrave;s que vous arr&ecirc;tez de taper, Netscape Messagerie &amp; Forums affiche les entr&eacute;es dont le nom ou l'adresse &eacute;lectronique contient le texte recherch&eacute;.</p>
</li>

<li>Cliquez sur Supprimer pour effacer le texte de recherche et afficher toutes les entr&eacute;es.</li>
</ol>

<p>&nbsp;</p>

<a name="quick_search_in_address_bookSDX"></a> <a name="mail_advanced_ab_search"></a>

<h3>Recherche d'entr&eacute;es sp&eacute;cifiques</h3>

<p>Vous pouvez chercher des entr&eacute;es sp&eacute;cifiques dans les carnets d'adresses ou les contacts AIM. Si la bo&icirc;te de dialogue Recherche avanc&eacute;e dans le carnet d'adresses n'est pas encore affich&eacute;e, &agrave; partir de la fen&ecirc;tre Carnet d'adresses&nbsp;:</p>

<ol>
<li>Dans le menu Outils, choisissez Rechercher des adresses. La bo&icirc;te de dialogue Recherche avanc&eacute;e dans le carnet d'adresses s'affiche.</li>

<li>Face &agrave; "Rechercher dans", choisissez le carnet d'adresses ou contacts AIM o&ugrave; effectuer la recherche.</li>

<li>S&eacute;lectionnez l'option de correspondance &agrave; utiliser par Messagerie &amp; forums pour rechercher des entr&eacute;es qui r&eacute;pondent &agrave; toutes ou au moins une des conditions (crit&egrave;res) choisies.</li>

<li>Cliquez sur Davantage pour ajouter des crit&egrave;res et sur Moins pour en supprimer.</li>

<li>Cliquez sur Rechercher pour commencer ou sur Supprimer pour effacer les entr&eacute;es. Les r&eacute;sultats de la recherche apparaissent dans la partie inf&eacute;rieure de la bo&icirc;te de dialogue.</li>

<li>Pour trier les entr&eacute;es dans un ordre diff&eacute;rent, cliquez sur la colonne selon laquelle trier.</li>

<li>Pour afficher la carte d'une entr&eacute;e, s&eacute;lectionnez l'entr&eacute;e et cliquez sur Propri&eacute;t&eacute;s.</li>

<li>Pour composer un message &agrave; adresser &agrave; plusieurs destinataires, s&eacute;lectionnez une ou plusieurs entr&eacute;es et cliquez sur Composer.</li>
</ol>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="ldif_importSDX"></a> <a name="csv_importSDX"></a> <a name="address_books:importingIDX"></a> <a name="Eudora_address_book_importSDX"></a> <a name="Outlook_address_book_importSDX"></a> <a name="importing_Communicator_address_booksSDX"></a>

<h2>Importation de carnets d'adresses</h2>

<p>Si vous avez un carnet d'adresses Netscape 6 provenant d'un autre utilisateur ou ordinateur, ou si vous avez un carnet d'adresses d'une version pr&eacute;c&eacute;dente de Netscape Communicator ou d'un autre programme de messagerie, vous pouvez en importer les entr&eacute;es dans la fen&ecirc;tre Carnet d'adresses sous la forme d'un nouveau carnet d'adresses. N'oubliez pas que lorsque vous mettez &agrave; niveau un profil utilisateur &agrave; partir d'une version ant&eacute;rieure de Netscape, les carnets d'adresses correspondants sont automatiquement inclus. Vous ne devez donc pas les importer.</p>

<p>Vous pouvez importer des carnets d'adresses de Communicator, Netscape 6, Eudora, Outlook, Outlook Express, ou de fichiers texte (formats LDIF, d&eacute;limit&eacute; par des tabulations (.tab), s&eacute;par&eacute; par des virgules (.csv) ou texte (.txt)). Lorsque vous importez un carnet d'adresses, Messagerie &amp; forums en cr&eacute;e un nouveau avec les entr&eacute;es import&eacute;es.</p>

<p>Vous pouvez &eacute;galement <a href="#importing_mail">importer des messages et des param&egrave;tres</a> de Communicator, Eudora, Outlook et Outlook Express.</p>

<p>Pour importer un carnet d'adresses, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Dans le menu Outils, choisissez Importer. L'Assistant d'importation de courrier s'affiche.<br>
</li>

<li>Suivez les instructions pour importer des carnets d'adresses.</li>

<li style="list-style: none">
<p><strong>Astuce&nbsp;</strong>: Les carnets d'adresses Communicator (pab.na2) sont stock&eacute;s dans le r&eacute;pertoire de profil utilisateur (par exemple, C:\Programme Files\Netscape\Utilisateurs, o&ugrave; \Utilisateurs contient les r&eacute;pertoires de profils utilisateurs).</p>
</li>
</ol>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="ldif_exportSDX"></a> <a name="csv_exportSDX"></a> <a name="text_exportSDX"></a> <a name="address_books:exportingIDX"></a> <a name="export_address_book"></a>

<h2>Exportation de carnets d'adresses</h2>

<p>Vous pouvez exporter un carnet d'adresses Netscape pour l'importer ensuite dans un autre profil utilisateur, le d&eacute;placer vers un autre ordinateur ou l'utiliser avec un autre programme capable d'importer des carnets d'adresses. Vous pouvez exporter un carnet d'adresses dans l'un des formats de fichier suivants : Netscape (.ldif), d&eacute;limit&eacute; par des tabulations (.tab), s&eacute;par&eacute; par des virgules (.csv) ou texte (.txt).</p>

<p>Pour exporter un carnet d'adresses, &agrave; partir de la fen&ecirc;tre Carnet d'adresses&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le carnet d'adresses &agrave; exporter.</li>

<li>Dans le menu Outils, choisissez Exporter.</li>

<li>Dans la bo&icirc;te de dialogue Exporter un carnet d'adresses, acc&eacute;dez &agrave; l'emplacement o&ugrave; vous souhaitez enregistrer le fichier de carnet d'adresses.</li>

<li>Choisissez le format de fichier pour le carnet d'adresses export&eacute; (.ldif, s&eacute;par&eacute; par des virgules ou d&eacute;limit&eacute; par des tabulations).</li>

<li>Entrez le nom du fichier de carnet d'adresses &agrave; cr&eacute;er. Pensez &agrave; inclure l'extension de fichier appropri&eacute;e (.ldif, .csv, .tab ou .txt).</li>

<li>Cliquez sur Enregistrer.</li>
</ol>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="AOL_Mail:syncing_address_bookIDX"></a> <a name="Netscape_Webmail:syncing_address_bookIDX"></a> <a name="address_books:synchronizingIDX"></a> <a name="AB_Sync"></a>

<h2>Synchronisation des entr&eacute;es avec le carnet d'adresses WebMail ou AOL</h2>

<p>La synchronisation de carnets d'adresses permet de gagner du temps lorsque vous n'&ecirc;tes pas &agrave; port&eacute;e de votre ordinateur, car votre carnet d'adresses est toujours accessible sur le Web via votre compte Webmail ou AOL.</p>

<p>Vous pouvez synchroniser des carnets d'adresses dans votre compte Netscape Webmail ou AOL avec des entr&eacute;es de votre Carnet d'adresses personnel Netscape. Si vous ajoutez, modifiez ou supprimez une entr&eacute;e d'un carnet d'adresses, vous pouvez automatiquement mettre &agrave; jour l'autre carnet en cons&eacute;quence.</p>

<p><b>Remarque</b>&nbsp;: Pour synchroniser votre carnet d'adresses, vous devez d&eacute;j&agrave; avoir un pseudonyme AOL ou Netscape. Si vous n'avez pas encore de pseudonyme, vous pouvez en obtenir un sur <tt>http://home.netscape.com</tt>.</p>

<p>Pour synchroniser les carnets d'adresses, ouvrez la fen&ecirc;tre Carnet d'adresses&nbsp;:</p>

<ol>
<li>Dans la fen&ecirc;tre Carnet d'adresses, cliquez sur le bouton Synchroniser de la barre d'outils ou s&eacute;lectionnez Synchroniser le carnet d'adresses Netscape dans le menu Outils.</li>

<li>Messagerie &amp; forums vous invite &agrave; entrer le nom d'utilisateur (pseudonyme) et le mot de passe du compte &agrave; utiliser pour la synchronisation des carnets d'adresses.

<p>Par exemple, pour synchroniser le carnet d'adresses personnel avec le carnet d'adresses Netscape WebMail, entrez vos nom d'utilisateur et mot de passe WebMail. Pour synchroniser le carnet d'adresses personnel avec le carnet d'adresses AOL, entrez vos nom d'utilisateur et mot de passe AOL.</p>
</li>

<li>Cliquez sur OK pour entamer la synchronisation.</li>
</ol>

<p>Vous pouvez continuer &agrave; synchroniser les carnets d'adresses pendant toute la session Mail (sans devoir vous reconnecter). Il suffit de cliquer sur Synchroniser ou de choisir Synchroniser le carnet d'adresses Netscape dans le menu Outils.</p>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="adding:LDAP_directoriesIDX"></a> <a name="address_books:LDAP_directoriesIDX"></a> <a name="LDAP:adding_to_address_bookIDX"></a> <a name="propertiesSDX"></a> <a name="scope_in_LDAPSDX"></a> <a name="directory_server_propertiesSDX"></a> <a name="LDAP_using_SSLSDX"></a> <a name="new_LDAP_directorySDX"></a> <a name="delete_LDAP_directorySDX"></a> <a name="ADD_LDAP"></a>

<h2>Ajout et suppression d'annuaires LDAP</h2>

<p>L'ajout d'un r&eacute;pertoire LDAP &agrave; votre carnet d'adresses vous permet de chercher dans ce r&eacute;pertoire des adresses &eacute;lectroniques et d'autres informations de contact. Vous pouvez &eacute;galement utiliser le r&eacute;pertoire pour le remplissage automatique de l'adresse lors de l'adressage de messages &eacute;lectroniques.</p>

<p>En g&eacute;n&eacute;ral, l'ajout et la suppression de r&eacute;pertoires LDAP s'effectuent en respectant les instructions fournies par votre administrateur syst&egrave;me V&eacute;rifiez aupr&egrave;s de ce dernier les informations dont vous aurez besoin pour ajouter un nouveau r&eacute;pertoire &agrave; votre carnet d'adresses</p>

<p>Pour ajouter un contacts AIM, &agrave; partir de la fen&ecirc;tre Carnet d'adresses&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fichier, choisissez Nouveau, puis Annuaire LDAP. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s du serveur d'annuaire s'affiche.</li>

<li>Entrez les informations suivantes dans l'onglet G&eacute;n&eacute;rales de la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du serveur d'annuaire&nbsp;:
<p><br></p>
<ul>
<li><b>Nom</b> : Entrez le nom du service d'annuaire (par exemple, InfoSpace Directory).</li>

<li><b>Nom d'h&ocirc;te</b> : Entrez le nom du serveur h&ocirc;te, tel que ldap.infospace.com.</li>

<li><b>DN de base </b>: Ce param&egrave;tre est utilis&eacute; pour d&eacute;finir le nom distinctif de base. Entrez des codes pour limiter la recherche &agrave; un pays ou &agrave; une organisation sp&eacute;cifique. Par exemple, c=JP limite la recherche uniquement au Japon. DN de base sp&eacute;cifie &eacute;galement l'organisation dans laquelle rechercher (par exemple, o=Netscape Communications Corporation, c=Etats-Unis).</li>

<li><b>Num&eacute;ro de port&nbsp;</b>: Entrez le num&eacute;ro de port du serveur LDAP. La valeur par d&eacute;faut est 389.</li>

<li><b>Lier le DN</b>: Nom distinctif utilis&eacute; pour authentifier (se connecter) aupr&egrave;s du serveur LDAP. Si ce champ est vide, le serveur LDAP se lie de mani&egrave;re anonyme.</li>

<li><b>Utiliser une connexion s&ucirc;re (SSL)&nbsp;:</b>&nbsp; Choisissez ce param&egrave;tre si votre serveur LDAP prend en charge les connexions s&eacute;curis&eacute;es (chiffr&eacute;es). En cas de doute, consultez votre administrateur syst&egrave;me.</li>
</ul>
</li>

<li>Cliquez sur l'onglet Avanc&eacute; pour configurer les param&egrave;tres du serveur d'annuaire LDAP.</li>

<li>Entrez les informations suivantes&nbsp;:
<p><br></p>
<ul>
<li><b>Ne pas renvoyer plus de _ r&eacute;sultats </b>: Cette option permet de limiter le nombre de correspondances de remplissage automatique renvoy&eacute;es par le serveur d'annuaire. Entrez le nombre maximum de correspondances d'adresses &eacute;lectroniques &agrave; afficher pour le remplissage automatique.</li>

<li><b>Port&eacute;e&nbsp;</b>: D&eacute;finit les limites de la recherche. S&eacute;lectionnez l'une des options suivantes&nbsp;:
<p><br></p>
<ul>
<li><b>Un niveau&nbsp;</b>: R&eacute;cup&egrave;re les entr&eacute;es correspondantes en recherchant au niveau du DN de base et au niveau inf&eacute;rieur.</li>

<li><b>Sous-arbre </b>: R&eacute;cup&egrave;re les entr&eacute;es correspondantes en recherchant au niveau du DN de base et dans tous les niveaux inf&eacute;rieurs. Cette recherche est la moins restrictive.</li>
</ul>
</li>

<li><b>Filtre de recherche</b>&nbsp;: Entrez le filtre de recherche &agrave; appliquer aux r&eacute;sultats correspondants &agrave; la recherche.</li>
</ul>

<li>Cliquez sur OK pour quitter la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du serveur d'annuaire.</li>

<li>Cliquez sur OK pour fermer la bo&icirc;te de dialogue Serveurs d'annuaire LDAP.</li>

<li>Cliquez sur OK pour fermer la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences.</li>
</ol>

<p>Le r&eacute;pertoire ajout&eacute; appara&icirc;t dans la liste des carnets d'adresses de la fen&ecirc;tre Carnet d'adresses.</p>

<p>Pour supprimer un r&eacute;pertoire :</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences. La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences s'affiche.</li>

<li>Dans la cat&eacute;gorie Messagerie et forums, s&eacute;lectionnez Adressage. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>

<li>Dans Remplissage automatique de l'adresse sur le c&ocirc;t&eacute; droit de la bo&icirc;te de dialogue, cliquez sur Modifier r&eacute;pertoires.</li>

<li>Dans la bo&icirc;te de dialogue Serveurs d'annuaire LDAP, s&eacute;lectionnez l'annuaire &agrave; supprimer et cliquez sur Supprimer.</li>

<li>Cliquez sur OK &agrave; deux reprises pour fermer la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences.</li>
</ol>

<p>Pour des informations sur le t&eacute;l&eacute;chargement ou la synchronisation d'un contacts AIM en vue d'une utilisation hors ligne pour y effectuer des recherches ou l'utiliser pour la fonction de remplissage automatique des adresses pendant une session hors ligne, voir <a href= "#OFFLINE_DIRECTORY">T&eacute;l&eacute;chargement d'entr&eacute;es de r&eacute;pertoire pour une utilisation hors ligne</a>.</p>

<p>&nbsp;</p>

<a name="LDAP:directory_server_settingsIDX"></a> <a name="Mail_and_Newsgroups:directory_settingsIDX"></a> <a name="Mail_and_Newsgroups:LDAP_server_settingsIDX"></a> <a name="mail_ldap_properties"></a>

<h3>Param&egrave;tres de serveur d'annuaire</h3>

<p>Pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du serveur d'annuaire, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses.</li>

<li>Dans la liste des carnets d'adresses, s&eacute;lectionnez les contacts AIM.</li>
<li>Cliquez sur Propri&eacute;t&eacute;s.</li>
</ol>

<p><b>Onglet G&eacute;n&eacute;rales</b></p>

<ul>
<li><b>Nom</b> : Nom du service d'annuaire (par exemple, Annuaire InfoSpace).</li>

<li><b>Nom d'h&ocirc;te</b> : Nom du serveur h&ocirc;te, tel que ldap.infospace.com.</li>

<li><b>DN de base </b>: Nom distinctif de base. Les codes introduits ici limitent la recherche &agrave; un pays ou &agrave; une organisation sp&eacute;cifique. Par exemple, c=JP limite la recherche uniquement au Japon. DN de base sp&eacute;cifie &eacute;galement l'organisation dans laquelle rechercher (par exemple, o=Netscape Communications Corporation, c=Etats-Unis).</li>

<li><b>Num&eacute;ro de port&nbsp;</b>: Entrez le num&eacute;ro de port du serveur LDAP. La valeur par d&eacute;faut est 389.</li>

<li><b>Lier le DN</b>: Nom distinctif utilis&eacute; pour authentifier (se connecter) aupr&egrave;s du serveur LDAP. Si ce champ est vide, le serveur LDAP se lie de mani&egrave;re anonyme.</li>

<li><b>Utiliser une connexion s&ucirc;re (SSL)&nbsp;:</b>&nbsp; Choisissez ce param&egrave;tre si votre serveur LDAP prend en charge les connexions s&eacute;curis&eacute;es (chiffr&eacute;es). En cas de doute, consultez votre administrateur syst&egrave;me.</li>
</ul>

<p><b>Onglet Avanc&eacute;</b></p>

<ul>
<li><b>Ne pas renvoyer plus de _ r&eacute;sultats </b>: Cette option permet de limiter le nombre de correspondances de remplissage automatique renvoy&eacute;es par le serveur d'annuaire. Sp&eacute;cifiez le nombre maximum de correspondances d'adresses &eacute;lectroniques &agrave; afficher pour le remplissage automatique.</li>

<li><b>Port&eacute;e&nbsp;</b>: D&eacute;finit les limites de la recherche&nbsp;:</li>

<li style="list-style: none">
<ul>
<li><b>Un niveau&nbsp;</b>: R&eacute;cup&egrave;re les entr&eacute;es correspondantes en recherchant au niveau du DN de base et au niveau inf&eacute;rieur.</li>

<li><b>Sous-arbre </b>: R&eacute;cup&egrave;re les entr&eacute;es correspondantes en recherchant au niveau du DN de base et dans tous les niveaux inf&eacute;rieurs. Cette recherche est la moins restrictive.</li>
</ul>
</li>

<li><b>Filtre de recherche</b>&nbsp;: Sp&eacute;cifie le filtre de recherche &agrave; appliquer aux r&eacute;sultats correspondants &agrave; la recherche.</li>
</ul>

<p>[&nbsp;<a href="#use_add_book">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="ORGANIZING_MAIL"></a>
<h1>Organisation des messages</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="370" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#FILING_MESSAGES">Cr&eacute;ation d'un dossier</a></p>

<p><a href="#rename_folder">Changement de nom d'un dossier</a></p>

<p><a href="#copy_folder">D&eacute;placement ou copie d'un dossier</a></p>

<p><a href="#OPENING_FOLDERS">Archivage de messages dans des dossiers</a></p>

<p><a href="#SHARING_FOLDERS">Partage de dossiers avec d'autres utilisateurs (IMAP uniquement)</a></p>

<p><a href="#labeling_messages">Etiquetage de messages</a></p>

<p><a href="#mark_flag">Marquage de messages</a></p>

<p><a href="#MAIL_FILTERS">Cr&eacute;ation de filtres de messages</a></p>

<p><a href="#SEARCH_MAILNEWS">Recherche de messages</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:creating_foldersIDX"></a> <a name="FILING_MESSAGES"></a>
<h2>Cr&eacute;ation d'un dossier</h2>

<p>Pour cr&eacute;er un dossier de messages, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fichier, choisissez Nouveau, puis Dossier. La bo&icirc;te de dialogue Nouveau dossier s'affiche.</li>

<li>Entrez le nom du dossier.</li>

<li>Cliquez sur la liste d&eacute;roulante et choisissez un emplacement et cliquez sur OK. Le nouveau dossier appara&icirc;t dans la liste des dossiers de courrier.</li>
</ol>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:renaming_foldersIDX"></a> <a name="rename_folder"></a>

<h2>Changement de nom d'un dossier</h2>

<p>Pour renommer un dossier existant, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le dossier &agrave; renommer.</li>

<li>Ouvrez le menu Fichier et choisissez Renommer un dossier. La bo&icirc;te de dialogue Renommer le dossier s'affiche.</li>

<li>Entrez le nouveau nom et cliquez sur OK.</li>
</ol>

<p><b>Remarque</b>&nbsp;: Si vous renommez un dossier utilis&eacute; pour stocker des <a href="#MAIL_FILTERS">messages filtr&eacute;s</a>, le filtre sera automatiquement mis &agrave; jour pour utiliser le dossier renomm&eacute;.</p>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:copying_foldersIDX"></a> <a name="copy_folder"></a>

<h2>D&eacute;placement ou copie d'un dossier</h2>

<p>Vous pouvez copier un dossier et son contenu dans un autre compte de messagerie ou le d&eacute;placer dans le m&ecirc;me compte.</p>

<p>Pour d&eacute;placer ou copier un dossier, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le dossier &agrave; d&eacute;placer ou copier.</li>

<li>Effectuez l'une des op&eacute;rations suivantes :
<p><br></p>
<ul>
<li>Pour d&eacute;placer le dossier dans un autre dossier du m&ecirc;me compte, faites-le glisser sur le nom du dossier en question. Le dossier d&eacute;plac&eacute; devient un sous-dossier.</li>

<li>Pour copier le dossier dans un autre compte, faites-le glisser sur le nom de ce dernier.</li>

<li>Pour copier le dossier dans un autre dossier d'un autre compte, faites-le glisser sur le nom de ce dossier. Le dossier copi&eacute; devient un sous-dossier.</li>
</ul>
</li>
</ol>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Filing_messagesIDX"></a> <a name="Saving_messagesIDX"></a> <a name="saving_mailSDX"></a> <a name="filing_mailSDX"></a> <a name="moving_mailSDX"></a> <a name="Mail_and_Newsgroups:filing_messagesIDX"></a> <a name="OPENING_FOLDERS"></a>

<h2>Archivage de messages dans des dossiers</h2>

<p>Vous pouvez d&eacute;placer des messages d'un dossier &agrave; un autre &agrave; l'aide des m&eacute;thodes suivantes&nbsp;:</p>

<ul>
<li>S&eacute;lectionnez le message, cliquez sur le bouton Fichier de la barre d'outils et choisissez le dossier de destination.</li>

<li>Glissez-d&eacute;placez des messages vers le dossier d&eacute;sir&eacute;.</li>

<li style="list-style: none">
<p><b>Remarque&nbsp;:</b> Si vous glissez-d&eacute;placez un message d'un dossier de serveur de messagerie IMAP ou POP vers un dossier local sur le disque dur, il est plac&eacute; dans le dossier local et supprim&eacute; du dossier du serveur.</p>
</li>
</ul>

<p>Pour copier un message d'un dossier &agrave; un autre&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le message et cliquez dessus avec le bouton droit pour s&eacute;lectionner le menu contextuel.</li>

<li>S&eacute;lectionnez "Copier vers" et s&eacute;lectionnez le compte et le dossier de destination dans la liste d&eacute;roulante.</li>
</ol>

<p><strong>Astuce&nbsp;</strong>: Ou bien, vous pouvez copier un message entre des dossiers en appuyant sur la touche Maj tout en faisant glisser le message de la liste des messages vers un autre dossier.</p>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:sharing_foldersIDX"></a> <a name="folder_propertiesSDX"></a> <a name="folder_privilegesSDX"></a> <a name="folder_permissionsSDX"></a> <a name="read_onlySDX"></a> <a name="read_write_and_manage_privilegesSDX"></a> <a name="subscribing_to_IMAP_foldersSDX"></a> <a name="joinSDX"></a> <a name="SHARING_FOLDERS"></a>

<h2>Partage de dossiers avec d'autres utilisateurs (IMAP uniquement)</h2>

<p>Les utilisateurs poss&eacute;dant des comptes de messagerie IMAP peuvent partager leurs dossiers de messages avec d'autres utilisateurs sur le m&ecirc;me r&eacute;seau. Le partage de dossiers permet &agrave; plusieurs utilisateurs de consulter et manipuler les m&ecirc;mes messages, comme dans un forum. Pour que vous puissiez utiliser des dossiers partag&eacute;s, votre serveur de messagerie IMAP doit prendre en charge la gestion des listes de contr&ocirc;le d'acc&egrave;s (ACL). V&eacute;rifiez aupr&egrave;s de votre administrateur syst&egrave;me ou service d'assistance si vous n'&ecirc;tes pas s&ucirc;r que votre serveur de messagerie IMAP prend en charge les dossiers partag&eacute;s.</p>

<p>Pour partager un dossier de messagerie avec d'autres utilisateurs du r&eacute;seau ou pour afficher les informations de partage d'un dossier, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>Dans un compte IMAP, s&eacute;lectionnez un dossier que vous souhaitez partager ou dont vous souhaitez visualiser les privil&egrave;ges de partage.

<p>Les dossiers faisant partie des Dossiers locaux ou appartenant &agrave; un compte de messagerie POP ne peuvent pas &ecirc;tre partag&eacute;s.</p>
</li>

<li>Ouvrez le menu Edition et choisissez Propri&eacute;t&eacute;s du dossier.</li>

<li>Cliquez sur l'onglet Partage.</li>

<li>Cliquez sur Privil&egrave;ges. Vous serez peut-&ecirc;tre invit&eacute; &agrave; entrer votre nom d'utilisateur et votre mot de passe r&eacute;seau.

<p>Le bouton Privil&egrave;ges est uniquement disponible si le serveur de messagerie IMAP permet de d&eacute;finir des privil&egrave;ges de partage de dossiers. Si ce bouton n'est pas disponible, vous pouvez afficher les privil&egrave;ges de partage du dossier mais ne pouvez pas les modifier.</p>
</li>

<li>Suivez les instructions &agrave; l'&eacute;cran pour ajouter des utilisateurs et d&eacute;finir leurs privil&egrave;ges d'acc&egrave;s au dossier.
<p><br></p>
<ul>
<li><strong>Privil&egrave;ges de lecture</strong> : Les utilisateurs peuvent lire les messages et en copier le contenu, mais ne peuvent pas modifier ni supprimer des messages, ni copier des messages dans le dossier. Ils peuvent marquer des messages comme lus ou non lus. Voir <a href="#mark_flag">Marquage de messages</a> pour des instructions sur le marquage des messages.</li>

<li><strong>Privil&egrave;ges de lecture et &eacute;criture</strong> : Outre les privil&egrave;ges de lecture, les utilisateurs ont le droit de modifier et supprimer des messages. Ils peuvent &eacute;galement copier ou d&eacute;placer des messages dans le dossier.</li>

<li><strong>Privil&egrave;ges de gestion</strong> : Outre les privil&egrave;ges de lecture et &eacute;criture, les utilisateurs ont le droit d'ajouter et supprimer des utilisateurs et de modifier leurs autorisations li&eacute;es au dossier.</li>
</ul>
</li>

<li>Cliquez sur OK pour confirmer vos modifications.</li>

<li>Cliquez sur OK pour fermer la bo&icirc;te de dialogue Propri&eacute;t&eacute;s du dossier.</li>
</ol>

<p>Dans la liste des dossiers de votre compte de messagerie, un dossier partag&eacute; pr&eacute;sente une ic&ocirc;ne distinctive montrant qu'il est partag&eacute;.</p>

<p>Pour envoyer un message indiquant aux autres comment ils peuvent s'abonner &agrave; votre dossier partag&eacute;, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>S&eacute;lectionnez le dossier partag&eacute;.</li>

<li>Cliquez avec le bouton droit pour afficher un menu contextuel et choisissez Copier l'emplacement du dossier.</li>

<li>Cliquez sur Composer pour afficher une fen&ecirc;tre de composition de message.</li>

<li>Cliquez dans le corps du message, ouvrez le menu Edition et choisissez Coller.</li>

<li>Adressez le message, tapez un objet et tapez le texte du message. Expliquez aux destinataires du message qu'ils peuvent s'abonner au dossier partag&eacute; en cliquant sur le lien que vous avez coll&eacute; dans le message.

<p>Seuls les destinataires situ&eacute;s sur le m&ecirc;me r&eacute;seau pourront s'abonner &agrave; votre dossier partag&eacute;.</p>
</li>

<li>Cliquez sur Envoyer.</li>
</ol>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:subscribing_to_foldersIDX"></a> <a name="folder_subscribing"></a>

<h3>Abonnement &agrave; un dossier partag&eacute;</h3>

<p>L'abonnement &agrave; un dossier partag&eacute; est semblable &agrave; l'abonnement &agrave; un forum. Pour vous abonner &agrave; un dossier partag&eacute;, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fichier et choisissez S'abonner. La bo&icirc;te de dialogue S'abonner s'affiche.</li>

<li>Au besoin, cliquez sur la liste d&eacute;roulante Compte pour s&eacute;lectionner un autre compte IMAP.</li>

<li>S&eacute;lectionnez le dossier auquel vous voulez vous abonner.</li>

<li>Cliquez sur S'abonner ou dans la colonne S'abonner &agrave; c&ocirc;t&eacute; du dossier. Une marque s'affiche &agrave; c&ocirc;t&eacute; de chaque dossier auquel vous vous abonnez. Cliquez sur Annuler l'abonnement pour annuler une s&eacute;lection.</li>

<li>Cliquez sur OK. La liste des dossiers auxquels vous &ecirc;tes abonn&eacute; s'affiche dans la fen&ecirc;tre Mail.</li>
</ol>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="labels:for_mail_messagesIDX"></a> <a name="Mail_and_Newsgroups:labeling_messagesIDX"></a> <a name="labeling_messages"></a>

<h2>Etiquetage de messages</h2>

<p>Vous pouvez appliquer des &eacute;tiquettes &agrave; des messages afin d'en faciliter l'organisation et la gestion des priorit&eacute;s. Vous pouvez appliquer une couleur et un texte d'&eacute;tiquette standard, ou personnaliser les couleurs ou le texte de l'&eacute;tiquette en fonction de vos besoins.</p>

<p>Une mani&egrave;re puissante d'utiliser les &eacute;tiquettes consiste &agrave; configurer un filtre de messages qui applique automatiquement des &eacute;tiquettes aux messages entrants provenant d'un exp&eacute;diteur sp&eacute;cifique. Par exemple, vous pouvez configurer un filtre tel que les messages provenant de votre patron soient &eacute;tiquet&eacute;s "Important" et apparaissent en rouge. Pour plus d'informations, voir <a href="#MAIL_FILTERS">Cr&eacute;ation de filtres de messages</a>.</p>

<p>&nbsp;</p>

<a name="label_apply"></a>

<h3>Application d'une &eacute;tiquette</h3>

<p>Pour appliquer une &eacute;tiquette &agrave; un message, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>S&eacute;lectionnez le message &agrave; &eacute;tiqueter.</li>

<li>Dans le menu Message, choisissez Etiquette.</li>

<li>Choisissez l'&eacute;tiquette &agrave; appliquer.</li>
</ol>

<p>L'en-t&ecirc;te du message change pour prendre la couleur d'&eacute;tiquette choisie. Pour voir le texte de l'&eacute;tiquette, vous devez afficher la colonne Etiquette dans la fen&ecirc;tre Mail.</p>

<p><strong>Astuce&nbsp;</strong>: Pour &eacute;tiqueter rapidement des messages ou supprimer rapidement une &eacute;tiquette, s&eacute;lectionnez un ou plusieurs messages et appuyez sur la touche 1, 2, 3, 4 ou 5 de votre clavier. Appuyez sur 0 pour supprimer une &eacute;tiquette.</p>

<p>Pour afficher la colonne Etiquette, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ul>
<li style="list-style: none"><a name="hide_columnsSDX"></a></li>

<li>Cliquez sur l'ic&ocirc;ne Afficher/masquer des colonnes <img src="images/columns.gif" width="23" height="20" alt="" border="0"> et s&eacute;lectionnez Etiquette dans la liste.</li>
</ul>

<p><strong>Remarque</strong>&nbsp;: Les &eacute;tiquettes de message s'appliquent &agrave; un compte sp&eacute;cifique. Par exemple, si vous d&eacute;placez ou copiez un message &eacute;tiquet&eacute; vers un autre compte de messagerie, l'&eacute;tiquette n'est pas conserv&eacute;e. De m&ecirc;me, si vous transf&eacute;rez un message &eacute;tiquet&eacute; &agrave; un autre destinataire, l'&eacute;tiquette n'est pas conserv&eacute;e. Pour les comptes de messagerie IMAP, si votre serveur IMAP prend en charge les mots cl&eacute;s d&eacute;finis par l'utilisateur, les &eacute;tiquettes de message sont maintenues lorsque vous vous connectez &agrave; votre compte de messagerie &agrave; partir d'un autre site. Dans un compte de messagerie AOL, lorsqu'un message &eacute;tiquet&eacute; est automatiquement d&eacute;plac&eacute; du dossier Nouveau courrier vers le dossier Ancien courrier, l'&eacute;tiquette est perdue.</p>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="label_customize"></a>

<h3>Personnalisation d'&eacute;tiquettes</h3>

<p>Vous pouvez personnaliser les couleurs ou le texte des &eacute;tiquettes &agrave; votre gr&eacute;.</p>

<p>Pour personnaliser des &eacute;tiquettes, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences. La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences s'affiche.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums, cliquez sur Etiquettes. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>

<li>Modifiez le texte de l'&eacute;tiquette ou remplacez-le par votre propre texte. L'&eacute;tiquette peut compter jusqu'&agrave; 32 caract&egrave;res.</li>

<li>Pour changer la couleur d'&eacute;tiquette, cliquez sur le bloc de couleur face &agrave; l'&eacute;tiquette et s&eacute;lectionnez une autre couleur.</li>

<li>Cliquez sur OK.</li>
</ol>

<p>Les changements sont imm&eacute;diatement appliqu&eacute;s &agrave; tous les messages &eacute;tiquet&eacute;s dans tous vos comptes de messagerie.</p>

<p><strong>Astuce&nbsp;</strong>: Pour r&eacute;tablir le texte et les couleurs par d&eacute;faut de l'&eacute;tiquette, proc&eacute;dez comme ci-dessus pour afficher les param&egrave;tres de l'&eacute;tiquette, puis cliquez sur Restaurer les valeurs par d&eacute;faut.</p>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="label_sort"></a>

<h3>Tri des messages par &eacute;tiquette</h3>

<p>Pour trier les messages par &eacute;tiquette, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Pour affiche la colonne Etiquette (si elle est masqu&eacute;e), cliquez sur l'ic&ocirc;ne Afficher/Masquer des colonnes <img src="images/columns.gif" width="23" height="20" alt="" border="0"> et s&eacute;lectionnez Etiquette dans la liste.</li>

<li>Cliquez sur la colonne Etiquette pour trier les messages par &eacute;tiquette et, dans chaque type d'&eacute;tiquette, par date.</li>
</ol>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="label_remove"></a>

<h3>Suppression d'&eacute;tiquettes</h3>

<p>Pour supprimer l'&eacute;tiquette d'un message, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez un ou plusieurs messages &eacute;tiquet&eacute;s.</li>

<li>Dans le menu Message, choisissez Etiquette.</li>

<li>Choisissez "Aucune" comme &eacute;tiquette de message.</li>
</ol>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:flagging_messagesIDX"></a> <a name="Mail_and_Newsgroups:marking_messagesIDX"></a> <a name="mark_flag"></a>

<h2>Marquage de messages</h2>

<p>Vous pourriez vouloir marquer un message lu comme non lu pour le relire ou y r&eacute;pondre plus tard.</p>

<p>Pour marquer un message comme non lu, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez un dossier de messagerie ou de forum pour afficher ses messages.</li>

<li>Cliquez dans la colonne Lu de chaque message &agrave; marquer comme non lu. Les messages marqu&eacute;s comme non lus pr&eacute;sentent un symbole <img src= "images/unread.gif"> dans la colonne Lu. Les messages marqu&eacute;s comme non lus pr&eacute;sentent un symbole <img src="images/read.gif"> dans la colonne Lu. Si la colonne Lu n'est pas visible, cliquez sur l'ic&ocirc;ne Afficher/Masquer des colonnes <img src="images/columns.gif" width="23" height="20" alt="" border="0"> et s&eacute;lectionnez Lu dans la liste.</li>
</ol>

<table>
<tr>
<td colspan="4"> <img src="images/read_column.gif" hspace="81" vspace="0"></td>
</tr>

<tr>
<td width="80"></td>
<td><b>Colonne Lu</b></td>
</tr>
</table>

<p>Vous pouvez marquer des messages &agrave; t&eacute;l&eacute;charger plus tard en vue d'une <a href="#OFFLINE_FLAGGED">utilisation hors ligne</a>.</p>

<p>Pour marquer des messages, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez un dossier de messagerie ou de forum pour afficher ses messages.</li>

<li>
Cliquez dans la colonne Marque de chaque message &agrave; t&eacute;l&eacute;charger.
 Une marque <img src="images/flag.gif"> s'affiche &agrave; l'endroit o&ugrave; vous avez cliqu&eacute; pour indiquer que le message a &eacute;t&eacute; marqu&eacute;. Si la colonne Marque n'est pas visible, cliquez sur l'ic&ocirc;ne Afficher/Masquer des colonnes <img src= "images/columns.gif" width="23" height="20" alt="" border="0"> et s&eacute;lectionnez Marque dans la liste.</li>
</ol>

<table>
<tr>
<td colspan="4"> <img src="images/flag_column.gif" hspace="81" vspace="0"></td>
</tr>

<tr>
<td width="80"></td>
<td><b>Colonne Marque</b></td>
</tr>
</table>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="MAIL_FILTERS"></a> <a name="Mail_and_Newsgroups:creating_filtersIDX"></a>

<h2>Cr&eacute;ation de filtres de messages</h2>

<p>Les filtres de messages permettent de g&eacute;rer et d'organiser les messages. Vous pouvez cr&eacute;er des filtres utilis&eacute;s par Netscape Messagerie &amp; forums pour effectuer automatiquement certaines actions sur les messages entrants en fonction de crit&egrave;res sp&eacute;cifi&eacute;s. Par exemple, vous pouvez cr&eacute;er un filtre de message qui d&eacute;place automatiquement les messages entrants vers un dossier sp&eacute;cifique. Les filtres de message s'appliquent &agrave; un compte sp&eacute;cifique.</p>

<p>Si vous n'avez pas encore affich&eacute; la bo&icirc;te de dialogue R&egrave;gles de filtre, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Outils et choisissez Filtres de messages. La bo&icirc;te de dialogue R&egrave;gles de filtre s'affiche.</li>

<li>Si vous avez plusieurs comptes de messagerie, s&eacute;lectionnez celui auquel appliquer le filtre.</li>

<li>Cliquez sur Nouveau. La bo&icirc;te de dialogue R&egrave;gles de filtre permet de sp&eacute;cifier les types de messages concern&eacute;s et l'action &agrave; effectuer par le filtre.</li>

<li>Entrez un nom pour le filtre.</li>

<li>S&eacute;lectionnez l'option de condition &agrave; utiliser par Netscape Mail&nbsp;: "R&eacute;pondent &agrave; <i>TOUTES</i> les conditions suivantes" (crit&egrave;res)  ou "R&eacute;pondent &agrave; <i>AU MOINS</i> une des conditions suivantes".</li>

<li>Utilisez les listes d&eacute;roulantes pour s&eacute;lectionner les crit&egrave;res de recherche (par exemple, "Objet", "Exp&eacute;diteur", "Contient", "Ne contient pas") et entrez le texte correspondant.

<p><strong>Astuce&nbsp;</strong>: Pour chercher des messages contenant un en-t&ecirc;te qui ne figure pas dans le premier menu d&eacute;roulant (par exemple, si vous souhaitez chercher des messages incluant l'en-t&ecirc;te Renvoy&eacute;-De), choisissez Personnaliser et tapez l'en-t&ecirc;te &agrave; rechercher. Netscape Messagerie &amp; forums ajoute votre en-t&ecirc;te personnalis&eacute; &agrave; la liste d&eacute;roulante, vous permettant ainsi de le s&eacute;lectionner pour chercher des entr&eacute;es correspondantes. Veillez &agrave; entrer correctement l'en-t&ecirc;te personnalis&eacute;, car Mail trouvera uniquement les entr&eacute;es qui correspondent exactement &agrave; ce que vous tapez.</p>
</li>

<li>Cliquez sur Davantage pour ajouter des crit&egrave;res et sur Moins pour en supprimer.</li>

<li>Utilisez la liste d&eacute;roulante pour s&eacute;lectionner l'action &agrave; appliquer aux messages par le filtre (par exemple, D&eacute;placer vers le dossier).

<p><strong>Astuce&nbsp;</strong>: Pour &eacute;tiqueter automatiquement les messages entrants, choisissez "Identifier le message" dans la liste d&eacute;roulante.</p>
</li>

<li>S&eacute;lectionnez un dossier de destination dans lequel stocker les messages ou cr&eacute;ez-en un.</li>

<li>Cliquez sur OK pour confirmer les param&egrave;tres.</li>

<li>Cliquez sur OK dans la bo&icirc;te de dialogue Filtres de messages. Le filtre est op&eacute;rationnel d&egrave;s que vous cliquez sur OK.</li>
</ol>

<a name="manage_filters"></a>

<p>Pour g&eacute;rer les filtres, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Outils et choisissez Filtres de messages. La bo&icirc;te de dialogue R&egrave;gles de filtre s'affiche.</li>

<li>Si vous avez plusieurs comptes de messagerie, s&eacute;lectionnez celui auquel appliquer le filtre.</li>

<li>S&eacute;lectionnez parmi les options suivantes&nbsp;:</li>

<ul>
<li><b>Pour activer ou d&eacute;sactiver un filtre&nbsp;</b>: Cliquez sur la case &agrave; cocher &agrave; droite du nom du filtre pour l'activer ou cliquez de nouveau dessus pour le d&eacute;sactiver.</li>

<li><b>Pour modifier un filtre&nbsp;</b>: S&eacute;lectionnez le filtre et cliquez sur Edition (ou double-cliquez sur le nom du filtre). Utilisez la bo&icirc;te de dialogue R&egrave;gles de filtre pour effectuer les modifications.</li>

<li><b>Pour supprimer un filtre&nbsp;</b>: S&eacute;lectionnez le nom du filtre et cliquez sur Supprimer.</li>

<li><b>Pour modifier l'ordre d'application des filtres&nbsp;</b>: Dans la liste, cliquez sur le nom d'un filtre, puis sur "D&eacute;placer vers le haut" ou "D&eacute;placer vers le bas" pour le d&eacute;placer.</li>


<p><b>Remarque</b>&nbsp;: Les filtres sont appliqu&eacute;s &agrave; chaque message entrant dans l'ordre de votre choix, jusqu'&agrave; ce qu'une action de filtre entra&icirc;ne la suppression du message ou son d&eacute;placement vers le dossier Inbox.</p>
</li>
</ul>
</li>

<li>Cliquez sur OK lorsque vous avez termin&eacute; de g&eacute;rer les filtres. Si vous avez cr&eacute;&eacute; un filtre, il commence &agrave; filtrer les messages entrants d&egrave;s que vous cliquez sur OK.</li>
</ol>

<p><b>Remarque</b>&nbsp;: Si vous supprimez un dossier utilis&eacute; pour stocker des messages filtr&eacute;s, le filtre ne fonctionnera plus. Les messages entrants correspondant aux crit&egrave;res de filtrage appara&icirc;tront dans la Bo&icirc;te de r&eacute;ception. Si vous renommez ou d&eacute;placez le dossier, le filtre est automatiquement mis &agrave; jour pour utiliser le dossier renomm&eacute; ou d&eacute;plac&eacute;.</p>

<p><b>Astuce&nbsp;</b>: Les filtres ne s'appliquent pas aux messages existants. Si vous avez des messages existants &agrave; d&eacute;placer vers un autre dossier, vous pouvez les <a href="#SEARCH_MAILNEWS">rechercher</a> et les archiver ensuite dans le dossier en question.</p>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="preventing_junk_mailSDX"></a> <a name="preventing_spamSDX"></a> <a name="sender_filter"></a>

<h3>Filtrage de messages provenant d'un exp&eacute;diteur sp&eacute;cifique</h3>

<p>Vous pouvez rapidement cr&eacute;er un filtre portant sur les messages en provenance d'un exp&eacute;diteur particulier. Par exemple, si vous souhaitez d&eacute;placer automatiquement tous les messages entrants &eacute;manant du professeur de votre enfant vers un dossier appel&eacute;  "Ecole", vous pouvez rapidement configurer un filtre &agrave; cette fin.</p>

<p>Pour cr&eacute;er un filtre affectant les messages d'un exp&eacute;diteur sp&eacute;cifique, &agrave; partir de la fen&ecirc;tre Mail:</p>

<ol>
<li>S&eacute;lectionnez un message d'un exp&eacute;diteur sp&eacute;cifique.</li>

<li>Dans le menu Message, choisissez Cr&eacute;er un filtre &agrave; partir du message. La bo&icirc;te de dialogue R&egrave;gles de filtre s'affiche. Sur la base de l'adresse &eacute;lectronique de l'exp&eacute;diteur, Netscape pr&eacute;-remplit le nom, les crit&egrave;res de correspondance et l'action du filtre (D&eacute;placer dans le dossier).</li>

<li>S&eacute;lectionnez un dossier de destination o&ugrave; stocker les messages entrants provenant de l'exp&eacute;diteur sp&eacute;cifi&eacute;, ou cr&eacute;ez-en un.</li>

<li>Cliquez sur OK pour confirmer les param&egrave;tres. La bo&icirc;te de dialogue <a href= "#manage_filters">R&egrave;gles de filtre</a> appara&icirc;t, o&ugrave; vous pouvez cr&eacute;er, supprimer ou modifier des filtres de messages.</li>

<li>Cliquez sur OK. Le filtre commence &agrave; filtrer les messages provenant de l'exp&eacute;diteur sp&eacute;cifi&eacute; d&egrave;s que vous cliquez sur OK.</li>
</ol>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

 <a name="Mail_and_Newsgroups:message_searchingIDX"></a> <a name="SEARCH_MAILNEWS"></a>

<h2>Recherche de messages</h2>

<p>Netscape Messagerie &amp; forums permet de rechercher rapidement du texte dans un message, chercher des messages par objet ou exp&eacute;diteur, ou combiner des crit&egrave;res pour soumettre tous les messages &agrave; une recherche approfondie dans un dossier, forum ou compte de messagerie sp&eacute;cifique.</p>

<p>Pour rechercher du texte dans un seul message, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez le message, ouvrez le menu Edition et choisissez Rechercher.</li>

<li>Dans la bo&icirc;te de dialogue, entrez le texte &agrave; rechercher.</li>

<li>Cliquez sur Rechercher trouver la premi&egrave;re occurrence du texte.</li>

<li>Continuez &agrave; cliquer sur Rechercher pour trouver d'autres occurrences ou cliquez sur Annuler une fois termin&eacute;.</li>

<li>S&eacute;lectionnez Poursuivre la recherche dans le menu Edition pour continuer &agrave; rechercher le texte dans le reste du message.</li>
</ol>

<p>Pour chercher rapidement des messages dans un dossier s&eacute;lectionn&eacute; par objet ou par exp&eacute;diteur, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>A droite de "L'objet ou l'exp&eacute;diteur contient", tapez le texte de l'objet ou le nom de l'exp&eacute;diteur &agrave; rechercher. Vous pouvez taper une partie de l'objet ou de l'exp&eacute;diteur, ou taper le texte ou nom exact &agrave; rechercher.

<p>D&egrave;s que vous arr&ecirc;tez de taper, Netscape Messagerie &amp; Forums affiche les messages situ&eacute;s dans le dossier s&eacute;lectionn&eacute; et dont l'objet ou l'exp&eacute;diteur contient le texte recherch&eacute;.</p>
</li>

<li>Cliquez sur Supprimer pour effacer le texte de recherche et afficher tous les messages du dossier s&eacute;lectionn&eacute;.</li>
</ol>

<p>&nbsp;</p>

<a name="quick_search_for_mail_messagesSDX"></a> <a name="SEARCH_MESSAGES"></a>

<h3>Recherche de messages sp&eacute;cifiques</h3>

<p>Vous pouvez rechercher des messages sp&eacute;cifiques dans des forums ou des dossiers de messagerie. Pour afficher la bo&icirc;te de dialogue Chercher dans les messages, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>
<ol>
<li>Ouvrez le menu Outils et choisissez Rechercher dans les messages. La bo&icirc;te de dialogue Chercher dans les messages s'affiche.</li>

<li>Face &agrave; "Rechercher des messages dans", choisissez le compte, le forum ou le dossier o&ugrave; effectuer la recherche.</li>

<li>S&eacute;lectionnez "Chercher dans les sous-dossiers" pour inclure tous les sous-dossiers dans la recherche.</li>

<li>S&eacute;lectionnez l'option de correspondance &agrave; utiliser par Messagerie &amp; forums pour rechercher des messages qui r&eacute;pondent &agrave; toutes ou au moins une des conditions (crit&egrave;res) choisies.</li>

<li>Utilisez les listes d&eacute;roulantes pour s&eacute;lectionner les crit&egrave;res de recherche (par exemple, "Objet" et "Contient") et entrez le texte ou l'expression &agrave; rechercher.

<p><strong>Astuce&nbsp;</strong>: Pour chercher des messages contenant un en-t&ecirc;te qui ne figure pas dans le premier menu d&eacute;roulant (par exemple, si vous souhaitez chercher des messages incluant l'en-t&ecirc;te Renvoy&eacute;-De), choisissez Personnaliser et tapez l'en-t&ecirc;te &agrave; rechercher. Netscape Messagerie &amp; forums ajoute votre en-t&ecirc;te personnalis&eacute; &agrave; la liste d&eacute;roulante, vous permettant ainsi de le s&eacute;lectionner pour chercher des entr&eacute;es correspondantes. Veillez &agrave; entrer correctement l'en-t&ecirc;te personnalis&eacute;, car Mail trouvera uniquement les entr&eacute;es qui correspondent exactement &agrave; ce que vous tapez.</p>
</li>

<li>Cliquez sur Davantage pour ajouter des crit&egrave;res et sur Moins pour en supprimer.</li>

<li>Cliquez sur Rechercher pour commencer ou sur Supprimer pour effacer les entr&eacute;es. Les r&eacute;sultats de la recherche apparaissent dans la partie inf&eacute;rieure de la bo&icirc;te de dialogue Chercher dans les messages. </li>

<ul>
<li>Pour ouvrir un message et le lire, s&eacute;lectionnez-le et cliquez sur Ouvrir ou double-cliquez dessus.</li>

<li>Pour trier les messages dans un ordre diff&eacute;rent, cliquez sur la colonne selon laquelle trier.</li>

<li>Pour d&eacute;placer ou copier un message de la zone R&eacute;sultats dans un autre dossier, s&eacute;lectionnez-le et choisissez le dossier de destination dans la liste d&eacute;roulante Fichier. Si ce dossier se trouve dans le m&ecirc;me compte, le message y est d&eacute;plac&eacute;. S'il se trouve dans un autre compte, il y est copi&eacute;.</li>

<li>Pour supprimer un message de la zone R&eacute;sultats, s&eacute;lectionnez le message puis cliquez sur Supprimer.</li>

<li>Pour ouvrir le dossier o&ugrave; se trouve le message, s&eacute;lectionnez le message et cliquez sur Ouvrir le dossier des messages.</li>
</ul>
</ol>

<p>[&nbsp;<a href="#ORGANIZING_MAIL">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>


<hr> <a name="Mail_and_Newsgroups:importing_mailIDX"></a> <a name="Outlook_messagesSDX"></a> <a name="Outlook_Express_messagesSDX"></a> <a name="Eudora_messagesSDX"></a> <a name="importing_Communicator_messagesSDX"></a> <a name="importing_mail"></a>
<h1>Importation de messages d'autres programmes</h1>

<p>Cette section d&eacute;crit l'importation de messages &eacute;lectroniques et de param&egrave;tres depuis Netscape Communicator, Outlook, Outlook Express et Eudora. Pour importer des carnets d'adresses &agrave; partir de ces programmes, voir  <a href= "#import_address_book">Importation de carnets d'adresses</a>.</p>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#importing_mail_messages">Importation de messages</a></p>

<p><a href="#importing_mail_settings">Importation de param&egrave;tres de messagerie</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="importing_mail_messages"></a>

<h2>Importation de messages</h2>

<p>Pour importer des messages &eacute;lectroniques de Netscape Communicator, Outlook, Outlook Express ou Eudora, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>Dans le menu Outils, choisissez Importer. L'Assistant d'importation s'affiche.</li>

<li>Suivez les instructions pour importer des messages &eacute;lectroniques.</li>
</ol>

<p>Pour Netscape Communicator, l'assistant importe une copie de tous les dossiers de messages Communicator contenus dans Dossiers locaux. Les messages import&eacute;s sont ajout&eacute;s &agrave; un nouveau dossier sous Dossiers locaux dans la fen&ecirc;tre Mail. Les dossiers Communicator sont conserv&eacute;s &agrave; leur emplacement d'origine).</p>

<p>[&nbsp;<a href="#importing_mail">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="importing_mail_settings"></a>

<h2>Importation de param&egrave;tres de messagerie</h2>

<p>Pour importer des param&egrave;tres de messagerie &agrave; partir d'Outlook, Outlook Express ou Eudora, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>Dans le menu Outils, choisissez Importer. L'Assistant d'importation s'affiche.</li>

<li>Suivez les instructions pour importer des param&egrave;tres de messagerie.</li>
</ol>

<p>[&nbsp;<a href="#importing_mail">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>


<hr> <a name="Newsgroups:getting_startedIDX"></a> <a name="Newsgroups:usingIDX"></a> <a name="STARTING_NEWSGROUPS"></a>
<h1>Premiers pas dans les forums</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#SUBSCRIBE_LIST_ALL">Abonnement &agrave; des forums</a></p>

<p><a href="#opening_groups_server">Lecture de messages de forums</a></p>

<p><a href="#about_posting">Envoi de messages de forums</a></p>

<p><a href="#REPLYING">Contribution &agrave; des discussions en cours</a></p>

<p><a href="#MONITORING">Contr&ocirc;le de fils de discussion</a></p>

<p><a href="#DELETE_NEWSGROUP">Suppression d'un forum</a></p>

<p><a href="#ADD_SERVER">Ajout d'un serveur de forums</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="join_newsgroupsSDX"></a> <a name="SUBSCRIBE_LIST_ALL"></a>


<h2>Abonnement &agrave; des forums</h2>

<p>Si vous avez configur&eacute; un <a href="#NEWSGROUP">compte</a> sur un serveur de forums, vous pouvez vous abonner &agrave; des forums (&eacute;galement appel&eacute;s groupes de discussion).</p>

<p>Pour vous abonner &agrave; un forum, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Fichier et choisissez S'abonner. La bo&icirc;te de dialogue S'abonner s'affiche.</li>

<li>Au besoin, cliquez sur la liste d&eacute;roulante Compte pour s&eacute;lectionner un autre compte de forums.</li>

<li>S&eacute;lectionnez un forum. Pour s&eacute;lectionner plusieurs forums, Ctrl+cliquez (Windows et Linux) ou Commande+cliquez (Macintosh OS) sur chaque forum suppl&eacute;mentaire.</li>

<li>Cliquez sur S'abonner ou dans la colonne S'abonner &agrave; c&ocirc;t&eacute; d'un forum. Une marque s'affiche &agrave; c&ocirc;t&eacute; de chaque forum auquel vous vous abonnez. Cliquez sur Annuler l'abonnement pour annuler une s&eacute;lection.</li>

<li>Cliquez sur OK. La liste des forums auxquels vous &ecirc;tes abonn&eacute; s'affiche dans la fen&ecirc;tre Courrier.</li>
</ol>

<p>Si vous utilisez un serveur de messagerie IMAP, vous pouvez &eacute;galement vous abonner &agrave; des dossiers de messages situ&eacute;s sur un serveur IMAP. Votre dossier Inbox est un type de dossier de messages. Respectez les instructions qui pr&eacute;c&egrave;dent pour vous abonner, mais s&eacute;lectionnez un compte dans la liste d&eacute;roulante Compte. Pour plus d'informations sur le partage de dossiers et l'abonnement &agrave; des dossiers, voir  <a href= "#SHARING_FOLDERS">Partage de dossiers avec d'autres utilisateurs (IMAP uniquement)</a>.</p>

<p>[&nbsp;<a href="#STARTING_NEWSGROUPS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="opening_groups_server"></a>

<h2>Lecture de messages de forums</h2>

<p>Lorsque vous ouvrez votre serveur de forums, la liste des forums auxquels vous &ecirc;tes abonn&eacute; s'affiche. Le serveur t&eacute;l&eacute;charge les <i>en-t&ecirc;tes</i> des nouveaux messages de chaque forum.</p>

<p>Pour lire les messages des forums, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Double-cliquez sur l'ic&ocirc;ne d'un serveur pour afficher ses forums. En l'absence de forum affich&eacute;, vous devez vous abonner.</li>

<li>Cliquez sur le nom d'un forum pour voir ses messages.</li>

<li>Cliquez sur un message pour le lire. Cliquez sur le bouton Fil pour afficher toutes les r&eacute;ponses sous le message original. Vous pouvez cliquer sur un en-t&ecirc;te pour afficher le message correspondant. Vous pouvez <a href= "#about_posting">lancer un nouveau fil</a> ou <a href="#REPLYING">envoyer un message</a> de r&eacute;ponse.</li>
</ol>

<p>[&nbsp;<a href="#STARTING_NEWSGROUPS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="about_posting"></a>

<h2>Envoi de messages de forums</h2>

<p>Pour lancer de nouveaux fils (discussions)&nbsp;:</p>

<ol>
<li>>S&eacute;lectionnez l'un des forums auxquels vous &ecirc;tes abonn&eacute; dans la fen&ecirc;tre Courrier.</li>

<li>Cliquez sur Composer.</li>

<li><a href="#COMPOSING_MESSAGES">Composez </a>le message et cliquez sur Envoyer.</li>

<li>Cliquez sur Obtenir msg pour voir votre message sur le forum.</li>
</ol>

<p>[&nbsp;<a href="#STARTING_NEWSGROUPS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="postingSDX"></a> <a name="REPLYING"></a>

<h2>Contribution &agrave; des discussions en cours</h2>

<p>Pour envoyer une r&eacute;ponse au forum :</p>

<ol>
<li>Dans la liste des messages, s&eacute;lectionnez celui auquel vous souhaitez r&eacute;pondre.</li>

<li>Cliquez sur R&eacute;pondre.</li>

<li><a href="#COMPOSING_MESSAGES">Composez </a>le message et cliquez sur Envoyer.</li>
</ol>

<p>Pour r&eacute;pondre &agrave; une personne ainsi qu'&agrave; l'ensemble du groupe :</p>

<ol>
<li>Dans la liste des messages, s&eacute;lectionnez celui auquel vous souhaitez r&eacute;pondre.</li>

<li>Cliquez sur R&eacute;pondre &agrave; tous.</li>

<li>Composez le message et cliquez sur Envoyer.</li>
</ol>

<p>Pour rediriger un message vers un autre forum&nbsp;:</p>

<ul>
<li>Cliquez sur R&eacute;pondre et s&eacute;lectionnez "Suivi" dans la liste d&eacute;roulante des types de destinataires. Les r&eacute;ponses ult&eacute;rieures seront envoy&eacute;es au forum sp&eacute;cifi&eacute;.</li>
</ul>

<p>[&nbsp;<a href="#STARTING_NEWSGROUPS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="ignore_threadSDX"></a> <a name="watch_threadSDX"></a> <a name="MONITORING"></a>

<h2>Contr&ocirc;le de fils de discussion</h2>

<p>Pour contr&ocirc;ler les messages non lus dans les fils qui vous int&eacute;ressent&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez un message dans un fil.</li>

<li>Ouvrez le menu Message, choisissez Observer le fil de discussion.</li>

<li>Pour contr&ocirc;ler d'autres fils, r&eacute;p&eacute;tez les &eacute;tapes 1 et 2 pour les messages d'autres fils.</li>

<li>Lorsque vous &ecirc;tes pr&ecirc;t &agrave; observer les messages de ces fils, ouvrez le menu Afficher, s&eacute;lectionnez Messages, puis Fils de discussion observ&eacute;s avec messages non lus. Netscape Messagerie &amp; forums n'affiche que les fils observ&eacute;s contenant des messages non lus.</li>

<li>Ouvrez le menu Afficher, choisissez Messages, puis Tout pour r&eacute;afficher tous les messages du forum.</li>
</ol>

<p>Pour ignorer un fil de discussion&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez un message dans un le fil.</li>

<li>Dans le menu Message, choisissez Ignorer le fil de discussion. Netscape Messagerie &amp; forums marque tous les messages du fil comme lus, ainsi que les nouvelles r&eacute;ponses correspondant &agrave; ce fil.</li>

<li>Pour afficher les fils ignor&eacute;s, dans le menu Afficher, choisissez Messages, puis Fils de discussion ignor&eacute;s.</li>
</ol>

<p>[&nbsp;<a href="#STARTING_NEWSGROUPS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="DELETE_NEWSGROUP"></a>

<h2>Suppression d'un forum</h2>

<p>Pour supprimer un forum de la liste :</p>

<ul>
<li type="disc">S&eacute;lectionnez l'ic&ocirc;ne correspondante et appuyez sur Suppr.</li>
</ul>

<p>[&nbsp;<a href="#STARTING_NEWSGROUPS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="ADD_SERVER"></a>

<h2>Ajout d'un serveur de forums</h2>

<p>Si le forum auquel vous souhaitez vous abonner se trouve sur un autre serveur, vous devez d'abord configurer l'acc&egrave;s &agrave; ce dernier.</p>

<p>Pour configurer un nouveau serveur de forums, ouvrez le menu Fichier de la fen&ecirc;tre Mail et choisissez Nouveau, puis Compte.</p>

<ul>
<li>Dans l'Assistant des comptes, sp&eacute;cifiez que le nouveau compte est un compte de forum.</li>
</ul>

<p>Une fois l'acc&egrave;s au nouveau serveur d&eacute;fini, vous pouvez <a href= "#SUBSCRIBE_LIST_ALL">vous abonner</a> aux forums qu'il h&eacute;berge. Dans la fen&ecirc;tre Mail, ouvrez le menu Fichier et choisissez S'abonner.</p>

<p>[&nbsp;<a href="#STARTING_NEWSGROUPS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="offline_mailSDX"></a> <a name="offline_messagesSDX"></a> <a name="downloading_messagesSDX"></a> <a name="Mail_and_Newsgroups:working_offlineIDX"></a> <a name="Working_OfflineIDX"></a> <a name="Offline:Mail_and_NewsgroupsIDX"></a>

<hr> <a name="WORKING_OFFLINE"></a>
<h1>Travail hors ligne</h1>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="500" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#OFFLINE_SETUP">Configuration de Netscape Messagerie &amp; forums pour travailler hors ligne</a></p>

<p><a href="#OFFLINE_INBOX">T&eacute;l&eacute;chargement de la Bo&icirc;te de r&eacute;ception pour une utilisation hors ligne</a></p>

<p><a href="#OFFLINE_FOLDER">T&eacute;l&eacute;chargement d'un dossier pour une utilisation hors ligne</a></p>

<p><a href="#OFFLINE_FLAGGED">T&eacute;l&eacute;chargement de messages s&eacute;lectionn&eacute;s ou marqu&eacute;s pour une utilisation hors ligne</a></p>

<p><a href="#OFFLINE_DIRECTORY">T&eacute;l&eacute;chargement d'entr&eacute;es de r&eacute;pertoire pour une utilisation hors ligne</a></p>

<p><a href="#OFFLINE_ACCOUNTS">Configuration des comptes pour travailler hors ligne</a></p>

<p><a href="#OFFLINE_ITEMS">S&eacute;lection d'&eacute;l&eacute;ments pour un affichage hors ligne</a></p>

<p><a href="#OFFLINE_SYNC">T&eacute;l&eacute;chargement et synchronisation des messages</a></p>

<p><a href="#OFFLINE_GO">Travail hors ligne et reconnexion ult&eacute;rieure</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="reconnectSDX"></a> <a name="disconnectSDX"></a> <a name="OFFLINE_SETUP"></a>

<h2>Configuration de Netscape Messagerie &amp; forums pour travailler hors ligne</h2>

<p>La fonction hors ligne de Netscape Messagerie &amp; forums permet de t&eacute;l&eacute;charger le courrier et de le consulter hors ligne (d&eacute;connect&eacute; d'Internet). Si vous utilisez une connexion par modem pour acc&eacute;der au courrier et souhaitez r&eacute;duire votre temps de connexion ou si vous devez vous d&eacute;connecter momentan&eacute;ment du r&eacute;seau de votre entreprise en voyage ou en d&eacute;placement, vous pouvez t&eacute;l&eacute;charger le courrier pour le consulter hors ligne. La fonction hors ligne peut t&eacute;l&eacute;charger automatiquement les messages entrants et envoyer tous les messages sortants lors de la prochaine reconnexion.</p>

<p>Si vous souhaitez travailler occasionnellement hors ligne, Netscape Messagerie &amp; forums permet d'effectuer ais&eacute;ment les op&eacute;rations suivantes&nbsp;:</p>

<ul>
<li>t&eacute;l&eacute;chargement de la Bo&icirc;te de r&eacute;ception pour une utilisation hors ligne</li>

<li>t&eacute;l&eacute;chargement d'un dossier pour une utilisation hors ligne</li>

<li>t&eacute;l&eacute;chargement des messages s&eacute;lectionn&eacute;s ou marqu&eacute;s pour une utilisation hors ligne</li>

<li>t&eacute;l&eacute;chargement d'entr&eacute;es des contacts AIM dans votre carnet d'adresses pour une utilisation hors ligne.</li>
</ul>

<p>Si vous travaillez fr&eacute;quemment hors ligne, Netscape Messagerie &amp; forums permet &eacute;galement d'effectuer les op&eacute;rations suivantes&nbsp;:</p>

<ul>
<li>configuration d'un ou plusieurs comptes pour une utilisation hors ligne</li>

<li>d&eacute;finition de pr&eacute;f&eacute;rences Hors ligne et espace disque pour chaque compte</li>

<li>s&eacute;lection des dossiers et forums &agrave; consulter hors ligne</li>
</ul>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_INBOX"></a>

<h2>T&eacute;l&eacute;chargement de la Bo&icirc;te de r&eacute;ception pour une utilisation hors ligne</h2>

<p>Vous pouvez indiquer &agrave; Netscape Messagerie &amp; forums de t&eacute;l&eacute;charger automatiquement vos messages de Bo&icirc;te de r&eacute;ception pour une utilisation hors ligne. Lorsque vous vous reconnectez ult&eacute;rieurement, Netscape Messagerie &amp; forums synchronise automatiquement les messages de la Bo&icirc;te de r&eacute;ception avec le serveur.</p>

<p>Pour t&eacute;l&eacute;charger automatiquement la Bo&icirc;te de r&eacute;ception pour une utilisation hors ligne, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>A gauche de la bo&icirc;te de dialogue, sous le nom du compte &agrave; utiliser hors ligne, s&eacute;lectionnez Hors ligne &amp; espace disque. Cette cat&eacute;gorie n'est pas disponible pour les comptes POP.</li>

<li>Cochez la case "Rendre les messages de ma Bo&icirc;te de r&eacute;ception disponibles lorsque je travaille hors ligne".</li>

<li>Cliquez sur OK.</li>

<li>Dans le volet des dossiers, sous le nom du compte &agrave; utiliser hors ligne, cliquez sur un dossier autre que la bo&icirc;te de r&eacute;ception. Par exemple, cliquez sur le dossier Sent ou Drafts. Cliquez ensuite sur le dossier Inbox pour commencer &agrave; t&eacute;l&eacute;charger ses messages.</li>

<li>Une fois le t&eacute;l&eacute;chargement termin&eacute;, cliquez sur l'indicateur En ligne/Hors ligne <img src="images/online.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail (&agrave; gauche de l'ic&ocirc;ne Cookie) pour passer hors ligne.</li>
</ol>

<p>Netscape Messagerie &amp; forums t&eacute;l&eacute;charge automatiquement tous les messages de la Bo&icirc;te de r&eacute;ception pour pouvoir les lire et y r&eacute;pondre hors ligne. Apr&egrave;s la d&eacute;connexion, Netscape Messagerie &amp; forums reste ouvert pour vous permettre de continuer &agrave; travailler avec les messages.</p>

<p>Pour vous reconnecter &agrave; Internet et travailler en ligne&nbsp;:</p>

<ul>
<li>Cliquez sur l'indicateur En ligne/Hors ligne <img src= "images/offline.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail (&agrave; gauche de l'ic&ocirc;ne Cookie) pour vous mettre &agrave; nouveau en ligne. <br>
</li>
</ul>

<p>Lorsque vous vous reconnectez, Netscape Messagerie &amp; forums synchronise automatiquement les messages de la Bo&icirc;te de r&eacute;ception avec le serveur, en r&eacute;pliquant les modifications apport&eacute;es hors ligne.</p>

<p><b>Astuce&nbsp;</b>: Netscape Messagerie &amp; forums enregistre les messages envoy&eacute;s lors du travail hors ligne dans le sous-dossier Unsent Messages du dossier Dossiers locaux. Pour que Netscape Messagerie &amp; forums envoie automatiquement les messages non envoy&eacute;s &agrave; la reconnexion, utilisez l'option Pr&eacute;f&eacute;rences du menu Edition pour modifier vos <a href="#PREFERENCES_MAILNEWS_OFFLINE">pr&eacute;f&eacute;rences hors ligne</a> pour tous vos comptes.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="offline_folder_propertiesSDX"></a> <a name="OFFLINE_FOLDER"></a>

<h2>T&eacute;l&eacute;chargement d'un dossier pour une utilisation hors ligne</h2>

<p>Pour t&eacute;l&eacute;charger un dossier sp&eacute;cifique pour une utilisation hors ligne, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>A gauche de la fen&ecirc;tre Mail, s&eacute;lectionnez le dossier &agrave; t&eacute;l&eacute;charger pour une utilisation hors ligne.</li>

<li>Ouvrez le menu Edition et choisissez Propri&eacute;t&eacute;s du dossier. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s s'affiche.</li>

<li>Cliquez sur l'onglet Hors ligne.</li>

<li>Cochez la case "S&eacute;lectionnez ce dossier pour une utilisation hors ligne".</li>

<li>Cliquez sur T&eacute;l&eacute;charger maintenant pour t&eacute;l&eacute;charger imm&eacute;diatement les messages du dossier. Vous pouvez &eacute;galement continuer &agrave; travailler et passer &agrave; l'&eacute;tape suivante lorsque vous voulez vous d&eacute;connecter.</li>

<li>Cliquez sur l'indicateur En ligne/Hors ligne <img src="images/online.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail pour vous mettre hors ligne.</li>

<li>Dans la bo&icirc;te de dialogue Travailler hors ligne, cliquez sur T&eacute;l&eacute;charger.</li>
</ol>

<p>Netscape Messagerie &amp; forums t&eacute;l&eacute;charge automatiquement tous les messages du dossier s&eacute;lectionn&eacute; pour pouvoir les lire et y r&eacute;pondre hors ligne. Apr&egrave;s la d&eacute;connexion, Netscape Messagerie &amp; forums reste ouvert pour vous permettre de continuer &agrave; travailler avec les messages.</p>

<p><b>Remarque&nbsp;:</b> Les en-t&ecirc;tes de message qui ont &eacute;t&eacute; t&eacute;l&eacute;charg&eacute;s pour lecture hors ligne pr&eacute;sentent une enveloppe ou une ic&ocirc;ne de forum gris plus fonc&eacute;.</p>

<p>Pour vous reconnecter &agrave; Internet et travailler en ligne&nbsp;:</p>

<ul>
<li>Cliquez sur l'indicateur En ligne/Hors ligne <img src= "images/offline.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail (&agrave; gauche de l'ic&ocirc;ne Cookie) pour vous mettre &agrave; nouveau en ligne. <br>
</li>
</ul>

<p>Netscape Messagerie &amp; forums synchronise automatiquement les dossiers hors ligne avec le serveur, en r&eacute;pliquant les changements apport&eacute;s lors du travail hors ligne.</p>

<p><b>Astuce&nbsp;</b>: Netscape Messagerie &amp; forums enregistre les messages envoy&eacute;s lors du travail hors ligne dans le sous-dossier Unsent Messages du dossier Dossiers locaux. A la reconnexion, s&eacute;lectionnez Envoyer les messages de la Bo&icirc;te d'envoi dans le menu Fichier pour envoyer simultan&eacute;ment tous les messages enregistr&eacute;s. Pour que Netscape Messagerie &amp; forums envoie automatiquement les messages non envoy&eacute;s &agrave; la reconnexion, utilisez l'option Pr&eacute;f&eacute;rences du menu Edition pour modifier vos <a href="#PREFERENCES_MAILNEWS_OFFLINE">pr&eacute;f&eacute;rences hors ligne</a>.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_FLAGGED"></a>

<h2>T&eacute;l&eacute;chargement de messages s&eacute;lectionn&eacute;s ou marqu&eacute;s pour une utilisation hors ligne</h2>

<p>Pour t&eacute;l&eacute;charger des messages s&eacute;lectionn&eacute;s pour une utilisation hors ligne, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez un dossier de messagerie ou de forum pour afficher ses messages.</li>

<li>S&eacute;lectionnez les messages &agrave; t&eacute;l&eacute;charger, comme suit&nbsp;:
<p><br></p>
<ul>
<li>Pour s&eacute;lectionner un groupe de messages adjacents, cliquez sur le premier puis Maj-cliquez pour s&eacute;lectionner le dernier du groupe.</li>

<li>Pour s&eacute;lectionner des messages non cons&eacute;cutifs dans la liste, maintenez la touche Ctrl (Windows et Linux) ou Commande (Macintosh OS) enfonc&eacute;e et cliquez sur chaque message.</li>
</ul>
</li>

<li>Ouvrez le menu Fichier, s&eacute;lectionnez Hors ligne puis Retirer les messages s&eacute;lectionn&eacute;s. Netscape Messagerie &amp; forums t&eacute;l&eacute;charge les messages s&eacute;lectionn&eacute;s.</li>

<li>Une fois le t&eacute;l&eacute;chargement termin&eacute;, cliquez sur l'indicateur En ligne/Hors ligne dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail (&agrave; gauche de l'ic&ocirc;ne Cookie) pour passer hors ligne.</li>
</ol>

<p>Pour t&eacute;l&eacute;charger des messages marqu&eacute;s pour une utilisation hors ligne, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>S&eacute;lectionnez un dossier de messagerie ou de forum pour afficher ses messages.</li>

<li>Cliquez dans la colonne d'indicateur de chaque message &agrave; t&eacute;l&eacute;charger. Un indicateur s'affiche l&agrave; o&ugrave; vous avez cliqu&eacute; pour indiquer que le message a &eacute;t&eacute; marqu&eacute;. Si la colonne Marque n'est pas visible, cliquez sur l'ic&ocirc;ne Afficher/Masquer des colonnes <img src="images/columns.gif" width="23" height="20" alt="" border="0"> et s&eacute;lectionnez Marque dans la liste.</li>

<li>Dans le menu Fichier, choisissez Hors ligne, puis Retirer les messages marqu&eacute;s. Netscape Messagerie &amp; forums t&eacute;l&eacute;charge les messages marqu&eacute;s.</li>

<li>Une fois le t&eacute;l&eacute;chargement termin&eacute;, cliquez sur l'ic&ocirc;ne En ligne/Hors ligne dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail (&agrave; gauche de l'ic&ocirc;ne Cookie) pour passer hors ligne.</li>
</ol>

<p>Apr&egrave;s la d&eacute;connexion, Netscape Messagerie &amp; forums reste ouvert pour vous permettre de continuer &agrave; travailler avec les messages.</p>

<p><b>Remarque&nbsp;:</b> Les en-t&ecirc;tes de message qui ont &eacute;t&eacute; t&eacute;l&eacute;charg&eacute;s pour lecture hors ligne pr&eacute;sentent une enveloppe ou une ic&ocirc;ne de forum gris plus fonc&eacute;.</p>

<p>Pour vous reconnecter &agrave; Internet et travailler en ligne&nbsp;:</p>

<ul>
<li>Cliquez sur l'indicateur En ligne/Hors ligne <img src= "images/offline.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail pour vous reconnecter.</li>
</ul>

<p><b>Astuce&nbsp;</b>: Netscape Messagerie &amp; forums enregistre les messages envoy&eacute;s lors du travail hors ligne dans le sous-dossier Unsent Messages du dossier Dossiers locaux. A la reconnexion, s&eacute;lectionnez Envoyer les messages de la Bo&icirc;te d'envoi dans le menu Fichier pour envoyer simultan&eacute;ment tous les messages enregistr&eacute;s. Pour que Netscape Messagerie &amp; forums envoie automatiquement les messages non envoy&eacute;s &agrave; la reconnexion, utilisez l'option Pr&eacute;f&eacute;rences du menu Edition pour modifier vos <a href="#PREFERENCES_MAILNEWS_OFFLINE">pr&eacute;f&eacute;rences hors ligne</a>.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_DIRECTORY"></a> <a name="download_LDAPSDX"></a> <a name="offline_LDAPSDX"></a> <a name="offline_directorySDX"></a> <a name="LDAP_directorySDX"></a> <a name="offline_replicationSDX"></a> <a name="synchronizationSDX"></a> <a name="LDAP_updateSDX"></a>

<h2>T&eacute;l&eacute;chargement d'entr&eacute;es de r&eacute;pertoire pour une utilisation hors ligne</h2>

<p>Vous pouvez t&eacute;l&eacute;charger (r&eacute;pliquer) les entr&eacute;es d'un serveur d'annuaire vers votre ordinateur pour en disposer hors ligne. Apr&egrave;s avoir t&eacute;l&eacute;charg&eacute; des entr&eacute;es de r&eacute;pertoire, vous pouvez utiliser la m&ecirc;me proc&eacute;dure pour mettre &agrave; jour votre copie locale des entr&eacute;es d'apr&egrave;s les entr&eacute;es les plus r&eacute;centes du serveur.</p>

<p>Pour t&eacute;l&eacute;charger ou mettre &agrave; jour un r&eacute;pertoire LDAP pour une utilisation hors ligne :</p>

<ol>
<li>V&eacute;rifiez que vous &ecirc;tes en ligne.</li>

<li>Ouvrez le menu Fen&ecirc;tre et choisissez Carnet d'adresses.</li>

<li>Dans la fen&ecirc;tre Carnet d'adresses, s&eacute;lectionnez le r&eacute;pertoire &agrave; t&eacute;l&eacute;charger (r&eacute;pliquer).</li>

<li>Cliquez sur Propri&eacute;t&eacute;s dans la barre d'outils Carnet d'adresses. La bo&icirc;te de dialogue Propri&eacute;t&eacute;s du serveur d'annuaire s'affiche.</li>

<li>Cliquez sur l'onglet Hors ligne.</li>

<li>Cliquez sur T&eacute;l&eacute;charger maintenant pour commencer la copie des entr&eacute;es vers votre ordinateur.</li>

<li>Au besoin, entrez votre nom d'utilisateur et votre mot de passe r&eacute;seau, puis cliquez sur OK pour commencer le t&eacute;l&eacute;chargement.</li>

<li style="list-style: none">
<p>Selon le nombre d'entr&eacute;es de r&eacute;pertoire, le t&eacute;l&eacute;chargement peut prendre du temps &ndash; soyez patient.</p>
</li>
</ol>

<p>Une fois le t&eacute;l&eacute;chargement termin&eacute;, vous pouvez travailler hors ligne et effectuer des recherches dans le r&eacute;pertoire ou l'utiliser pour le remplissage automatique de l'adresse lors de la composition de messages. Apr&egrave;s avoir utilis&eacute; votre copie locale du r&eacute;pertoire pendant un certain temps, vous souhaiterez peut-&ecirc;tre l'actualiser d'apr&egrave;s les entr&eacute;es les plus r&eacute;centes du serveur d'annuaire. Pour mettre &agrave; jour votre copie locale, suivez la proc&eacute;dure d&eacute;crite plus haut.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_ACCOUNTS"></a>

<h2>Configuration des comptes pour travailler hors ligne</h2>

<p>Pour configurer un ou plusieurs comptes pour travailler hors ligne, utilisez les pr&eacute;f&eacute;rences Hors ligne et espace disque de la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum. Une fois d&eacute;finies, vous ne devez plus modifier ces pr&eacute;f&eacute;rences chaque fois que vous travaillez hors ligne. Les pr&eacute;f&eacute;rences Hors ligne et espace disque disponibles d&eacute;pendent du type de compte (IMAP, POP ou forum).</p>

<p>Voici un r&eacute;sum&eacute; des &eacute;tapes n&eacute;cessaires pour configurer les comptes pour le travail hors ligne&nbsp;:</p>

<ol>
<li>Pour chaque compte &agrave; utiliser hors ligne, utilisez la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum pour d&eacute;finir les pr&eacute;f&eacute;rences Hors ligne et espace disque correspondantes. Vous devez s&eacute;lectionner les &eacute;l&eacute;ments (dossiers et forums) &agrave; t&eacute;l&eacute;charger pour une utilisation hors ligne. Pour plus d'informations, voir <a href="#OFFLINE_ITEMS">S&eacute;lection d'&eacute;l&eacute;ments pour un affichage hors ligne</a>.

<p>Une fois d&eacute;finis, vous ne devez pas modifier ces param&egrave;tres. Consultez les sections suivantes pour plus d'informations sur la d&eacute;finition des pr&eacute;f&eacute;rences Hors ligne et espace disque pour les comptes <a href="#OFFLINE_IMAP">IMAP</a>, <a href= "#OFFLINE_POP">POP</a> et de <a href="#OFFLINE_NEWS">forum</a>.</p>

<p><b>Astuce&nbsp;</b>: Pour d&eacute;finir les pr&eacute;f&eacute;rences Hors ligne et espace disque du compte en cours, dans le menu Fichier, choisissez Hors ligne, puis Param&egrave;tres hors ligne.</p>
</li>

<li>Ouvrez le menu Fichier, s&eacute;lectionnez Hors ligne puis T&eacute;l&eacute;charger/synchroniser maintenant.</li>

<li>S&eacute;lectionnez le type de messages (&eacute;lectroniques, de forums ou les deux) &agrave; t&eacute;l&eacute;charger.

<p><b>Important</b>&nbsp;: Vous devez au moins s&eacute;lectionner une cat&eacute;gorie (messages &eacute;lectroniques ou de forums) pour que le t&eacute;l&eacute;chargement fonctionne.</p>
</li>

<li>S&eacute;lectionnez "Travailler hors ligne d&egrave;s la fin du t&eacute;l&eacute;chargement et/ou de la synchronisation".</li>

<li>Cliquez sur OK pour t&eacute;l&eacute;charger les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s et mettez-vous hors ligne. Voir <a href="#OFFLINE_SYNC">T&eacute;l&eacute;chargement et synchronisation des messages</a> pour plus d'informations.</li>
</ol>

<p>Pour les sessions hors ligne suivantes, vous pouvez passer l'&eacute;tape 1.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_ITEMS"></a>

<h2>S&eacute;lection d'&eacute;l&eacute;ments pour un affichage hors ligne</h2>

<p>Pour pouvoir lire les messages &eacute;lectroniques et de forums hors ligne, vous devez d'abord les s&eacute;lectionner pour t&eacute;l&eacute;chargement. Vous pouvez d&eacute;finir un compte complet pour l'utilisation hors ligne. Vous pouvez &eacute;galement s&eacute;lectionner les dossiers et forums &agrave; utiliser hors ligne.</p>

<p><b>Remarque</b>&nbsp;: N'oubliez pas que s&eacute;lectionner davantage d'&eacute;l&eacute;ments peut accro&icirc;tre le temps de t&eacute;l&eacute;chargement et l'espace disque utilis&eacute;.</p>

<p>Pour s&eacute;lectionner des comptes, dossiers et forums pour un affichage hors ligne, ouvrez la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez la cat&eacute;gorie Hors ligne et espace disque du compte &agrave; modifier.</li>

<li>Cliquez sur S&eacute;lectionner. Les comptes IMAP, dossiers de courrier et forums auxquels vous &ecirc;tes abonn&eacute; s'affichent.

<p><b>Remarque</b>&nbsp;: Seuls les dossiers et forums auxquels vous &ecirc;tes d&eacute;j&agrave; <a href="#SUBSCRIBE_LIST_ALL">abonn&eacute;</a> apparaissent. Les comptes POP et dossiers de courrier locaux ne figurent pas dans la liste. Votre compte AOL ne figure pas dans la liste car il est impossible de travailler hors ligne avec un compte AOL.</p>
</li>

<li>S&eacute;lectionnez les &eacute;l&eacute;ments (dossiers, forums) &agrave; rendre disponibles pour une utilisation hors ligne.</li>

<li>Cliquez sur OK.</li>
</ol>

<p>Une fois d&eacute;finis, vous ne devez plus modifier ces param&egrave;tres chaque fois que vous travaillez hors ligne. Toutefois, pour les modifier, il suffit de le faire avant de vous d&eacute;connecter, car le m&ecirc;me bouton S&eacute;lectionner est disponible &agrave; l'aide de la commande <a href="#OFFLINE_SYNC">T&eacute;l&eacute;charger/synchroniser</a>.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_SYNC"></a>

<h2>T&eacute;l&eacute;chargement et synchronisation des messages</h2>

<p>Si vous avez d&eacute;j&agrave; s&eacute;lectionn&eacute; des dossiers de courrier et forums pour une utilisation hors ligne, vous &ecirc;tes pr&ecirc;t &agrave; les t&eacute;l&eacute;charger et &agrave; les synchroniser. Si vous ne les avez pas encore s&eacute;lectionn&eacute;s, vous pouvez le faire avant de vous d&eacute;connecter.</p>

<p>Si vous n'avez pas encore affich&eacute; la bo&icirc;te de dialogue T&eacute;l&eacute;charger et synchroniser les messages, proc&eacute;dez comme suit&nbsp;:</p>

<p>Pour t&eacute;l&eacute;charger et synchroniser vos messages, commencez dans la fen&ecirc;tre Mail :</p>

<ol>
<li>Ouvrez le menu Fichier, s&eacute;lectionnez Hors ligne puis T&eacute;l&eacute;charger/synchroniser maintenant.</li>

<li>S&eacute;lectionnez les cat&eacute;gories (messages &eacute;lectroniques ou de forums) &agrave; t&eacute;l&eacute;charger.

<p><b>Important</b>&nbsp;: Vous devez au moins s&eacute;lectionner une cat&eacute;gorie (messages &eacute;lectroniques ou de forums) pour que le t&eacute;l&eacute;chargement fonctionne. Si les cases ne sont pas coch&eacute;es, cela signifie que vous n'avez pas encore s&eacute;lectionn&eacute; d'&eacute;l&eacute;ments &agrave; t&eacute;l&eacute;charger. Pour ce faire, utilisez le bouton S&eacute;lectionner.</p>
</li>

<li>Pour envoyer des messages dans votre dossier Unsent Messages avant de vous d&eacute;connecter, cochez la case "Envoyer les messages de la Bo&icirc;te d'envoi".</li>

<li>Pour vous d&eacute;connecter imm&eacute;diatement apr&egrave;s la fin du t&eacute;l&eacute;chargement par Netscape Messagerie &amp; forums, s&eacute;lectionnez "Travailler hors ligne d&egrave;s la fin du t&eacute;l&eacute;chargement et/ou de la synchronisation".</li>

<li>Pour d&eacute;finir ou modifier les &eacute;l&eacute;ments &agrave; t&eacute;l&eacute;charger, cliquez sur S&eacute;lectionner. Pour plus d'informations, voir <a href="#OFFLINE_ITEMS">S&eacute;lection d'&eacute;l&eacute;ments pour un affichage hors ligne</a>. Vous pouvez ignorer cette &eacute;tape si vous avez d&eacute;j&agrave; s&eacute;lectionn&eacute; des &eacute;l&eacute;ments &agrave; t&eacute;l&eacute;charger.</li>

<li>Cliquez sur OK. Netscape Messagerie &amp; forums commence &agrave; t&eacute;l&eacute;charger les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s.</li>
</ol>

<p>Si vous avez choisi de travailler hors ligne une fois le t&eacute;l&eacute;chargement termin&eacute;, Netscape Messagerie &amp; forums se d&eacute;connecte imm&eacute;diatement. Sinon, lorsque vous &ecirc;tes pr&ecirc;t &agrave; passer hors ligne, cliquez sur l'indicateur En ligne/Hors ligne <img src="images/online.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail pour vous mettre hors ligne.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_GO"></a>

<h2>Travail hors ligne et reconnexion ult&eacute;rieure</h2>

<p>Pour travailler hors ligne et vous reconnecter ult&eacute;rieurement, ouvrez la fen&ecirc;tre Mail.</p>

<p>Lorsque vous &ecirc;tes pr&ecirc;t &agrave; vous d&eacute;connecter&nbsp;:</p>

<ol>
<li>Cliquez sur l'indicateur En ligne/Hors ligne <img src="images/online.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre Mail. Messagerie &amp; forums vous invite &agrave; t&eacute;l&eacute;charger des messages avant de vous d&eacute;connecter.</li>

<li>Pour ce faire, cliquez sur T&eacute;l&eacute;charger. Dans le cas contraire, cliquez sur Ne pas t&eacute;l&eacute;charger.</li>
</ol>

<p><b>Remarque&nbsp;:</b> Les en-t&ecirc;tes de message qui ont &eacute;t&eacute; t&eacute;l&eacute;charg&eacute;s pour lecture hors ligne pr&eacute;sentent une enveloppe ou une ic&ocirc;ne de forum gris plus fonc&eacute;.</p>

<p><b>Astuce&nbsp;</b>: Pour d&eacute;finir le comportement de t&eacute;l&eacute;chargement de Netscape Messagerie &amp; forums lors de la d&eacute;connexion, ouvrez le menu Edition, s&eacute;lectionnez Pr&eacute;f&eacute;rences et cliquez sur la cat&eacute;gorie Hors ligne &amp; espace disque. Vous pouvez configurer Netscape Messagerie &amp; forums pour qu'il vous invite &agrave; t&eacute;l&eacute;charger des messages lors de la d&eacute;connexion, t&eacute;l&eacute;charge automatiquement les messages ou ne les t&eacute;l&eacute;charge pas.</p>

<p>Pour vous reconnecter et synchroniser les messages&nbsp;:</p>

<ol>
<li>Cliquez sur l'indicateur En ligne/Hors ligne <img src= "images/offline.gif" hspace="0" vspace="0"> dans l'angle inf&eacute;rieur droit d'une fen&ecirc;tre Netscape.</li>

<li>Ouvrez le menu Fichier, s&eacute;lectionnez Hors ligne puis T&eacute;l&eacute;charger/synchroniser maintenant.</li>
</ol>

<p>Netscape Messagerie &amp; forums synchronise les messages avec le serveur, en r&eacute;pliquant les changements apport&eacute;s lors du travail hors ligne.</p>

<p><b>Astuce&nbsp;</b>: Pour d&eacute;finir le comportement de t&eacute;l&eacute;chargement de Netscape Messagerie &amp; forums lors de la reconnexion, ouvrez le menu Edition, s&eacute;lectionnez Pr&eacute;f&eacute;rences et choisissez la cat&eacute;gorie Hors ligne &amp; espace disque. Vous pouvez configurer Netscape Messagerie &amp; forums pour qu'il vous invite &agrave; envoyer les messages de la Bo&icirc;te d'envoi, qu'il le fasse automatiquement ou ne le fasse pas.</p>

<p>[&nbsp;<a href="#WORKING_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="account_settings_intro"></a> <a name="Account_SettingsIDX"></a>

<h1>Param&egrave;tres de compte de messagerie/forum</h1>

<p>Cette section d&eacute;crit les param&egrave;tres de la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum. A la diff&eacute;rence de la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences, dont les param&egrave;tres s'appliquent &agrave; tous les comptes, la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum permet de sp&eacute;cifier des param&egrave;tres propres &agrave; chaque compte.</p>

<p>Pour afficher la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>D&eacute;marrez dans la fen&ecirc;tre Mail.</li>

<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum.</li>

<li>S&eacute;lectionnez le nom du compte dont vous souhaitez afficher ou modifier les param&egrave;tres.</li>
</ol>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="355" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#PREFERENCES_MAILNEWS_IDENTITY">Param&egrave;tres du compte</a></p>

<p><a href="#IMAP_and_POP3">Param&egrave;tres du serveur</a></p>

<p><a href="#PREFERENCES_MAILNEWS_COPIES">Copies &amp; dossiers </a>:</p>

<p><a href="#addressing_settings">Adressage</a></p>

<p><a href="#offline_prefs">Hors ligne &amp; espace disque</a> </p>

<p><a href="#mail-account-receipts">Accus&eacute;s de r&eacute;ception</a></p>

<p><a href="#security_settings">S&eacute;curit&eacute;</a></p>

<p><a href="#mail_local_folders_settings">Dossiers locaux</a></p>

<p><a href="#PREFERENCES_MAILNEWS_SMTP">Serveur sortant (SMTP)</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="attach_signature_fileSDX"></a> <a name="SMTP:choosing_a_differentIDX"></a> <a name="Mail_and_Newsgroups:identity_settingsIDX"></a> <a name="PREFERENCES_MAILNEWS_IDENTITY"></a>

<h2>Param&egrave;tres de compte de messagerie/forum &ndash; Param&egrave;tres du compte</h2>

<p>Cette section explique comment afficher ou modifier les param&egrave;tres d'un compte, tels que votre nom d'utilisateur, l'adresse de r&eacute;ponse et le fichier de signature. Pour afficher les param&egrave;tres de compte, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez le nom du compte pour afficher le panneau Param&egrave;tres du compte.</li>
</ol>

<ul>
<li><strong>Nom du compte </strong>: Nom attribu&eacute; &agrave; ce compte.</li>

<li><strong>Identit&eacute; </strong>: M&eacute;morise votre nom, adresse &eacute;lectronique, adresse de r&eacute;ponse (uniquement si elle diff&egrave;re de votre adresse &eacute;lectronique) et organisation (facultatif).</li>

<li><strong>Joindre cette signature </strong>: Permet de choisir le fichier de signature (au format texte ou HTML) &agrave; joindre &agrave; vos messages sortants. Cliquez sur Choisir pour rechercher le fichier de signature (facultatif).</li>

<li><strong>Composer les messages en format HTML </strong>: Permet de cr&eacute;er du texte format&eacute; pour vos messages, &agrave; l'aide de l'&eacute;diteur HTML int&eacute;gr&eacute;. Laissez cette option d&eacute;s&eacute;lectionn&eacute;e pour utiliser l'&eacute;diteur de texte brut. Les messages HTML peuvent comprendre du texte format&eacute;, des liens, des images et des tableaux, tout comme une page Web. Toutefois, certains destinataires peuvent &ecirc;tre dans l'impossibilit&eacute; de recevoir des messages HTML.</li>

<li style="list-style: none">
<p><b>Astuce&nbsp;</b>:  Si vous s&eacute;lectionnez cette option, mais souhaitez ult&eacute;rieurement r&eacute;diger un message ou y r&eacute;pondre &agrave; l'aide de l'&eacute;diteur de texte brut, maintenez la touche Maj enfonc&eacute;e et cliquez sur Composer ou R&eacute;pondre dans la barre d'outils de messagerie pour s&eacute;lectionner temporairement l'&eacute;diteur de texte brut. Maj-cliquer sur le bouton Composer ou R&eacute;pondre s&eacute;lectionne l'autre &eacute;diteur.</p>
</li>

<li><strong>Avanc&eacute;&nbsp;</strong>: Permet de choisir un autre serveur sortant (SMTP) pour l'envoi de messages &agrave; partir de ce compte.</li>
</ul>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:server_settingsIDX"></a> <a name="Mail_and_Newsgroups:IMAP_vs_POP3IDX"></a> <a name="IMAP_and_POP3"></a>

<h2>Param&egrave;tres de compte de messagerie/forum &ndash; Param&egrave;tres du serveur</h2>

<p>Netscape Messagerie &amp; forums peut fonctionner avec deux types de serveurs de messagerie : IMAP et POP. Si vous n'&ecirc;tes pas s&ucirc;r du type de serveur pris en charge par votre FAI, posez-lui la question. Si votre fournisseur d'acc&egrave;s &agrave; Internet prend en charge les deux types de serveurs, les descriptions qui suivent peuvent vous aider &agrave; choisir lequel utiliser&nbsp;:</p>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="360" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#IMAP_about">A propos du protocole IMAP (Internet Message Access Protocol)</a></p>

<p><a href="#POP_about">A propos du protocole POP (Post Office Protocol)</a></p>

<p><a href="#IMAP_SERVER">Param&egrave;tres du serveur IMAP</a></p>

<p><a href="#IMAP_ADVANCED">Param&egrave;tres avanc&eacute;s du serveur IMAP</a></p>

<p><a href="#POP_SERVER">Param&egrave;tres de serveur POP</a></p>

<p><a href="#DISCUSSION_HOST_PROPERTIES">Param&egrave;tres du serveur de forums</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="IMAP:aboutIDX"></a> <a name="IMAP_about"></a>

<h3>A propos du protocole IMAP (Internet Message Access Protocol)</h3>

<p><b>Avantages&nbsp;</b>: Vos messages et leurs modifications demeurent sur le serveur, ce qui &eacute;conomise l'espace disque local. Vous avez &eacute;galement toujours acc&egrave;s &agrave; une bo&icirc;te aux lettres mise &agrave; jour et vous pouvez r&eacute;cup&eacute;rer votre courrier &agrave; partir de plusieurs emplacements. Les performances &agrave; l'aide d'un modem sont sup&eacute;rieures, car vous ne t&eacute;l&eacute;chargez initialement que les en-t&ecirc;tes des messages.</p>

<p><b>Inconv&eacute;nients&nbsp;:</b> Tous les FAI ne prennent pas en charge les serveurs IMAP.</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="POP:aboutIDX"></a> <a name="POP_about"></a>

<h3>A propos du protocole POP (Post Office Protocol)</h3>

<p><b>Avantages&nbsp;</b>: Vos messages sont tous t&eacute;l&eacute;charg&eacute;s en une fois sur l'ordinateur local, mais vous pouvez &eacute;galement choisir de conserver des copies des messages sur le serveur et de supprimer les messages sur le serveur lorsqu'ils sont supprim&eacute;s localement. La plupart des FAI prennent en charge le protocole POP.</p>

<p><b>Inconv&eacute;nients&nbsp;</b>: Si vous utilisez plusieurs ordinateurs, les messages peuvent r&eacute;sider sur l'un ou l'autre, mais pas les deux. POP ne fonctionne pas aussi bien qu'IMAP sur une connexion lente. En outre, vous ne pouvez pas acc&eacute;der &agrave; tous les dossiers de messages &agrave; partir de plusieurs emplacements.</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:IMAP_settings"></a> <a name="IMAP:server_settingsIDX"></a> <a name="IMAP_SERVER"></a>

<h3>Param&egrave;tres du serveur IMAP</h3>

<p>Pour afficher les param&egrave;tres de serveur IMAP, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez le nom du compte et cliquez sur la cat&eacute;gorie Param&egrave;tres du serveur. Si vous avez choisi un serveur IMAP lors de la configuration de ce compte, ses param&egrave;tres s'affichent.</li>
</ol>

<ul>
<li><strong>Type du serveur </strong>: Type de serveur (IMAP) sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte. Pour changer le type de serveur associ&eacute; &agrave; un compte, vous devez supprimer le compte et le recr&eacute;er.</li>

<li><strong>Nom du serveur</strong> : Nom de serveur sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte. Si vous ne parvenez pas &agrave; r&eacute;cup&eacute;rer les messages de ce compte, v&eacute;rifiez aupr&egrave;s de votre FAI ou administrateur syst&egrave;me que le nom de serveur introduit est correct.</li>

<li><strong>Nom d'utilisateur </strong>: Nom d'utilisateur sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte.</li>

<li><strong>Port </strong>: Sauf instruction contraire de votre FAI ou administrateur syst&egrave;me, laissez ce param&egrave;tre inchang&eacute;.</li>

<li><strong>Utiliser une connexion s&ucirc;re (SSL)&nbsp;:</strong>&nbsp; Choisissez ce param&egrave;tre si votre serveur de messagerie est configur&eacute; pour envoyer et recevoir des messages chiffr&eacute;s. En cas de doute, consultez votre FAI ou administrateur syst&egrave;me.</li>

<li><strong>Rechercher les nouveaux messages au d&eacute;marrage </strong>: Choisissez ce param&egrave;tre si vous souhaitez v&eacute;rifier automatiquement l'arriv&eacute;e de nouveaux messages sur ce compte chaque fois que vous lancez Messagerie &amp; forums.</li>

<li><strong>V&eacute;rifier les nouveaux messages toutes les ___ minutes </strong>: Choisissez ce param&egrave;tre pour v&eacute;rifier automatiquement si des nouveaux messages sont arriv&eacute;s et sp&eacute;cifiez le nombre de minutes entre chaque v&eacute;rification. Si vous ne cochez pas cette case, vous pouvez v&eacute;rifier l'arriv&eacute;e de nouveaux messages &agrave; tout moment en cliquant sur Obtenir msg dans la fen&ecirc;tre Mail.</li>

<li style="list-style: none"><a name="compact_foldersSDX"></a></li>

<li><strong>Lors de la suppression d'un message </strong>: <a name= "delete_method"></a> Choisissez le comportement voulu concernant les messages supprim&eacute;s. "Le mettre dans la poubelle" est l'option recommand&eacute;e, sauf instruction contraire de votre FAI ou administrateur syst&egrave;me. Les messages marqu&eacute;s comme supprim&eacute;s ne sont effac&eacute;s que lors du compactage d'un dossier.</li>

<li><strong>Nettoyer (Expunge) la bo&icirc;te de r&eacute;ception &agrave; la sortie </strong>: Efface les messages supprim&eacute;s de la bo&icirc;te de r&eacute;ception lorsque vous quittez Messagerie &amp; forums. Cochez cette case si vous souhaitez marquer les messages comme supprim&eacute;s.</li>

<li><strong>Vider la corbeille &agrave; la sortie </strong>: Vide la corbeille chaque fois que vous quittez Messagerie &amp; forums.</li>

<li><b>R&eacute;pertoire local </b>: Emplacement de votre disque dur o&ugrave; sont stock&eacute;s les messages de ce compte.</li>
</ul>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:Advanced_IMAP_settingsIDX"></a> <a name="IMAP:advanced_mail_settingsIDX"></a> <a name="IMAP_ADVANCED"></a>

<h3>Param&egrave;tres avanc&eacute;s du serveur IMAP</h3>

<p>G&eacute;n&eacute;ralement, les param&egrave;tres avanc&eacute;s du serveur IMAP sont fournis automatiquement par le serveur. Si vous n'&ecirc;tes pas certain des param&egrave;tres de cette bo&icirc;te de dialogue, consultez votre administrateur syst&egrave;me ou FAI.</p>

<p>Pour afficher les param&egrave;tres de serveur IMAP avanc&eacute;s, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez le nom du compte et cliquez sur la cat&eacute;gorie Param&egrave;tres du serveur.</li>

<li>Si le serveur de messagerie est de type IMAP, vous pouvez cliquer sur Avanc&eacute; pour d&eacute;finir des options suppl&eacute;mentaires telles que :
<p><br></p>
<ul>
<li>Le chemin du r&eacute;pertoire du serveur IMAP</li>

<li>Afficher seulement les dossiers avec abonnement</li>

<li>La prise en charge des sous-dossiers</li>

<li>Les espaces de noms personnels et publics &eacute;ventuels (dossiers partag&eacute;s) pour ce r&eacute;pertoire</li>

</ul>
</li>
</ol>

<p>Pour plus d'informations, voir <a href="#ADD_LDAP">Ajout et suppression d'annuaires LDAP</a>.</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:POP_server_settingsIDX"></a> <a name="POP:server_settingsIDX"></a> <a name="POP_SERVER"></a>

<h3>Param&egrave;tres de serveur POP</h3>

<p>Pour afficher les param&egrave;tres de serveur POP, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez le nom du compte et cliquez sur la cat&eacute;gorie Param&egrave;tres du serveur. Si vous avez s&eacute;lectionn&eacute; un serveur POP lors de la configuration de ce compte, ses param&egrave;tres s'affichent.</li>
</ol>

<ul>
<li><strong>Type du serveur </strong>: Type de serveur (POP) sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte. Pour changer le type de serveur associ&eacute; &agrave; un compte, vous devez supprimer le compte et le recr&eacute;er.</li>

<li><strong>Nom du serveur</strong> : Nom de serveur sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte. Si vous ne parvenez pas &agrave; r&eacute;cup&eacute;rer les messages de ce compte, v&eacute;rifiez aupr&egrave;s de votre FAI ou administrateur syst&egrave;me que le nom de serveur introduit est correct.</li>

<li><strong>Nom d'utilisateur </strong>: Nom d'utilisateur sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte.</li>

<li><strong>Port </strong>: Sauf instruction contraire de votre FAI ou administrateur syst&egrave;me, laissez ce param&egrave;tre inchang&eacute;.</li>

<li><strong>Utiliser une connexion s&ucirc;re (SSL)&nbsp;:</strong>&nbsp; Choisissez ce param&egrave;tre si votre serveur de messagerie est configur&eacute; pour envoyer et recevoir des messages chiffr&eacute;s. En cas de doute, consultez votre FAI ou administrateur syst&egrave;me.</li>

<li><strong>Rechercher les nouveaux messages au d&eacute;marrage </strong>: Choisissez ce param&egrave;tre si vous souhaitez v&eacute;rifier automatiquement l'arriv&eacute;e de nouveaux messages sur ce compte chaque fois que vous lancez Messagerie &amp; forums. Pour les comptes POP, Messagerie &amp; forums ne t&eacute;l&eacute;charge pas les nouveaux messages tant que vous ne cliquez pas sur Obtenir msg sur la barre d'outils de messagerie.</li>

<li><strong>V&eacute;rifier les nouveaux messages toutes les ___ minutes </strong>: Choisissez ce param&egrave;tre pour v&eacute;rifier automatiquement si des nouveaux messages sont arriv&eacute;s et sp&eacute;cifiez le nombre de minutes entre chaque v&eacute;rification. Si vous ne cochez pas cette case, vous pouvez v&eacute;rifier l'arriv&eacute;e de nouveaux messages &agrave; tout moment en cliquant sur Obtenir msg dans la fen&ecirc;tre Mail.<br>
</li>

<li><strong>T&eacute;l&eacute;charger automatiquement tous les nouveaux messages </strong>: Choisissez ce param&egrave;tre si vous voulez que Messagerie &amp; forums r&eacute;cup&egrave;re imm&eacute;diatement les messages chaque fois qu'il contacte le serveur.</li>

<li><strong>Laisser les messages sur le serveur </strong>: Choisissez ce param&egrave;tre pour stocker une copie des messages sur le serveur de messagerie apr&egrave;s leur t&eacute;l&eacute;chargement sur votre ordinateur.</li>

<li><strong>Supprimer les messages du serveur lors d'une suppression locale </strong>: Choisissez ce param&egrave;tre pour supprimer les messages du serveur une fois que vous les supprimez de votre ordinateur.</li>

<li><strong>Vider la corbeille &agrave; la sortie </strong>: Vide la corbeille chaque fois que vous quittez Messagerie &amp; forums.</li>

<li><b>R&eacute;pertoire local </b>: Emplacement de votre disque dur o&ugrave; sont stock&eacute;s les messages de ce compte.</li>
</ul>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Newsgroups:server_settingsIDX"></a> <a name="DISCUSSION_HOST_PROPERTIES"></a>

<h3>Param&egrave;tres du serveur de forums</h3>

<p>Cette section explique comment modifier les param&egrave;tres de serveur de forums. Pour afficher le panneau de param&egrave;tres du serveur de forums, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez le nom du compte et cliquez sur la cat&eacute;gorie Param&egrave;tres du serveur. Si vous avez s&eacute;lectionn&eacute; un serveur de forums lors de la configuration de ce compte, ses param&egrave;tres s'affichent.</li>
</ol>

<ul>
<li><strong>Type du serveur </strong>: Type de serveur (NNTP) sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte.</li>

<li><strong>Nom du serveur</strong> : Nom de serveur sp&eacute;cifi&eacute; lors de la cr&eacute;ation du compte. Si vous ne parvenez pas &agrave; r&eacute;cup&eacute;rer les messages de ce compte, v&eacute;rifiez aupr&egrave;s de votre FAI ou administrateur syst&egrave;me que le nom de serveur introduit est correct.</li>

<li><strong>Port </strong>: Sauf instruction contraire de votre FAI ou administrateur syst&egrave;me, laissez ce param&egrave;tre inchang&eacute;.</li>

<li><strong>Utiliser une connexion s&ucirc;re (SSL)&nbsp;:</strong>&nbsp; Choisissez ce param&egrave;tre si votre serveur de forums est configur&eacute; pour envoyer et recevoir des messages chiffr&eacute;s. En cas de doute, consultez votre FAI ou administrateur syst&egrave;me.</li>

<li><strong>V&eacute;rifier les nouveaux messages toutes les ___ minutes </strong>: Choisissez ce param&egrave;tre pour v&eacute;rifier automatiquement si des nouveaux messages sont arriv&eacute;s et sp&eacute;cifiez le nombre de minutes entre chaque v&eacute;rification. Si vous ne cochez pas cette case, vous pouvez v&eacute;rifier l'arriv&eacute;e de nouveaux messages &agrave; tout moment en cliquant sur Obtenir msg dans la fen&ecirc;tre Mail.</li>

<li><strong>Me pr&eacute;venir avant de t&eacute;l&eacute;charger plus de ___ messages </strong>: Choisissez ce param&egrave;tre pour &eacute;conomiser l'espace disque et le temps de t&eacute;l&eacute;chargement, en d&eacute;finissant un nombre maximal de messages &agrave; r&eacute;cup&eacute;rer &agrave; la fois.</li>

<li><b>R&eacute;pertoire local </b>: Emplacement de votre disque dur o&ugrave; sont stock&eacute;s les messages de ce compte.</li>
</ul>

<blockquote>
<p><b>Remarque&nbsp;:</b>Le chemin du fichier newsrc est affich&eacute; &agrave; des fins d'information. Ce fichier stocke des informations sur les groupes de discussion auxquels vous &ecirc;tes abonn&eacute; et les messages consult&eacute;s dans chaque groupe.</p>
</blockquote>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:copies_and_folder_settingsIDX"></a> <aname="PREFERENCES_MAILNEWS_COPIES"></a>

<h2>Param&egrave;tres de compte de messagerie/forum &ndash; Copies &amp; dossiers</h2>

<p>Cette section explique comment configurer l'envoi de copies automatiques et l'enregistrement de copies de messages sortants, de brouillons et de mod&egrave;les.</p>

<p>Par d&eacute;faut, Netscape Messagerie &amp; forums enregistre des copies de vos messages sortants dans le dossier Sent du compte en cours. Il enregistre &eacute;galement les brouillons de messages dans le dossier Drafts et des mod&egrave;les de messages dans le dossier Templates du compte en cours. Le dossier Sent n'est pas disponible pour les comptes AOL et Webmail. Les dossiers Drafts et Templates sont stock&eacute;s sous Dossiers locaux.</p>

<p>Pour afficher le panneau de param&egrave;tres Copies &amp; dossiers, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>Recherchez le compte et cliquez sur Copies &amp; dossiers. Le panneau Copies &amp; dossiers s'affiche.</li>
</ol>

<ul>
<li><strong>Placer une copie dans </strong>: S&eacute;lectionnez l'emplacement de stockage des copies des messages sortants. Pour ne pas utiliser le dossier Sent par d&eacute;faut du compte en cours, cliquez sur Autre et s&eacute;lectionnez un compte puis le dossier d'enregistrement des copies.</li>

<li><strong>Copies cach&eacute;es&nbsp;</strong>: Indiquez si vous souhaitez toujours vous envoyer une copie cach&eacute;e (bcc).</li>

<li><strong>Envoyer en Bcc &agrave; une autre adresse </strong>: Choisissez si vous souhaitez toujours envoyer une copie cach&eacute;e &agrave; un autre destinataire et, le cas &eacute;ch&eacute;ant, entrez l'adresse.</li>

<li><strong>Conserver les brouillons dans </strong>: S&eacute;lectionnez l'emplacement d'enregistrement des brouillons de messages. Pour ne pas utiliser le dossier Drafts par d&eacute;faut du compte en cours, cliquez sur Autre et s&eacute;lectionnez un compte puis le dossier d'enregistrement des brouillons.</li>

<li><strong>Conserver les mod&egrave;les dans </strong>: S&eacute;lectionnez l'emplacement d'enregistrement des mod&egrave;les de messages. Pour ne pas utiliser le dossier Templates par d&eacute;faut du compte en cours, cliquez sur Autre et s&eacute;lectionnez un compte puis le dossier d'enregistrement des mod&egrave;les.</li>

<li><strong>Afficher la bo&icirc;te de dialogue de confirmation lorsque les messages sont enregistr&eacute;s </strong>: Choisissez cette option si vous voulez que Messagerie &amp; forums demande confirmation lorsque vous enregistrez un brouillon de message ou un mod&egrave;le. Une bo&icirc;te de dialogue s'affiche alors lors de l'enregistrement d'un brouillon ou d'un mod&egrave;le pour vous rappeler l'emplacement d'enregistrement de Netscape Messagerie &amp; forums.</li>
</ul>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="type_down_addressingSDX"></a> <a name="address_autocompletionSDX"></a> <a name="global_LDAP_settingsSDX"></a> <a name="LDAP:global_settingsIDX"></a> <a name="Mail_and_Newsgroups:global_LDAP_settingsIDX"></a> <a name="addressing_settings"></a>

<h2>Param&egrave;tres de compte de messagerie/forum - Adressage</h2>

<p>Vous pouvez utiliser les param&egrave;tres d'adressage pour remplacer les param&egrave;tres de serveur LDAP global sp&eacute;cifi&eacute;s pour tous les <a href= "#PREFERENCES_MAILNEWS_ADDRESSING">carnets d'adresses</a> dans la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences. Les param&egrave;tres du serveur LDAP influencent le comportement du <a href="#AUTO_COMPLETE">remplissage automatique de l'adresse</a> et vous pouvez les modifier pour chaque compte au besoin.</p>

<p>Le remplissage automatique de l'adresse utilise vos carnets d'adresses pour trouver des entr&eacute;es correspondantes lorsque vous entrez des adresses &eacute;lectroniques dans la zone d'adressage de la fen&ecirc;tre de composition.</p>

<p>Pour afficher les param&egrave;tres d'adressage, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez le compte et cliquez sur la cat&eacute;gorie Adressage.</li>
</ol>

<ul>
<li><b>Utiliser mes pr&eacute;f&eacute;rences de serveur LDAP global pour ce compte&nbsp;</b>: Option par d&eacute;faut. S&eacute;lectionnez-la pour ne pas ignorer les pr&eacute;f&eacute;rences de serveur LDAP global pour ce compte.</li>

<li><b>Utiliser un autre serveur LDAP&nbsp;</b>: S&eacute;lectionnez cette option et choisissez un autre serveur LDAP dans la liste pour utiliser un autre serveur d'annuaire LDAP pour le remplissage automatique de l'adresse avec ce compte. Au besoin, cliquez sur Modifier r&eacute;pertoires pour modifier les param&egrave;tres du serveur d'annuaire, en ajouter un ou en supprimer un. Pour plus d'informations, voir <a href= "#ADD_LDAP">Ajout et suppression d'annuaires LDAP</a>.</li>
</ul>

<p>Le r&eacute;pertoire que vous s&eacute;lectionnez sera &eacute;galement utilis&eacute; pour la recherche de certificats lorsque vous tenterez d'envoyer un message chiffr&eacute; &agrave; un ou plusieurs destinataires pour lesquels vous n'avez pas de certificats enregistr&eacute;s.</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Offline:Mail_settingsIDX"></a> <a name="Mail_and_Newsgroups:Offline_settingsIDX"></a> <a name="Mail_and_Newsgroups:Disk_Space_settingsIDX"></a> <a name="offline_prefs"></a>

<h2>Param&egrave;tres de compte de messagerie/forum - Hors ligne &amp; espace disque</h2>

<p>Les param&egrave;tres Hors ligne &amp; espace disque permettent d'&eacute;conomiser l'espace disque et de configurer un compte &agrave; utiliser hors ligne (d&eacute;connect&eacute; d'Internet). Les param&egrave;tres disponibles d&eacute;pendent du type de serveur (IMAP, POP ou de forum) associ&eacute; au compte.</p>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="324" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#OFFLINE_IMAP">Param&egrave;tres Hors ligne et espace disque (IMAP)</a></p>

<p><a href="#OFFLINE_POP">Param&egrave;tres d'espace disque (POP)</a></p>

<p><a href="#OFFLINE_NEWS">Param&egrave;tres Hors ligne et espace disque (forums)</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_IMAP"></a>

<h3>Param&egrave;tres Hors ligne et espace disque (IMAP)</h3>

<p>Pour afficher les param&egrave;tres hors ligne et espace disque d'un compte IMAP, prc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez la cat&eacute;gorie Hors ligne et espace disque pour un compte IMAP.</li>
</ol>

<ul>
<li><b>Rendre les messages de ma Bo&icirc;te de r&eacute;ception disponibles lorsque je travaille hors ligne </b>: S&eacute;lectionnez cette option pour que les messages de votre bo&icirc;te de r&eacute;ception soient disponibles lorsque travaillez hors ligne.</li>

<li><b>Lorsque je cr&eacute;e de nouveaux dossiers, les s&eacute;lectionner pour le mode hors ligne&nbsp;</b>: S&eacute;lectionnez cette option pour que les nouveaux dossiers cr&eacute;&eacute;s soient automatiquement s&eacute;lectionn&eacute;s pour l'utilisation hors ligne. Dans le cas contraire, ils ne sont pas automatiquement s&eacute;lectionn&eacute;s pour l'utilisation hors ligne. Vous pouvez s&eacute;lectionner manuellement des dossiers &agrave; utiliser hors ligne en choisissant la commande T&eacute;l&eacute;charger/synchroniser maintenant (dans le menu Fichier, sous Hors ligne). Cliquez sur le bouton S&eacute;lectionner dans la bo&icirc;te de dialogue T&eacute;l&eacute;charger et synchroniser les messages pour s&eacute;lectionner les dossiers voulus.</li>

<li><strong>S&eacute;lectionner </strong>: Permet de s&eacute;lectionner les &eacute;l&eacute;ments (dossiers ou forums) &agrave; rendre disponibles pour une utilisation hors ligne. Pour plus d'informations, voir <a href="#OFFLINE_ITEMS">S&eacute;lection d'&eacute;l&eacute;ments pour un affichage hors ligne</a>.</li>

<li><b>Ne pas t&eacute;l&eacute;charger localement les messages qui d&eacute;passent _ Ko </b>: Permet d'&eacute;conomiser l'espace disque en emp&ecirc;chant le t&eacute;l&eacute;chargement des messages volumineux. Entrez la taille maximale des messages t&eacute;l&eacute;charg&eacute;s.</li>
</ul>

<p>&nbsp;</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_POP"></a>

<h3>Param&egrave;tres d'espace disque (POP)</h3>

<p>Les messages des comptes POP sont toujours t&eacute;l&eacute;charg&eacute;s localement. Cette section d&eacute;crit comment &eacute;conomiser l'espace disque pour un compte POP. Pour afficher les pr&eacute;f&eacute;rences d'espace disque d'un compte POP, proc&eacute;dez comme suit&nbsp;:</p>

<p>D&eacute;marrez dans la fen&ecirc;tre Mail.</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez la cat&eacute;gorie Espace disque pour un compte POP.</li>
</ol>

<ul>
<li><b>Ne pas t&eacute;l&eacute;charger localement les messages qui d&eacute;passent _ Ko </b>: Permet d'&eacute;conomiser l'espace disque en emp&ecirc;chant le t&eacute;l&eacute;chargement des messages volumineux. Entrez la taille maximale des messages t&eacute;l&eacute;charg&eacute;s.</li>
</ul>

<p>&nbsp;</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="OFFLINE_NEWS"></a>

<h3>Param&egrave;tres Hors ligne et espace disque (forums)</h3>

<p>Si les param&egrave;tres hors ligne et espace disque d'un compte de forums ne sont pas affich&eacute;s, &agrave; partir de la fen&ecirc;tre Mail :</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez la cat&eacute;gorie Hors ligne &amp; espace disque pour un compte de forums.</li>
</ol>

<ul>
<li><strong>S&eacute;lectionner </strong>: Permet de s&eacute;lectionner les &eacute;l&eacute;ments (comptes, dossiers, forums) &agrave; rendre disponibles pour une utilisation hors ligne. Pour plus d'informations, voir <a href="#OFFLINE_ITEMS">S&eacute;lection d'&eacute;l&eacute;ments pour un affichage hors ligne</a>.</li>

<li><b>Ne pas t&eacute;l&eacute;charger localement les messages qui d&eacute;passent </b>: Permet d'&eacute;conomiser l'espace disque en emp&ecirc;chant le t&eacute;l&eacute;chargement des messages volumineux. Entrez la taille maximale des messages t&eacute;l&eacute;charg&eacute;s.</li>

<li><b>Ne t&eacute;l&eacute;charger que les corps des messages non lus&nbsp;</b>: T&eacute;l&eacute;charge uniquement les messages que vous n'avez pas lus.</li>

<li><b>T&eacute;l&eacute;charger les corps des messages depuis _ jours </b>: T&eacute;l&eacute;charge uniquement les messages envoy&eacute;s dans la p&eacute;riode sp&eacute;cifi&eacute;e.</li>

<li><strong>Lorsqu'il est temps d'effacer les messages </strong>: Choisissez une des trois options pour sp&eacute;cifier &agrave; quel moment les messages de forums doivent &ecirc;tre supprim&eacute;s. A moins de choisir "Conserver tous les messages", entrez le nombre de jours pendant lesquels conserver les messages ou le nombre de messages les plus r&eacute;cents &agrave; conserver.</li>

<li><b>Ne conserver que les messages non lus&nbsp;</b>: Supprime les messages imm&eacute;diatement apr&egrave;s leur lecture.</li>

<li><b>Ne supprimer que les corps de messages qui datent de&nbsp;__ jours </b>: Supprimer les messages apr&egrave;s le nombre de jours sp&eacute;cifi&eacute;.</li>
</ul>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:return_receipts_settingsIDX"></a> <a name="read_receipts_settingsSDX"></a> <a name="mail_return_receipts_settingsSDX"></a> <a name="mail-account-receipts"></a>


<h2>Param&egrave;tres de compte de messagerie/forum &ndash; Accus&eacute;s de r&eacute;ception</h2>

<p>Cette section d&eacute;crit l'utilisation des param&egrave;tres d'accus&eacute;s de r&eacute;ception. Pour afficher les param&egrave;tres d'accus&eacute;s de r&eacute;ception, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez la cat&eacute;gorie Accus&eacute;s de r&eacute;ception pour votre compte de messagerie.</li>
</ol>

<p>Ce panneau permet de d&eacute;finir les param&egrave;tres d'accus&eacute;s de r&eacute;ception pour les messages &eacute;mis &agrave; partir de ce compte de messagerie. Il permet &eacute;galement d'indiquer comment g&eacute;rer les demandes d'accus&eacute; de r&eacute;ception que vous recevez. Ces param&egrave;tres remplacement les pr&eacute;f&eacute;rences globales d'accus&eacute; de r&eacute;ception sp&eacute;cifi&eacute;es dans <a href= "#PREFERENCES_MAILNEWS_RECEIPTS">Pr&eacute;f&eacute;rences de messagerie et forums - Accus&eacute;s de r&eacute;ception</a>.</p>

<ul>
<li><strong>Utiliser mes pr&eacute;f&eacute;rences globales d'accus&eacute; de r&eacute;ception pour ce compte </strong>: Par d&eacute;faut, ce compte utilise les pr&eacute;f&eacute;rences d'accus&eacute; de r&eacute;ception sp&eacute;cifi&eacute;es dans <a href= "#PREFERENCES_MAILNEWS_RECEIPTS">Pr&eacute;f&eacute;rences de messagerie et forums - Accus&eacute;s de r&eacute;ception</a>.</li>

<li><strong>Personnaliser les accus&eacute;s de r&eacute;ception pour ce compte </strong>: Permet de modifier les pr&eacute;f&eacute;rences d'accus&eacute; de r&eacute;ception pour ce compte.</li>

<li style="list-style: none">
<ul>
<li><strong>Lors de l'envoi de messages, toujours demander un accus&eacute; de r&eacute;ception </strong>: Permet de demander automatiquement des accus&eacute;s de r&eacute;ception pour tous les messages &eacute;mis &agrave; partir de ce compte de messagerie.</li>

<li><strong>Le conserver dans ma Bo&icirc;te de r&eacute;ception </strong>: Les accus&eacute;s de r&eacute;ception sont d&eacute;pos&eacute;s dans la bo&icirc;te de r&eacute;ception associ&eacute;e &agrave; ce compte.</li>

<li style="list-style: none">
<p><strong>Astuce&nbsp;</strong>: Choisissez cette option si vous souhaitez utiliser un filtre qui d&eacute;place automatiquement les accus&eacute;s de r&eacute;ception vers un dossier de votre choix. Pour des informations sur la cr&eacute;ation et l'utilisation de filtres, voir <a href="#MAIL_FILTERS">Cr&eacute;ation de filtres de messages</a>.</p>
</li>

<li><strong>Le d&eacute;placer dans mon dossier Sent Mail </strong>: Les accus&eacute;s de r&eacute;ception entrants sont d&eacute;plac&eacute;s vers le dossier Sent mail de ce compte.</li>

<li><strong>Ne jamais envoyer d'accus&eacute; de r&eacute;ception </strong>: Choisissez cette option si vous d&eacute;cidez de ne pas r&eacute;pondre aux demandes d'accus&eacute; de r&eacute;ception.</li>

<li><strong>Autoriser les accus&eacute;s de r&eacute;ception pour certains messages </strong>: Permet de choisir comment vous souhaitez r&eacute;pondre aux demandes d'accus&eacute; de r&eacute;ception que vous recevez.</li>
</ul>
</li>
</ul>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:security_settingsIDX"></a> <a name="securitySDX"></a> <a name="security_settingsSDX"></a> <a name="mail_security_settingsSDX"></a> <a name="newsgroup_security_settingsSDX"></a> <a name="mail:security_settingsIDX"></a> <a name="settings:signed_and_encrypted mailIDX"></a> <a name="security_settings"></a>
<h2>Param&egrave;tres de compte de messagerie/forum - S&eacute;curit&eacute;</h2>

<p>Cette section d&eacute;crit la configuration des param&egrave;tres de compte de messagerie/forum relatifs &agrave; la s&eacute;curit&eacute; des messages. Avant cela, cependant, vous devez obtenir des certificats de courrier &eacute;lectronique. Pour des d&eacute;tails, voir <a href="mail_sec_help.html">Signature et chiffrement de messages</a></p>

<p>Pour afficher les param&egrave;tres de s&eacute;curit&eacute; de votre compte, proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum.</li>

<li>Cliquez sur S&eacute;curit&eacute; sous le nom du compte de messagerie dont vous souhaitez configurer les param&egrave;tres de s&eacute;curit&eacute;.</li>
</ol>

<p>&nbsp;</p>

<table cellpadding="4" cellspacing="2" bgcolor="#CCCCCC" width=
"324">
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>

<p><a href="#about_email_certs">A propos des certificats</a></p>

<p><a href="#digital_signing">Signature num&eacute;rique</a></p>

<p><a href="#email_encryption">Chiffrement</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<h3><a name="about_email_certs">A propos des certificats</a></h3>

<p>Le principal objet du panneau S&eacute;curit&eacute; dans les Param&egrave;tres de compte de messagerie/forum est de s&eacute;lectionner deux certificats :</p>

<ul>
<li>Le certificat de courrier &eacute;lectronique que vous souhaitez utiliser pour signer les messages &eacute;lectroniques que vous envoyez.</li>

<li>Le certificat de courrier &eacute;lectronique que vos correspondants doivent utiliser pour les messages chiffr&eacute;s qu'ils vous envoient.</li>
</ul>

<p>Selon les politiques de l'<a href= "glossary.html#certificate_authority_(CA)">autorit&eacute; de certification</a> qui &eacute;met vos certificats, vous pouvez utiliser le m&ecirc;me certificat dans les deux cas ou deux certificats diff&eacute;rents. M&ecirc;me si vous n'en utilisez qu'un, vous devez le sp&eacute;cifier deux fois&nbsp;: une fois pour la signature num&eacute;rique et une fois pour le chiffrement.</p>

<p>Les certificats que vous s&eacute;lectionnez ici sont associ&eacute;s &agrave; chaque message sign&eacute; que vous envoyez. Ces certificats permettent &agrave; vos destinataires de v&eacute;rifier votre signature num&eacute;rique et de chiffrer les messages qu'ils vous envoient.</p>

<p>&nbsp;</p>

<h3><a name="digital_signing">Signature num&eacute;rique</a></h3>

<p>Utilisez la zone Signature num&eacute;rique dans le panneau <a href= "#security_settings">S&eacute;curit&eacute;</a> pour sp&eacute;cifier la fa&ccedil;on de signer vos messages &eacute;lectroniques :</p>

<ul>
<li><b>Signer num&eacute;riquement les messages&nbsp;:</b> S&eacute;lectionnez cette case &agrave; cocher si vous souhaitez signer num&eacute;riquement tous les messages que vous envoyez. Un certificat personnel doit &ecirc;tre sp&eacute;cifi&eacute; plus bas pour que vous puissiez s&eacute;lectionner cette option.</li>

<li><b>Utilisez ce certificat pour signer num&eacute;riquement les messages sortants :</b> Si ce champ est vide ou s'il affiche un certificat incorrect, cliquez sur S&eacute;lectionner pour choisir un certificat parmi ceux dont vous disposez.</li>
</ul>

<p>Que la case "Signer num&eacute;riquement les messages" soit coch&eacute;e ou non, vous pouvez changer d'avis avant d'envoyer un message particulier.</p>

<p>Pour changer le param&egrave;tre de signature num&eacute;rique pour un message que vous r&eacute;digez dans la fen&ecirc;tre de composition, cliquez sur la fl&egrave;che situ&eacute;e sous l'ic&ocirc;ne S&eacute;curit&eacute;, dans le haut de la fen&ecirc;tre, et s&eacute;lectionnez ou d&eacute;s&eacute;lectionnez "Signer ce message num&eacute;riquement". Pour des d&eacute;tails, voir <a href= "mail_sec_help.html#signing">Signature et chiffrement d'un nouveau message</a>.</p>

<p>&nbsp;</p>

<h3><a name="email_encryption">Chiffrement</a></h3>

<p>Utilisez la zone Chiffrement dans le panneau <a href= "#security_settings">S&eacute;curit&eacute;</a> pour sp&eacute;cifier la fa&ccedil;on habituelle de chiffrer les messages que vous envoyez :</p>

<ul>
<li><b>Jamais :</b> S&eacute;lectionnez cette option si vous n'utilisez jamais le chiffrement, ou seulement occasionnellement.</li>

<li><b>Obligatoire&nbsp;:</b> S&eacute;lectionnez cette option si vous utilisez toujours le chiffrement. Si vous ne disposez pas de tous les certificats n&eacute;cessaires, il s'av&eacute;rera impossible d'envoyer le message, &agrave; moins que vous ne d&eacute;sactiviez le chiffrement pour le message en question.</li>

<li><b>Utilisez ce certificat pour chiffrer et d&eacute;chiffrer les messages entrants :</b> Si ce champ est vide ou s'il affiche un certificat incorrect, cliquez sur S&eacute;lectionner pour choisir un certificat parmi ceux dont vous disposez.</li>
</ul>

<p>Quelle que soit l'option de chiffrement s&eacute;lectionn&eacute;e, vous pouvez changer d'avis avant d'envoyer un message individuel.</p>

<p>Pour changer le param&egrave;tre de chiffrement pour un message que vous r&eacute;digez dans la fen&ecirc;tre de composition, cliquez sur la fl&egrave;che situ&eacute;e sous l'ic&ocirc;ne S&eacute;curit&eacute;, dans le haut de la fen&ecirc;tre, et choisissez le param&egrave;tre de chiffrement voulu. Pour des d&eacute;tails, voir <a href="mail_sec_help.html#signing">Signature et chiffrement d'un nouveau message</a>.</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:local_foldersIDX"></a> <a name="mail_local_folders_settings"></a>

<h2>Param&egrave;tres de compte de messagerie/forum &ndash; Dossiers locaux</h2>

<p>Le compte Dossiers locaux est le compte o&ugrave; Netscape Messagerie &amp; forums enregistre tous les messages que vous envoyez lors d'une session hors ligne. Ces messages sont enregistr&eacute;s dans le dossier Unsent Messages du compte Dossiers locaux. Les dossiers que vous cr&eacute;ez dans Dossiers locaux sont stock&eacute;s sur votre disque dur&nbsp;; le compte Dossiers locaux est donc un endroit id&eacute;al pour enregistrer les messages que vous souhaitez conserver.</p>

<p>Si les param&egrave;tres Dossiers locaux ne sont pas affich&eacute;s, &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez la cat&eacute;gorie Dossiers locaux.</li>
</ol>

<ul>
<li><b>Nom du compte </b>: Nom associ&eacute; au compte Dossiers locaux.</li>

<li><b>R&eacute;pertoire local </b>: Emplacement de votre disque dur o&ugrave; sont stock&eacute;s les messages de ce compte.</li>
</ul>

<p>&nbsp;</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:SMTP_settingsIDX"></a> <a name="SMTP:server_settingsIDX"></a> <a name="PREFERENCES_MAILNEWS_SMTP"></a>

<h2>Param&egrave;tres de compte de messagerie/forum &ndash; Serveur sortant (SMTP)</h2>

<p>M&ecirc;me si vous avez plusieurs comptes de messagerie ou de forum, vous ne devez g&eacute;n&eacute;ralement sp&eacute;cifier qu'un serveur sortant (SMTP) pour g&eacute;rer la transmission du courrier sortant.</p>

<p>Pour afficher le panneau de param&egrave;tres Serveur sortant (SMTP), proc&eacute;dez comme suit &agrave; partir de la fen&ecirc;tre Mail&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum. La bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum s'affiche.</li>

<li>S&eacute;lectionnez la cat&eacute;gorie Serveur sortant (SMTP).</li>
</ol>

<ul>
<li><b>Nom du serveur</b> : Messagerie &amp; forums utilise le nom de serveur sortant (SMTP) que vous avez introduit dans l'Assistant des comptes ou qui &eacute;tait sp&eacute;cifi&eacute; lors du transfert de ce compte &agrave; partir d'une version ant&eacute;rieure. Pour modifier le nom du serveur sortant (SMTP), entrez-le dans le champ Nom du serveur.</li>

<li><b>Port </b>: Au besoin, entrez le num&eacute;ro de port du serveur SMTP. Si aucun port n'est sp&eacute;cifi&eacute;, c'est le port par d&eacute;faut qui est utilis&eacute;.</li>

<li><b>Utiliser nom et mot de passe&nbsp;</b>: Si le serveur SMTP exige une authentification pour envoyer le courrier, s&eacute;lectionnez cette option pour &ecirc;tre invit&eacute; &agrave; entrer votre nom d'utilisateur et votre mot de passe d'authentification. Entrez ensuite le nom d'utilisateur. La premi&egrave;re fois que vous envoyez du courrier, vous serez invit&eacute; &agrave; entrer votre mot de passe d'authentification.</li>

<li><b>Utiliser une connexion s&ucirc;re (SSL)&nbsp;:</b>&nbsp; Si le serveur sortant SMTP est configur&eacute; pour envoyer des messages chiffr&eacute;s, vous pouvez choisir la fr&eacute;quence d'utilisation du protocole SSL (Secure Sockets Layer). Si vous ne savez pas quelle option choisir, contactez l'administrateur syst&egrave;me ou le FAI. </li>

<a name="default_or_multiple_SMTP_serversSDX"></a>
<li><b>Avanc&eacute;&nbsp;</b>: Choisissez cette option pour configurer d'autres serveurs sortants SMTP ou changer le serveur SMTP par d&eacute;faut. N'oubliez pas que l'utilisation de plusieurs serveurs SMTP peut entra&icirc;ner des erreurs dans l'envoi du courrier.</li>
</ul>

<p>&nbsp;</p>

<p>[&nbsp;<a href="#account_settings_intro">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<hr> <a name="Mail_and_Newsgroups:general_preferencesIDX"></a> <a name="SETTING_MAIL_PREFS"></a>

<h1>Pr&eacute;f&eacute;rences de messagerie et forums</h1>

<p>Les sections qui suivent d&eacute;crivent les pr&eacute;f&eacute;rences de messagerie et de forums applicables &agrave; tous vos comptes de messagerie et de forums. Pour afficher ces pr&eacute;f&eacute;rences :</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.

<p>(Mac OS X) Dans le menu Netscape, choisissez Pr&eacute;f&eacute;rences.</p>
</li>

<li>Double-cliquez sur la cat&eacute;gorie Messagerie &amp; forums pour d&eacute;velopper la liste.</li>
</ol>

<p>&nbsp;</p>

<table cellspacing="2" cellpadding="4" width="360" bgcolor=
"#CCCCCC">
<tr>
<td class="inthissection">Dans cette section&nbsp;:

<p><a href="#PREFERENCES_MAILNEWS_MAIN_PANE">Messagerie &amp; forums</a></p>

<p><a href="#PREFERENCES_MAILNEWS_DISPLAY">Affichage des messages</a></p>

<p><a href="#PREFERENCES_MAILNEWS_MESSAGES">Composition</a></p>

<p><a href="#PREFERENCES_MAILNEWS_FORMATTING">Format d'envoi</a></p>

<p><a href="#PREFERENCES_MAILNEWS_ADDRESSING">Adressage</a></p>

<p><a href="#PREFERENCES_MAILNEWS_LABELS">Etiquettes</a></p>

<p><a href="#PREFERENCES_MAILNEWS_RECEIPTS">Accus&eacute;s de r&eacute;ception</a></p>

<p><a href="#PREFERENCES_MAILNEWS_OFFLINE">Pr&eacute;f&eacute;rences en mati&egrave;re de travail hors ligne et d'espace disque</a> </p>
</td>
</tr>
</table>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_MAIN_PANE"></a>

<h2>Pr&eacute;f&eacute;rences de messagerie et forums - Messagerie &amp; forums</h2>

<p>Cette section d&eacute;crit les pr&eacute;f&eacute;rences principales de messagerie et de forums. Pour afficher le panneau de pr&eacute;f&eacute;rences principal Messagerie &amp; forums, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences. La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences s'affiche.</li>

<li>Cliquez sur la cat&eacute;gorie Messagerie et forums.</li>
</ol>

<ul>
<li style="list-style: none"><a name="WINDOWSETTINGS"></a></li>

<li><b>S&eacute;lectionnez la disposition de fen&ecirc;tre pr&eacute;f&eacute;r&eacute;e pour le courrier </b>: S&eacute;lectionnez le type de pr&eacute;sentation &agrave; trois volets &agrave; utiliser pour la fen&ecirc;tre Mail&nbsp;: Si vous modifiez ce r&eacute;glage, vous devez quitter Messagerie &amp; forums et relancer Netscape pour que les changements entrent en vigueur.</li>

<li><b>Confirmer avant d'envoyer les dossiers &agrave; la corbeille </b>: Messagerie &amp; forums demandera confirmation avant de supprimer les dossiers.</li>

<li><b>Confirmer lors de l'utilisation d'un raccourci clavier pour envoyer un message </b>: Messagerie &amp; forums demandera confirmation lorsque vous utiliserez le raccourci clavier pour envoyer un message. Lors de la composition d'un message, cette option permet d'&eacute;viter l'envoi accidentel du message au cas o&ugrave; vous auriez compos&eacute; le raccourci clavier par erreur.</li>

<li style="list-style: none"><a name="MAPISDX"></a></li>

<li><b>Utiliser Netscape Mail comme application de messagerie par d&eacute;faut</b>: S&eacute;lectionne Netscape Messagerie &amp; forums comme application de messagerie par d&eacute;faut pour Windows et &agrave; partir d'autres applications telles que Microsoft Word.</li>

<li style="list-style: none">
<p><b>Remarque</b>&nbsp;: Le choix de Netscape Messagerie &amp; forums comme application de messagerie par d&eacute;faut peut d&eacute;sactiver une autre application de messagerie. Pour r&eacute;tablir l'autre application comme application de messagerie par d&eacute;faut, d&eacute;s&eacute;lectionnez cette option. <a name="new_mail_soundSDX"></a></p>
</li>

<li>
<p>Signal sonore lors de&nbsp;: S&eacute;lectionnez cette option si vous souhaitez que Netscape Messagerie &amp; forums &eacute;mette le son syst&egrave;me par d&eacute;faut lors de l'arriv&eacute;e de nouveaux messages. Si aucune application Netscape n'est en cours, Quick Launch doit &ecirc;tre activ&eacute; pour que le son soit &eacute;mis &agrave; l'arriv&eacute;e des nouveaux messages.</p>

<p>Si une application Netscape est en cours, Quick Launch ne doit pas &ecirc;tre activ&eacute; pour que le son soit &eacute;mis &agrave; l'arriv&eacute;e des nouveaux messages. Pour des informations sur l'utilisation de Quick Launch, voir  <a href= "nav_help.html#nav_quicklaunch">Utilisation de Quick Launch</a>.</p>

<p>Une fois que Netscape Mail a &eacute;t&eacute; lanc&eacute;, le son signalant les nouveaux messages restera op&eacute;rationnel m&ecirc;me apr&egrave;s la fermeture de la fen&ecirc;tre Mail (pour autant qu'une autre application Netscape soit active).</p>

<a name="new_mail_alertSDX"></a></li>

<li>
<p><b>Afficher une alerte </b>: S&eacute;lectionnez cette option si vous souhaitez que Netscape Messagerie &amp; forums fasse d&eacute;filer une alerte dans la barre d'&eacute;tat du syst&egrave;me (en bas &agrave; droite de l'&eacute;cran) lors de l'arriv&eacute;e de nouveaux messages. Cette alerte n'appara&icirc;t qu'une fois au moment o&ugrave; les nouveaux messages arrivent et ne r&eacute;appara&icirc;t pas tant que vous n'affichez pas Messagerie &amp; forums au premier plan.</p>

<table>
<tr>
<td colspan="4"> <img src="images/newmailicon.gif" hspace="0" vspace="0"></td>
</tr>

<tr>
<td width="20"><b>&nbsp;</b></td>
<td><b>Alerte de nouveau message</b></td>
</tr>
</table>

<p>Lorsque l'alerte appara&icirc;t, un clic que le lien affich&eacute; dans l'alerte vous permet d'acc&eacute;der au premier dossier contenant des nouveaux messages. Si aucune application Netscape n'est en cours, Quick Launch doit &ecirc;tre activ&eacute; pour que l'alerte soit affich&eacute;e &agrave; l'arriv&eacute;e des nouveaux messages.</p>

<p>Si une application Netscape est en cours, Quick Launch ne doit pas &ecirc;tre activ&eacute; pour que l'alerte s'affiche. Pour des informations sur l'utilisation de Quick Launch, voir  <a href= "nav_help.html#nav_quicklaunch">Utilisation de Quick Launch</a>.</p>

<p>Une fois que Netscape Mail a &eacute;t&eacute; lanc&eacute;, l'alerte signalant les nouveaux messages restera op&eacute;rationnelle m&ecirc;me apr&egrave;s la fermeture de la fen&ecirc;tre Mail (pour autant qu'une autre application Netscape soit active).</p>
</li>

<li>
<p><b>Au lancement de Mail, afficher la page de d&eacute;marrage dans la zone des messages </b>: S&eacute;lectionnez cette option pour activer la page de d&eacute;marrage. La page de d&eacute;marrage s'affiche dans la zone de messages au d&eacute;marrage de Netscape Messagerie &amp; forums. C'est la page par d&eacute;faut, mais vous pouvez entrer une autre page Web ou URL de votre choix. Pour d&eacute;sactiver la page de d&eacute;marrage, d&eacute;s&eacute;lectionnez cette option. Cliquez sur Par d&eacute;faut pour r&eacute;tablir la page originale d&eacute;finie par Netscape.</p>
</li>
</ul>

<p>[&nbsp;<a href="#SETTING_MAIL_PREFS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p> <a name="smilies_in_mail_messagesSDX"></a> <a name="emoticons_in_mail_messagesSDX"></a> <a name="smilies:in_mail_messagesIDX"></a> <a name="emoticons:in_mail_messagesIDX"></a> <a name="Mail_and_Newsgroups:display_preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_DISPLAY"></a>

<h2>Pr&eacute;f&eacute;rences de messagerie et forums - Affichage des messages</h2>

<p>Les pr&eacute;f&eacute;rences d'affichage des messages permettent de configurer la fa&ccedil;on dont les messages sont affich&eacute;s (par exemple, style de police et couleur) dans tous les comptes. Si les param&egrave;tres d'affichage des messages ne sont pas encore affich&eacute;s, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences. La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences s'affiche.</li>

<li>Dans la cat&eacute;gorie Messagerie et forums, cliquez sur Affichage des messages. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>
</ol>

<ul>
<li>
<p><b>Messages en texte normal </b>: S&eacute;lectionnez la police de votre choix pour l'affichage des messages en texte normal&nbsp;: &agrave; chasse fixe ou vectorielle. Choisir un style, une taille et une couleur de police pour les messages en texte normal cit&eacute;s peut vous aider &agrave; distinguer le texte cit&eacute; (g&eacute;n&eacute;ralement un message transf&eacute;r&eacute;).</p>
</li>

<li><strong>Renvoi &agrave; la ligne automatique pour les messages en texte normal </strong>: S&eacute;lectionnez cette option pour adapter la longueur de ligne des messages entrants &agrave; la largeur de la fen&ecirc;tre Mail.</li>

<li><strong>Afficher les &eacute;moticons comme des images </strong>: S&eacute;lectionnez cette option pour que les smileys contenus dans les messages re&ccedil;us soient automatiquement transform&eacute;s en images par Messagerie &amp; forums, par exemple&nbsp;:
<p><br></p>
<table border>
<tr align="center">
<td>Smiley</td>
<td>Image</td>
</tr>

<tr align="center">
<td>:-)</td>
<td> <img src="images/smile.gif" border="0" height="21" width= "21"></td>
</tr>

<tr align="center">
<td>:)</td>
<td> <img src="images/smile.gif" border="0" height="21" width= "21"></td>
</tr>

<tr align="center">
<td>:-(</td>
<td><img src="images/frown.gif" height="21" width="21"></td>
</tr>

<tr align="center">
<td>:(</td>
<td><img src="images/frown.gif" height="21" width="21"></td>
</tr>

<tr align="center">
<td>;-)</td>
<td><img src="images/wink.gif" height="21" width="21"></td>
</tr>

<tr align="center">
<td>;-p</td>
<td><img src="images/sick.gif" height="21" width="21"></td>
</tr>
</table>
</li>

<li>
<p><b>Langues </b>: Cliquez sur la liste d&eacute;roulante Codage des caract&egrave;res pour choisir la langue par d&eacute;faut &agrave; utiliser par Messagerie &amp; forums pour les messages &eacute;lectroniques et de forums entrants. Cette option est conseill&eacute;e si vous &ecirc;tes susceptible de recevoir des messages dont le jeu de caract&egrave;res n'est pas indiqu&eacute;, comme lors de la lecture de messages dans des forums internationaux.</p>
</li>

<li><b>Appliquer le jeu par d&eacute;faut &agrave; tous les messages </b>: S&eacute;lectionnez cette option pour appliquer le codage des caract&egrave;res par d&eacute;faut &agrave; tous les messages.

<p><b> Astuce&nbsp;</b>: Vous pouvez modifier ult&eacute;rieurement le codage des caract&egrave;res (la langue) pour un dossier sp&eacute;cifique. Dans la fen&ecirc;tre Mail, s&eacute;lectionnez un dossier dans la liste des dossiers de courrier. Ouvrez le menu Afficher et choisissez Codage des caract&egrave;res.</p>
</li>
</ul>

<p>[&nbsp;<a href="#SETTING_MAIL_PREFS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:composing_preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_MESSAGES"></a>

<h2>Pr&eacute;f&eacute;rences de messagerie et forums - Composition</h2>

<p>Ces pr&eacute;f&eacute;rences s'appliquent &agrave; la cr&eacute;ation de messages (par exemple, les options de transfert et le remplissage automatique d'adresses) dans tous les comptes&nbsp;: Si les param&egrave;tres de composition ne sont pas affich&eacute;s, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums, cliquez sur Composition. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>
</ol>

<ul>
<li><strong>Transfert et r&eacute;ponse aux messages </strong>: A l'aide de la liste d&eacute;roulante Transf&eacute;rer les messages, choisissez comment le texte du message transf&eacute;r&eacute; doit appara&icirc;tre : en tant que fichier joint ou <i>ins&eacute;r&eacute;</i> (dans le corps du message).</li>

<li><strong>Inclure automatiquement le message d'origine en r&eacute;pondant &agrave; l'exp&eacute;diteur </strong>: Inclut le texte du message d'origine dans la r&eacute;ponse. Utilisez la liste d&eacute;roulante pour d&eacute;finir la position d'insertion de la r&eacute;ponse dans la zone de message.</li>

<li><strong>Composition de messages </strong>: Demande &agrave; Messagerie &amp; forums de toujours v&eacute;rifier l'orthographe des messages lorsque vous cliquez sur Envoyer. Vous pouvez configurer Messagerie &amp; forums de fa&ccedil;on &agrave; utiliser le codage MIME "quoted printable" lors de l'envoi de messages normaux utilisant un jeu de caract&egrave;res 8 bits (par exemple, Latin ISO88359).</li>

<li><strong>Renvoi &agrave; la ligne automatique des messages en texte pur &agrave; __ caract&egrave;res </strong>: Entrez un nombre pour d&eacute;finir la marge droite du texte dans la zone de message.</li>

<li><strong>Codage des caract&egrave;res&nbsp;</strong>: D&eacute;finit la langue &agrave; utiliser par d&eacute;faut pour les messages &eacute;lectroniques et de forum sortants.</li>
</ul>

<p>[&nbsp;<a href="#SETTING_MAIL_PREFS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="Mail_and_Newsgroups:formatting_preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_FORMATTING"></a>

<h2>Pr&eacute;f&eacute;rences de messagerie et forums &ndash; Format d'envoi</h2>

<p>Les pr&eacute;f&eacute;rences de format d'envoi permettent de sp&eacute;cifier le formatage des messages sortants. Si les param&egrave;tres de format d'envoi ne sont pas affich&eacute;s, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences. La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences s'affiche.</li>

<li>Dans la cat&eacute;gorie Messagerie et forums, cliquez sur Format d'envoi. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>
</ol>

<ul>
<li><strong>Me demander </strong>: Indique que Messagerie &amp; forums doit vous inviter &agrave; choisir un format avant d'envoyer le message.</li>

<li><strong>Convertir le message en texte normal </strong>: Cette option peut entra&icirc;ner la perte d'attributs tels que le gras.</li>

<li><strong>Envoyer le message en HTML malgr&eacute; tout </strong>: Si vous s&eacute;lectionnez cette option, sachez que certains programmes de messagerie auront peut-&ecirc;tre du mal &agrave; afficher le message.</li>

<li><strong>Envoyer le message en texte normal et en HTML </strong>: Cette option utilise davantage d'espace disque.</li>

<li style="list-style: none">
<p>Vous pouvez toujours ignorer ces param&egrave;tres pour un message particulier en utilisant le menu Options de la fen&ecirc;tre de composition.</p>
</li>

<li><strong>Domaines HTML et texte normal </strong>: Utilisez le bouton Ajouter pour ajouter les noms de domaines auxquels vous envoyez g&eacute;n&eacute;ralement des messages, si vous connaissez ceux qui prennent en charge les messages HTML et ceux qui ne peuvent afficher que le texte normal.</li>
</ul>

<p>Par exemple, si vous envoyez fr&eacute;quemment des messages &agrave; plusieurs destinataires qui ont le m&ecirc;me nom de domaine (par exemple, l'adresse &eacute;lectronique de tous vos coll&egrave;gues se termine par "netscape.net") et si vous savez que ce nom de domaine peut afficher des messages HTML, vous pouvez ajouter le nom de domaine netscape.net &agrave; la liste des Domaines HTML pour que Messagerie &amp; forums envoie automatiquement les messages au format HTML &agrave; ces destinataires.</p>

<p>De m&ecirc;me, si vous envoyez fr&eacute;quemment des messages &agrave; des destinataires dont le domaine ne peut recevoir que des messages en texte normal, vous pouvez ajouter ce nom de domaine &agrave; la liste des domaines texte normal, afin que Messagerie &amp; forums leur envoie automatiquement les messages au format texte normal.</p>

<p><strong>Remarque</strong>&nbsp;: Si vous composez r&eacute;guli&egrave;rement des messages HTML (format&eacute;s), n'oubliez pas que tous les destinataires n'utilisent pas un programme de messagerie affichant correctement le formatage HTML. Les pr&eacute;f&eacute;rences de format d'envoi permettent de sp&eacute;cifier le formatage des messages envoy&eacute;s &agrave; des destinataires qui ne peuvent pas afficher le format HTML. Vous pouvez convertir le message en texte normal, le formater en HTML uniquement ou le formater &agrave; la fois en texte normal et en HTML. Ces pr&eacute;f&eacute;rences s'appliquent &agrave; tous les comptes de messagerie, mais uniquement aux messages &eacute;lectroniques et pas &agrave; ceux de forums.</p>

<p>Lorsque vous ajoutez un contact ou une carte &agrave; votre carnet d'adresses, vous pouvez sp&eacute;cifier s'il peut recevoir des messages HTML. Toutefois, si vous ignorez cette information, vous pouvez d&eacute;finir des pr&eacute;f&eacute;rences de format d'envoi pour indiquer comment Messagerie &amp; forums doit formater ces messages.</p>

<p>[ <a href="#SETTING_MAIL_PREFS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>&nbsp;</p>

<a name="addressing_settingsSDX"></a> <a name="Mail_and_Newsgroups:addressing_preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_ADDRESSING"></a>

<h2>Pr&eacute;f&eacute;rences de messagerie et forums - Adressage</h2>

<p>Les pr&eacute;f&eacute;rences d'adressage permettent de d&eacute;finir les param&egrave;tres des carnets d'adresses de Netscape Messagerie &amp; forums (par exemple, la collecte d'adresses &eacute;lectroniques et le remplissage automatique de l'adresse). Si les param&egrave;tres d'adressage ne sont pas affich&eacute;s, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences. La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences s'affiche.</li>

<li>Dans la cat&eacute;gorie Messagerie et forums, s&eacute;lectionnez Adressage. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>
</ol>

<ul>
<li><b>Collecte d'adresses &eacute;lectroniques :</b> Sp&eacute;cifie la fa&ccedil;on dont Messagerie &amp; forums doit ajouter les adresses des exp&eacute;diteurs et des destinataires &agrave; votre carnet Adresses collect&eacute;es (&agrave; partir des messages entrants, sortants ou de forums).

<p><b>Remarque</b>&nbsp;: Outre votre carnet d'adresses personnel, Netscape Messagerie &amp; forums poss&egrave;de un carnet d'adresses collect&eacute;es pouvant enregistrer automatiquement les adresses comprises dans les messages entrants et/ou sortants. Pour les messages entrants, Netscape Messagerie &amp; forums stocke les adresses de chaque message d&egrave;s leur ouverture. Les adresses des messages sortants sont enregistr&eacute;es d&egrave;s que vous cliquez sur Envoyer. Les changements prendront effet au d&eacute;marrage suivant de Netscape. <a name="Mail_and_Newsgroups:address_autocompletionIDX"></a> <a name="AUTO_COMPLETE"></a></p>
</li>

<li><b>Remplissage automatique de l'adresse </b>: Le remplissage automatique d'adresses permet d'adresser rapidement un message sans devoir rechercher les noms ou les taper enti&egrave;rement. Indiquez o&ugrave; Messagerie &amp; forums doit chercher des adresses correspondantes : "Carnets d'adresses locaux" (carnet d'adresses personnel, carnet Adresses collect&eacute;es ou tout autre carnet d'adresses local) et/ou "Serveur de r&eacute;pertoire" (un serveur d'annuaire LDAP disponible).

<p><b>Remarque</b>&nbsp;: Si plusieurs adresses &eacute;lectroniques possibles sont trouv&eacute;es lors de l'adressage d'un message, Messagerie &amp; forums en affiche la liste.</p>

<p>Si vous s&eacute;lectionnez Serveur de r&eacute;pertoire, choisissez un serveur d'annuaire dans la liste. Un serveur d'annuaire permet de rechercher des adresses qui ne figurent dans aucun carnet d'adresses local. Le r&eacute;pertoire que vous s&eacute;lectionnez sera &eacute;galement utilis&eacute; pour la recherche de certificats lorsque vous tenterez d'envoyer un message chiffr&eacute; &agrave; un ou plusieurs destinataires pour lesquels vous n'avez pas de certificats enregistr&eacute;s.</p>

<p>Voir <a href="#ADD_LDAP">Ajout et suppression d'annuaires LDAP</a> pour plus d'informations sur la d&eacute;finition de param&egrave;tres de serveur d'annuaire LDAP.</p>

<p><b>Remarque</b>&nbsp;: Les param&egrave;tres de serveur d'annuaire entr&eacute;s dans la bo&icirc;te de dialogue Pr&eacute;f&eacute;rences s'appliquent &agrave; tous les comptes de messagerie. Vous pouvez les ignorer pour certains comptes en sp&eacute;cifiant d'autres param&egrave;tres de serveur d'annuaire LDAP dans la section Adressage d'un compte dans la bo&icirc;te de dialogue Param&egrave;tres de compte de messagerie/forum. Pour d&eacute;finir des options d'adressage diff&eacute;rentes pour un compte sp&eacute;cifique, ouvrez le menu Edition et choisissez Param&egrave;tres de compte de messagerie/forum.</p>
</li>
</ul>

<p>[&nbsp;<a href="#SETTING_MAIL_PREFS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Mail_and_Newsgroups:label_preferencesIDX"></a> <a name="labels:general_preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_LABELS"></a>

<h2>Pr&eacute;f&eacute;rences de messagerie et forums - Etiquettes</h2>

<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Etiquettes. Ces pr&eacute;f&eacute;rences permettent de d&eacute;finir le texte et les couleurs des &eacute;tiquettes de messages. Pour afficher ce panneau, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums, s&eacute;lectionnez Etiquettes. Si aucune option n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>
</ol>

<ul>
<li><strong>Personnaliser les &eacute;tiquettes </strong>: Sp&eacute;cifie le texte et la couleur de chaque &eacute;tiquette. Vous pouvez modifier ou remplacer le texte d'&eacute;tiquette par d&eacute;faut par votre propre texte (jusqu'&agrave; 32 caract&egrave;res). Pour changer la couleur d'&eacute;tiquette, cliquez sur le bloc de couleur face &agrave; l'&eacute;tiquette et s&eacute;lectionnez une autre couleur.</li>

<li><strong>Restaurer les valeurs par d&eacute;faut </strong>: R&eacute;tablit le texte et les couleurs par d&eacute;faut des &eacute;tiquettes.</li>
</ul>

<p>[&nbsp;<a href="#SETTING_MAIL_PREFS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Mail_and_Newsgroups:return_receipt_preferencesIDX"></a> <a name="return_receipts:general_preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_RECEIPTS"></a>

<h2>Pr&eacute;f&eacute;rences de messagerie et forums &ndash; Accus&eacute;s de r&eacute;ception</h2>

<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Accus&eacute;s de r&eacute;ception. Pour afficher le panneau Accus&eacute;s de r&eacute;ception, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Dans le menu Edition, choisissez Pr&eacute;f&eacute;rences.</li>

<li>Dans la cat&eacute;gorie Messagerie &amp; forums, s&eacute;lectionnez Accus&eacute;s de r&eacute;ception. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Messagerie &amp; forums pour d&eacute;velopper la liste.</li>
</ol>

<p>Ce panneau permet de d&eacute;finir les param&egrave;tres d'accus&eacute;s de r&eacute;ception pour les messages &eacute;mis &agrave; partir de tous vos comptes de messagerie. Utilisez &eacute;galement les pr&eacute;f&eacute;rences d'accus&eacute; de r&eacute;ception pour sp&eacute;cifier comment g&eacute;rer les demandes d'accus&eacute; de r&eacute;ception que vous recevez.</p>

<ul>
<li><strong>Lors de l'envoi de messages, toujours demander un accus&eacute; de r&eacute;ception </strong>: Permet de demander automatiquement des accus&eacute;s de r&eacute;ception pour tous les messages &eacute;mis &agrave; partir de tous vos comptes de messagerie.</li>

<li><strong>Le conserver dans ma Bo&icirc;te de r&eacute;ception </strong>: Les accus&eacute;s de r&eacute;ception sont d&eacute;pos&eacute;s dans votre bo&icirc;te de r&eacute;ception.</li>

<li style="list-style: none">
<p><strong>Astuce&nbsp;</strong>: Choisissez cette option si vous souhaitez utiliser un filtre qui d&eacute;place automatiquement les accus&eacute;s de r&eacute;ception vers un dossier de votre choix. Pour des informations sur la cr&eacute;ation et l'utilisation de filtres, voir <a href="#MAIL_FILTERS">Cr&eacute;ation de filtres de messages</a>.</p>
</li>

<li><strong>Le d&eacute;placer dans mon dossier Sent Mail </strong>: Les accus&eacute;s de r&eacute;ception entrants sont d&eacute;plac&eacute;s vers le dossier Sent mail.</li>

<li><strong>Ne jamais envoyer d'accus&eacute; de r&eacute;ception </strong>: Choisissez cette option si vous d&eacute;cidez de ne pas r&eacute;pondre aux demandes d'accus&eacute; de r&eacute;ception.</li>

<li><strong>Autoriser les accus&eacute;s de r&eacute;ception pour certains messages </strong>: Permet de choisir comment vous souhaitez r&eacute;pondre aux demandes d'accus&eacute; de r&eacute;ception que vous recevez.</li>
</ul>

<p>Pour remplacer ces pr&eacute;f&eacute;rences globales pour des comptes individuels, voir <a href="#mail-account-receipts">Param&egrave;tres de compte de messagerie/forum - Accus&eacute;s de r&eacute;ception</a>.</p>

<p>[&nbsp;<a href="#SETTING_MAIL_PREFS">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<a name="Mail_and_Newsgroups:offline_preferencesIDX"></a> <a name="Offline:general_preferencesIDX"></a> <a name="PREFERENCES_MAILNEWS_OFFLINE"></a>

<h2>Pr&eacute;f&eacute;rences de session hors ligne et d'espace disque</h2>

<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences Hors ligne &amp; espace disque. Pour afficher ce panneau, proc&eacute;dez comme suit&nbsp;:</p>

<ol>
<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.</li>

<li>Cliquez sur Hors ligne &amp; espace disque.</li>
</ol>

<p>Les pr&eacute;f&eacute;rences de session hors ligne et d'espace permettent de d&eacute;finir des param&egrave;tres de travail hors ligne, de connexion et d'espace disque.</p>

<ul>
<li><strong>Hors ligne :</strong> Indiquez comment Messagerie &amp; forums doit traiter les messages lorsque vous passez en ligne ou hors ligne.  <a name="compacting_to_save_disk_spaceSDX"></a></li>

<li><strong>Espace disque&nbsp;:</strong> S&eacute;lectionnez cette option pour &eacute;conomiser l'espace disque en compressant automatiquement les dossiers de messages lorsque cette op&eacute;ration permet de r&eacute;cup&eacute;rer l'espace disque que vous sp&eacute;cifiez.</li>
</ul>

<p>Voir <a href="#WORKING_OFFLINE">Travail hors ligne</a> pour plus d'informations sur le travail hors ligne.</p>

<p>[&nbsp;<a href="#PREFERENCES_MAILNEWS_OFFLINE">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<hr>
<p><i><!-- #BeginDate format:Sw1 -->20 juin 2002<!-- #EndDate --> </i></p>

<hr>
<p>Copyright &copy; 1994-2000 Netscape Communications Corporation.</p>
</body>
</html>

