<html>
<head>
<title>Signature et chiffrement des messages</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white">

<a NAME="secure_mail_first"></a> <a NAME="settings:signed &amp; encrypted mailIDX"></a> <a NAME="signing_email_messagesSDX"></a> <a NAME="encrypting_email_messagesSDX"></a> <a NAME="Mail_and_Newsgroups:signing_messagesIDX"></a> <a NAME="Mail_and_Newsgroups:encrypting_messagesIDX"></a> <a NAME="signing_email_messagesIDX"></a> <a NAME="encryption:of_email_messagesIDX"></a> <div class="boilerplate">Ce document est fourni par Nestcape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr>
<h1>Signature et chiffrement des messages</h1>


<p>&nbsp;

<table cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#about_sigs_encrypt">A propos des signatures num&eacute;riques et du chiffrement</a></p>
<p><a href="#get_mail_certs">Obtention des certificats d'autres personnes</a></p>
<p><a href="#config_account">Configuration des param&egrave;tres de s&eacute;curit&eacute;</a></p>
<p><a href="#signing">Signature et chiffrement d'un nouveau message</a></p>
<p><a href="#reading">Lecture de messages sign&eacute;s et chiffr&eacute;s</a></p>
<p><a href="#compose_security">S&eacute;curit&eacute; des messages &ndash; Fen&ecirc;tre de composition</a></p>
<p><a href="#received_security">S&eacute;curit&eacute; des messages &ndash; Message re&ccedil;u</a></p></td>
</tr>
</table>

<p>&nbsp;</p>



<a NAME="about_sigs_encrypt"></a>
<h2>A propos des signatures num&eacute;riques et du chiffrement </h2>

<p>Lorsque vous composez un message, vous avez la possibilit&eacute; d'y associer votre signature num&eacute;rique. Une <a href="glossary.html#digital_signature">signature num&eacute;rique</a> permet aux destinataires du message de v&eacute;rifier sa provenance et de s'assurer qu'il n'a subi aucune falsification depuis son envoi.

<p>Il vous est &eacute;galement possible de chiffrer les messages que vous r&eacute;digez. La technique de <a href="glossary.html#encryption">chiffrement</a> met votre message &agrave; l'abri des regards indiscrets sur Internet.

<p>Les techniques de signature et de chiffrement ne sont pas disponibles pour les messages de forum.

<p>Avant de pouvoir signer ou chiffrer un message, il convient de prendre quelques mesures&nbsp;:

<ol>
	<li>Vous devez obtenir un ou plusieurs <a href="glossary.html#certificate">certificats</a> (&eacute;quivalents num&eacute;riques des cartes d'identit&eacute;). Pour plus d'informations, consultez la rubrique <a href="using_certs_help.html#using_certs_get">Obtention de votre propre certificat</a>.</li>

	<li>Vous devez configurer les param&egrave;tres de s&eacute;curit&eacute; de votre compte de messagerie. Pour plus d'informations, consultez la rubrique <a href="#config_account">Configuration de vos param&egrave;tres de s&eacute;curit&eacute; </a>.</li>

</ol>

<p>Une fois ces op&eacute;rations effectu&eacute;es, vous pouvez poursuivre la proc&eacute;dure d&eacute;crite dans la rubrique <a href="#signing">Signature et chiffrement d'un nouveau message</a>.

<p>Les sections suivantes vous donnent un bref aper&ccedil;u du fonctionnement des signatures num&eacute;riques et du chiffrement. Pour obtenir davantage d'informations techniques &agrave; ce sujet, consultez le document en ligne intitul&eacute;  <a href="http://developer.netscape.com/docs/manuals/security/pkin/index.htm" TARGET="_blank">Introduction to Public-Key Cryptography (Pr&eacute;sentation de la cryptographie &agrave; cl&eacute; publique)</a>.


<p>&nbsp;</p> <a NAME="how_sigs_work"></a>
<h3>Fonctionnement des signatures num&eacute;riques</h3>

<p>Une signature num&eacute;rique est un code sp&eacute;cial, propre &agrave; chaque message, cr&eacute;&eacute; au moyen de la technique de <a href="glossary.html#public-key_cryptography">cryptographie &agrave; cl&eacute; publique</a>.

<p>Une signature num&eacute;rique n'a rien &agrave; voir avec une signature manuscrite, bien qu'elle puisse parfois &ecirc;tre utilis&eacute;e &agrave; des fins juridiques similaires, par exemple pour la signature d'un contrat.

<p>Deux &eacute;l&eacute;ments sont n&eacute;cessaires &agrave; la cr&eacute;ation d'une signature num&eacute;rique pour un message envoy&eacute;&nbsp;:

<ul>
	<li>Un <a href="glossary.html#signing_certificate">certificat de signature</a> qui vous identifie &agrave; cette fin. Chaque fois que vous signez un message, votre certificat de signature y est inclus. Ce certificat comprend une <a href="glossary.html#public_key">cl&eacute; publique</a>. La pr&eacute;sence du certificat dans le message permet au destinataire de v&eacute;rifier votre signature num&eacute;rique.</li>
	<p>Votre certificat est comparable aux coordonn&eacute;es (nom et num&eacute;ro de t&eacute;l&eacute;phone) figurant dans l'annuaire t&eacute;l&eacute;phonique&nbsp;; il s'agit d'informations publiques permettant &agrave; d'autres personnes de communiquer avec vous.
	<li>Une <a href="glossary.html#private_key">cl&eacute; priv&eacute;e</a>, cr&eacute;&eacute;e et stock&eacute;e dans votre ordinateur d&egrave;s que vous obtenez un certificat. </li>

	<p>Votre cl&eacute; priv&eacute;e destin&eacute;e &agrave; un certificat de signature est prot&eacute;g&eacute;e par votre <a href="glossary.html#master_password">mot de passe principal</a>. Le programme Netscape ne la divulgue &agrave; personne. Le logiciel Messagerie &amp; forums se sert de votre cl&eacute; priv&eacute;e pour cr&eacute;er une signature num&eacute;rique unique et v&eacute;rifiable pour tout message auquel vous attribuez une signature.
</ul>


<p>&nbsp;</p> <a NAME="how_encrypt_works"></a>
<h3> M&eacute;canisme de chiffrement</h3>

<p>Pour chiffrer un message, vous devez disposer d'un <a href="glossary.html#encryption_certificate">certificat de chiffrement</a> pour chacun des destinataires. La cl&eacute; publique de chaque certificat sert &agrave; chiffrer le message pour ce destinataire.

<p>Si vous ne disposez de certificats pour aucun des destinataires, il s'av&eacute;rera impossible de chiffrer le message.

<p>Pour d&eacute;chiffrer le message, le logiciel du destinataire utilise la cl&eacute; priv&eacute;e de ce dernier, qui reste sur cet ordinateur.

<p> [&nbsp;<A HREF="#secure_mail_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p> <a NAME="get_mail_certs"></a> <a name="LDAP:fetching_certificatesIDX></a> <a name="LDAP_certificate_fetchingSDX></a>
<h2>Obtention des certificats d'autres personnes</h2>

<p>Chaque fois que vous envoyez un message sign&eacute; num&eacute;riquement, votre certificat de chiffrement y est inclus. D&egrave;s lors, l'une des mani&egrave;res les plus simples d'obtenir le certificat d'une autre personne consiste &agrave; lui demander de vous envoyer un message sign&eacute; num&eacute;riquement.

<p>Lorsque vous recevez un message de ce type, le certificat de la personne est stock&eacute; automatiquement par le <a href="certs_help.html">Gestionnaire de certificats</a>, qui fait partie int&eacute;grante du navigateur qui assure le suivi des certificats. Cela se r&eacute;v&egrave;le particuli&egrave;rement utile dans la mesure o&ugrave; vous devez disposer d'un certificat pour chaque destinataire d'un message que vous souhaitez transmettre sous forme chiffr&eacute;e.

<p>Pour obtenir des certificats, une autre solution consiste &agrave; les rechercher dans un annuaire public, tel que les "annuaires t&eacute;l&eacute;phoniques" g&eacute;r&eacute;s par bon nombre d'entreprises.

<p>Il est &eacute;galement possible d'opter pour une recherche automatique des certificats.  Pour configurer cette fonction, vous devez acc&eacute;der aux <a href="mail_help.html#PREFERENCES_MAILNEWS_ADDRESSING">Pr&eacute;f&eacute;rences de Messagerie &amp; Forums &ndash; Adressage</a> ou aux <a href="mail_help.html#addressing_settings">Param&egrave;tres de compte de messagerie/forum &ndash; Adressage </a>. Vous pouvez y d&eacute;finir la collecte automatique d'adresses &eacute;lectroniques dans un annuaire.

<p>Lorsque vous utilisez un compte configur&eacute; pour rechercher des adresses dans un annuaire, c'est &eacute;galement dans cet annuaire que seront recherch&eacute;s les certificats correspondants lorsque vous tenterez d'envoyer un message chiffr&eacute; &agrave; un ou plusieurs destinataires pour lesquels vous ne disposez pas de certificat.

<p>Le logiciel y recherchera &eacute;galement les certificats manquants lorsque vous ouvrirez le menu d&eacute;roulant situ&eacute; sous l'ic&ocirc;ne de s&eacute;curit&eacute; dans la fen&ecirc;tre de composition et choisirez l'option S&eacute;curit&eacute; des messages.

<p> [&nbsp;<A HREF="#secure_mail_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<p>&nbsp;</p>

<a NAME="encryption:settings_for_emailIDX"></a> <a NAME="config_account"></a>
<h2>Configuration des param&egrave;tres de s&eacute;curit&eacute;</h2>

<p>Apr&egrave;s avoir obtenu un ou plusieurs certificats de messagerie, vous devez sp&eacute;cifier ceux que vous souhaitez utiliser pour la signature et le chiffrement des messages.

<p>Pour plus d'informations sur l'obtention de certificats de messagerie, consultez la rubrique <a href="using_certs_help.html#using_certs_get">Obtention de votre propre certificat</a>.

<p>Pour sp&eacute;cifier les certificats de signature et de chiffrement &agrave; utiliser pour un compte donn&eacute;, ouvrez la fen&ecirc;tre de messagerie&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et s&eacute;lectionnez Param&egrave;tres de compte de messagerie/forum.</li>
   	<li>Cliquez sur S&eacute;curit&eacute; sous le nom du compte de messagerie dont vous souhaitez configurer les param&egrave;tres de s&eacute;curit&eacute;.</li>
	<li>Cliquez sur S&eacute;lectionner dans la section Signature num&eacute;rique. Il se peut que le logiciel vous invite &agrave; saisir un <a href="glossary.html#master_password">mot de passe principal</a> avant de poursuivre la proc&eacute;dure.</li>
	<p>La bo&icirc;te de dialogue qui s'affiche alors vous permet de faire votre choix parmi les certificats de signature disponibles.
	<li>S&eacute;lectionnez le certificat de signature &agrave; utiliser, puis cliquez sur OK.</li>
	<li>Effectuez la m&ecirc;me proc&eacute;dure dans la section Chiffrement, en l'occurrence&nbsp;: cliquez sur le bouton S&eacute;lectionner, s&eacute;lectionnez le certificat de chiffrement &agrave; utiliser, puis cliquez sur OK.</li>

	<p>Dans certains cas, il peut &ecirc;tre possible de sp&eacute;cifier le m&ecirc;me certificat dans les deux sections&nbsp;; pour savoir ce qu'il en est exactement dans votre cas, consultez votre administrateur syst&egrave;me.

</ol>

<p>Vous pouvez &eacute;ventuellement indiquer que vous souhaitez signer ou chiffrer tous les messages envoy&eacute;s &agrave; partir d'un compte sp&eacute;cifique. Ces param&egrave;tres propres &agrave; un compte sont donn&eacute;s uniquement dans un souci de commodit&eacute;. Vous pouvez remplacer les param&egrave;tres par d&eacute;faut d&eacute;finis pour chaque message.

<p>Pour configurer les param&egrave;tres de signature et de chiffrement par d&eacute;faut, ouvrez le panneau de s&eacute;curit&eacute; du compte (voir proc&eacute;dure ci-dessus) et s&eacute;lectionnez vos param&egrave;tres&nbsp;:

<ul>

	<li>Sous Signature num&eacute;rique&nbsp;:</li>
	<ul><li><b>Signer num&eacute;riquement les messages&nbsp;:</b> Lorsque cette case est coch&eacute;e, tous les messages envoy&eacute;s &agrave; partir de ce compte sont sign&eacute;s num&eacute;riquement, sauf indication contraire avant l'envoi. Pour d&eacute;sactiver cette option par d&eacute;faut, d&eacute;s&eacute;lectionnez la case &agrave; cocher. </li></ul>
	<li>Sous Chiffrement (s&eacute;lectionner une option)&nbsp;:</li>
	<ul><li><b>Jamais&nbsp;:</b> Lorsque cette option est s&eacute;lectionn&eacute;e, les messages envoy&eacute;s &agrave; partir de ce compte ne sont pas chiffr&eacute;s, sauf indication contraire avant l'envoi.</li>
	<li><b>Obligatoire&nbsp;:</b> Lorsque cette option est s&eacute;lectionn&eacute;e, tous les messages envoy&eacute;s &agrave; partir de ce compte sont chiffr&eacute;s, &agrave; la condition expresse que vous disposiez de certificats valides pour chaque destinataire du message. Si vous ne disposez pas de tous les certificats n&eacute;cessaires, il s'av&eacute;rera impossible d'envoyer le message, &agrave; moins que vous ne d&eacute;sactiviez le chiffrement. </li>
</ul></ul>

<p>D&egrave;s que vous avez configur&eacute; vos param&egrave;tres de s&eacute;curit&eacute; de messagerie, cliquez sur OK pour les confirmer.

<p> [&nbsp;<A HREF="#secure_mail_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<p>&nbsp;</p> <a NAME="signing"></a>
<h2>Signature et chiffrement d'un nouveau message</h2>

<p>Avant de pouvoir signer ou chiffrer un message, vous devez obtenir au moins un certificat de messagerie et configurer correctement vos param&egrave;tres de s&eacute;curit&eacute; de messagerie. Pour obtenir des informations g&eacute;n&eacute;rales sur ces t&acirc;ches, consultez la rubrique <a href="#about_sigs_encrypt">A propos des signatures num&eacute;riques et du chiffrement</a>.

<p>Les param&egrave;tres d&eacute;finis dans le panneau <a href="mail_help.html#security_settings">Param&egrave;tres de compte de messagerie/forum &ndash; S&eacute;curit&eacute;</a> d&eacute;terminent la configuration par d&eacute;faut appliqu&eacute;e &agrave; chaque fen&ecirc;tre de composition ouverte en vue de r&eacute;diger un courrier &eacute;lectronique.

<p>Pour ouvrir une fen&ecirc;tre de composition, ouvrez la fen&ecirc;tre de messagerie et cliquez sur le bouton Composer. La pr&eacute;sence ou l'absence des ic&ocirc;nes suivantes dans le coin inf&eacute;rieur droit de la fen&ecirc;tre vous permet d'identifier imm&eacute;diatement les param&egrave;tres de s&eacute;curit&eacute; par d&eacute;faut&nbsp;:</p>

	<table><tr><td>&nbsp;</td><td><img src="chrome://messenger/skin/smime/icons/hdrSignOk.gif" alt="ic&ocirc;ne de signature num&eacute;rique"></td><td>Le message sera sign&eacute; num&eacute;riquement (pour autant que vous disposiez d'un certificat de messagerie valide qui vous identifie).</td></tr>
	<tr><td>&nbsp;</td><td><img src="chrome://messenger/skin/smime/icons/hdrCryptoOk.gif" alt="ic&ocirc;ne de chiffrement"></td><td>Le message sera chiffr&eacute; (pour autant que vous disposiez de certificats valides pour tous les destinataires).</td></tr></table>
<p>Pour activer ou d&eacute;sactiver ces param&egrave;tres, cliquez sur la fl&egrave;che situ&eacute;e sous l'ic&ocirc;ne de s&eacute;curit&eacute; dans la barre d'outils de messagerie (partie sup&eacute;rieure de la fen&ecirc;tre). S&eacute;lectionnez ensuite l'&eacute;l&eacute;ment de votre choix dans la liste d&eacute;roulante&nbsp;:
<ul>
	<li><b>Aucun chiffrement&nbsp;:</b> Cette option vous permet de d&eacute;sactiver le chiffrement pour ce message. D&egrave;s lors, le message ne sera pas chiffr&eacute; lorsqu'il sera envoy&eacute; sur Internet.</li>
	<li><b>Chiffrement requis&nbsp;:</b> Cette option vous permet d'activer le chiffrement pour ce message. D&egrave;s lors, le message sera envoy&eacute; sous forme chiffr&eacute;e. Cependant, l'envoi du message implique que vous disposiez de certificats valides pour tous les destinataires.</li>
	<li><b>Signer num&eacute;riquement&nbsp;:</b> Cette option vous permet d'activer ou de d&eacute;sactiver la signature num&eacute;rique de ce message. Une marque de s&eacute;lection indique que le message sera sign&eacute;.</li>
	<li><b>S&eacute;curit&eacute; des messages&nbsp;:</b> Cliquez sur cette option pour afficher des informations d&eacute;taill&eacute;es sur l'&eacute;tat de s&eacute;curit&eacute; du message&nbsp;; cela vous permettra, par exemple, de d&eacute;terminer s'il y a lieu d'obtenir un certificat pour l'un des destinataires.</li>
</ul>
<p>Pour afficher des informations d&eacute;taill&eacute;es sur l'&eacute;tat de s&eacute;curit&eacute; du message, vous pouvez &eacute;galement cliquer sur l'ic&ocirc;ne repr&eacute;sentant une cl&eacute; ou un cadenas, ainsi qu'il est d&eacute;crit dans la rubrique <a href="#compose_security">S&eacute;curit&eacute; des messages &ndash; Fen&ecirc;tre de composition</a>.

<p> [&nbsp;<A HREF="#secure_mail_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<p>&nbsp;</p> <a name="security:checking_for_received_messagesIDX"></a> <a name="checking_security_for_received_messagesSDX"></a> <a NAME="reading"></a>
<h2>Lecture de messages sign&eacute;s et chiffr&eacute;s</h2>

<p>Lorsque vous consultez un message chiffr&eacute; ou sign&eacute; dans la fen&ecirc;tre de messagerie, les ic&ocirc;nes suivantes, situ&eacute;es dans le coin sup&eacute;rieur droit de l'en-t&ecirc;te de message, indiquent l'&eacute;tat de s&eacute;curit&eacute; du message&nbsp;:</p>


	<table><tr><td>&nbsp;</td><td><img src="chrome://messenger/skin/smime/icons/hdrSignOk.gif" alt="ic&ocirc;ne de signature num&eacute;rique"></td><td>Le message est sign&eacute; num&eacute;riquement et a &eacute;t&eacute; valid&eacute;. En cas de probl&egrave;me avec la signature, le crayon est cass&eacute;.</td></tr>
	<tr><td>&nbsp;</td><td><img src="chrome://messenger/skin/smime/icons/hdrSignUnknown.gif" alt="ic&ocirc;ne inconnue"></td><td>Le message est sign&eacute;, mais il poss&egrave;de une pi&egrave;ce jointe volumineuse qui n'a pas encore &eacute;t&eacute; t&eacute;l&eacute;charg&eacute;e &agrave; partir du serveur IMAP. En cons&eacute;quence, la signature ne peut pas &ecirc;tre valid&eacute;e. Cliquez sur l'ic&ocirc;ne pour t&eacute;l&eacute;charger la pi&egrave;ce jointe et valider la signature.</td></tr>
	<tr><td>&nbsp;</td><td><img src="chrome://messenger/skin/smime/icons/hdrCryptoOk.gif" alt="ic&ocirc;ne de chiffrement"></td><td>Le message est chiffr&eacute;. En cas de probl&egrave;me avec le chiffrement, la cl&eacute; est cass&eacute;e.</td></tr>
	</table>

<p>Pour plus d'informations sur la validation des certificats, consultez la rubrique <a href="using_certs_help.html#Controlling_Validation">Contr&ocirc;le de la validation</a>.


<p>Pour obtenir des informations plus d&eacute;taill&eacute;es sur la s&eacute;curit&eacute; du message, cliquez sur l'ic&ocirc;ne repr&eacute;sentant une cl&eacute; ou un cadenas, ou suivez les instructions de la rubrique <a href="#received_security">S&eacute;curit&eacute; des messages &ndash; Message re&ccedil;u</a>.

<p> [&nbsp;<A HREF="#secure_mail_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<p>&nbsp;</p>

<hr> <a NAME="encryption:status_of_message_before sendingIDX"></a> <a name="security:checking_before_sending_messageIDX"></a> <a name="checking_security_before_sending_messageSDX"></a> <a NAME="compose_security"></a>
<h2>S&eacute;curit&eacute; des messages &ndash; Fen&ecirc;tre de composition</h2>

<p>Cette section d&eacute;crit la fen&ecirc;tre S&eacute;curit&eacute; des messages accessible pour tout message en cours de composition. Le cas &eacute;ch&eacute;ant, cliquez sur l'ic&ocirc;ne de s&eacute;curit&eacute; dans la barre d'outils de la fen&ecirc;tre de composition.


<p>La fen&ecirc;tre S&eacute;curit&eacute; des messages d&eacute;crit la mani&egrave;re dont votre message sera envoy&eacute;&nbsp;:

<ul>
	<li><b>Sign&eacute; num&eacute;riquement&nbsp;:</b> Cette ligne indique si une signature num&eacute;rique sera, ou non, appliqu&eacute;e &agrave; votre message. Trois possibilit&eacute;s s'offrent &agrave; vous&nbsp;:</li>

	<ul>
		<li><b>Oui&nbsp;:</b> La fonction de signature num&eacute;rique a &eacute;t&eacute; activ&eacute;e pour ce message, vous disposez d'un certificat valide qui vous identifie et le message peut &ecirc;tre sign&eacute;.</li>
		<li><b>Non&nbsp;:</b> La fonction de signature num&eacute;rique a &eacute;t&eacute; d&eacute;sactiv&eacute;e pour ce message.</li>
		<li><b>Impossible&nbsp;:</b> La fonction de signature num&eacute;rique a &eacute;t&eacute; activ&eacute;e pour ce message. Cependant, vous ne disposez d'aucun <a href="glossary.html#certificate">certificat</a> valide qui vous identifie ou un autre probl&egrave;me rend la signature impossible.</li>

	</ul>


	<li><b>Chiffr&eacute;&nbsp;:</b> Cette ligne indique si votre message sera chiffr&eacute; ou non. Trois possibilit&eacute;s s'offrent &agrave; vous&nbsp;:</li>
	<ul>
		<li><b>Oui&nbsp;:</b> La fonction de chiffrement a &eacute;t&eacute; activ&eacute;e pour ce message, vous disposez de certificats valides pour tous les destinataires r&eacute;pertori&eacute;s et le message peut &ecirc;tre chiffr&eacute;.</li>
		<li><b>Non&nbsp;:</b> Le chiffrement a &eacute;t&eacute; d&eacute;sactiv&eacute; ou ne peut pas &ecirc;tre effectu&eacute; pour ce message.</li>
		<li><b>Impossible&nbsp;:</b> Le chiffrement a &eacute;t&eacute; activ&eacute; pour ce message. Cependant, il manque un certificat valide pour au moins un des destinataires r&eacute;pertori&eacute;s, aucun destinataire n'est r&eacute;pertori&eacute; ou un autre probl&egrave;me rend impossible le chiffrement.</li>

	</ul>
</ul>

<p>La fen&ecirc;tre S&eacute;curit&eacute; des messages dresse &eacute;galement la liste des certificats disponibles pour les destinataires de votre message&nbsp;:

<ul>
	<li><b>Afficher.</b> Pour afficher des informations d&eacute;taill&eacute;es sur un certificat de la liste, s&eacute;lectionnez son nom, puis cliquez sur Afficher.</li>
</ul>

<p>Pour plus d'informations sur l'obtention de certificats et la configuration des param&egrave;tres de s&eacute;curit&eacute; des messages, consultez la rubrique <a href="#secure_mail_first">Signature et chiffrement des messages</a>

<p>Pour indiquer vos pr&eacute;f&eacute;rences en mati&egrave;re de chiffrement ou de signature d'un message, cliquez sur la fl&egrave;che situ&eacute;e &agrave; c&ocirc;t&eacute; du bouton S&eacute;curit&eacute; dans la fen&ecirc;tre de composition, puis s&eacute;lectionnez les options de votre choix.

<p>Pour d&eacute;finir les param&egrave;tres de chiffrement et de signature par d&eacute;faut pour tous les messages, consultez la rubrique <a href="mail_help.html#security_settings">Param&egrave;tres de compte de messagerie/forum &ndash; S&eacute;curit&eacute;</a>

<p> [&nbsp;<A HREF="#secure_mail_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>



<p>&nbsp;</p>

<hr><a NAME="encryption:status_of_received messageIDX"></a> <a NAME="received_security"></a>
<h2>S&eacute;curit&eacute; des messages &ndash; Message re&ccedil;u</h2>

<p>Cette section d&eacute;crit la fen&ecirc;tre S&eacute;curit&eacute; des messages accessible pour tout message re&ccedil;u. Si vous n'avez pas encore ouvert la fen&ecirc;tre de s&eacute;curit&eacute; d'un message re&ccedil;u, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Dans la fen&ecirc;tre de messagerie, s&eacute;lectionnez le message pour lequel vous souhaitez afficher des informations de s&eacute;curit&eacute;.</li>
	<li>Ouvrez le menu Afficher et s&eacute;lectionnez Infos de s&eacute;curit&eacute; du message.</li>
</ol>

<p>La fen&ecirc;tre S&eacute;curit&eacute; des messages affiche les informations suivantes&nbsp;:

<ul>
	<li><b>Signature num&eacute;rique.</b> La section sup&eacute;rieure de cette fen&ecirc;tre indique si le message est sign&eacute; num&eacute;riquement et, le cas &eacute;ch&eacute;ant, si la signature est valide. </li>

	<p>Si la validation a &eacute;chou&eacute; alors que le protocole OCSP &eacute;tait activ&eacute;, v&eacute;rifiez les param&egrave;tres OCSP d&eacute;finis dans la section <a href="validation_help.html#validation_first">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; &ndash; Validation</a>. Si vous n'&ecirc;tes pas rompu &agrave; l'utilisation du protocole OCSP, confirmez les param&egrave;tres avec votre administrateur syst&egrave;me. S'ils sont corrects, il se peut que le service OCSP connaisse un probl&egrave;me ou que le certificat utilis&eacute; pour cr&eacute;er la signature ne soit plus valide. </li>

	<p>Si la signature n'est plus valide en raison d'un probl&egrave;me affectant les param&egrave;tres de confiance du certificat, vous pouvez utiliser le <a href="certs_help.html">Gestionnaire de certificats</a> pour afficher ou modifier ces param&egrave;tres.
		<li><b>Afficher le certificat de signature.</b> Si le message est sign&eacute;, cliquez sur ce bouton pour afficher le certificat utilis&eacute; pour le signer. </li>

	<li><b>Chiffrement.</b> La section inf&eacute;rieure indique si le message est chiffr&eacute; et signale les &eacute;ventuels probl&egrave;mes de chiffrement.</li>

	<ul>
		<li>Si le contenu du message a &eacute;t&eacute; modifi&eacute; pendant la transmission, demandez &agrave; l'exp&eacute;diteur de le renvoyer. Les modifications peuvent avoir &eacute;t&eacute; caus&eacute;es par des probl&egrave;mes r&eacute;seau.</li>

    		<li>Si aucune copie de votre propre certificat (utilis&eacute; par l'exp&eacute;diteur pour chiffrer le message) n'est disponible sur votre ordinateur, il est impossible de r&eacute;cup&eacute;rer la cl&eacute; priv&eacute;e n&eacute;cessaire au d&eacute;chiffrement du message. Dans ce cas, la seule solution consiste &agrave; importer une copie de sauvegarde de votre certificat et de sa cl&eacute; priv&eacute;e (pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="certs_help.html#My_Certificates">Vos certificats</a>). Si vous ne pouvez acc&eacute;der &agrave; une copie de sauvegarde du certificat, vous ne pourrez d&eacute;chiffrer le message. </li>
</ul>
</ul>

<p> [&nbsp;<A HREF="#secure_mail_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<p>&nbsp;


<hr>


<p><i>18 juin 2002</i></p>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>
