<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Consultation d'informations sur la page</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white"> <div class="boilerplate">Ce document est fourni par Nestcape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr> <a NAME="page_info_first"></a> <a NAME="page_infoIDX"></a>
<h1>Consultation d'informations sur la page</h1>

<p>La bo&icirc;te de dialogue Infos page se compose de plusieurs onglets qui affichent diff&eacute;rents types d'informations sur la page en cours de consultation. Cette section vous donne un bref aper&ccedil;u des informations disponibles dans chaque onglet.

<p>Pour consulter les informations relatives &agrave; la page affich&eacute;e par le navigateur, s&eacute;lectionnez Infos page dans le menu Afficher. Vous pouvez ensuite cliquer sur l'onglet correspondant au type d'information que vous souhaitez visualiser.

<p>La majorit&eacute; des informations affich&eacute;es dans les onglets G&eacute;n&eacute;rales, Formulaires, Liens et M&eacute;dia de la bo&icirc;te de dialogue Infos page sont extraites de la source HTML de la page. En r&egrave;gle g&eacute;n&eacute;rale, ces informations n'int&eacute;ressent que les d&eacute;veloppeurs Web et d'autres sp&eacute;cialistes Internet.

<p>Pour plus d'informations sur le langage HTML, y compris les balises affich&eacute;es par la bo&icirc;te de dialogue Infos page, consultez la <a href="http://www.w3.org/TR/REC-html40/" target="_blank">Sp&eacute;cification HTML 4.01</a>.

<p>Les onglets Confidentialit&eacute; et S&eacute;curit&eacute; contiennent des informations sur les politiques <a href="glossary.html#p3p">P3P (Platform for Privacy Preferences)</a> du site Web dont vous consultez la page, ainsi que l'&eacute;tat de s&eacute;curit&eacute; de cette page.</p>



<table cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=380>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#pageinfo_general">Onglet G&eacute;n&eacute;rales</a></p>
<p><a href="#pageinfo_forms">Onglet Formulaires</a></p>
<p><a href="#pageinfo_links">Onglet Liens</a></p>
<p><a href="#pageinfo_media">Onglets M&eacute;dia</a></p>
<p><a href="#pageinfo_privacy">Onglet Confidentialit&eacute;</a></p>
<p><a href="#pageinfo_security">Onglet S&eacute;curit&eacute;</a></p></td>
</tr>
</table>



<p>&nbsp;</p> <a NAME="pageinfo_general"></a>
<h2>G&eacute;n&eacute;rales (onglet Infos page)</h2>

<p>Lorsque vous s&eacute;lectionnez Infos page dans le menu Afficher, l'onglet G&eacute;n&eacute;rales affiche des informations de base sur la page affich&eacute;e dans le navigateur.

<p>Dans la partie sup&eacute;rieure de la bo&icirc;te de dialogue, sont affich&eacute;s le nom de la page (si tant est qu'il y en ait un) et les informations suivantes&nbsp;:
<ul>
	<li><b>URL&nbsp;:</b>&nbsp; Adresse URL (<a href="glossary.html#Uniform_Resource_Locator_(URL)">Uniform Resource Locator</a>) de la page, c'est-&agrave;-dire l'adresse normalis&eacute;e qui appara&icirc;t dans la barre d'adresses situ&eacute;e en haut de la fen&ecirc;tre du navigateur.
	<li><b>Type&nbsp;:</b>&nbsp; Type de m&eacute;dia affich&eacute; par la page, tel que text/HTML, text/XML, audio ou application.
	<li><b>Mode de rendu&nbsp;:</b>&nbsp; Indique si le navigateur utilise le <b>mode de compatibilit&eacute;</b> ou le <b>mode de conformit&eacute; aux standards</b> pour le rendu de la page. Le mode de compatibilit&eacute; tient compte du comportement non standard que peuvent pr&eacute;senter certaines pages Web plus anciennes, con&ccedil;ues pour des versions ant&eacute;rieures de navigateurs Web qui ne sont pas totalement conformes aux standards. Le mode de conformit&eacute; aux standards adh&egrave;re scrupuleusement aux sp&eacute;cifications standard. Votre navigateur choisit automatiquement le mode de rendu conform&eacute;ment aux informations contenues dans la page Web.
	<li><b>Source&nbsp;:</b>&nbsp; Indique si le code source de la page a &eacute;t&eacute; plac&eacute; en m&eacute;moire cache.
	<li><b>Encodage&nbsp;:</b>&nbsp; Jeu de caract&egrave;res utilis&eacute; pour ce document HTML.
	<li><b>Taille&nbsp;:</b>&nbsp; Taille du fichier, si cette information est disponible.
	<li><b>Modifi&eacute;&nbsp;:</b>&nbsp; Date de la derni&egrave;re modification de la page, si cette information est disponible.
	<li><b>Date d'expiration&nbsp;:</b>&nbsp; Date d'expiration des informations affich&eacute;es par la page.

</ul>

<p>La partie inf&eacute;rieure de la bo&icirc;te de dialogue affiche les m&eacute;tatags sp&eacute;cifi&eacute;s par la page. Ces m&eacute;tatags fournissent des informations sur le type de contenu affich&eacute; par une page&nbsp;: description g&eacute;n&eacute;rale de la page, mots-cl&eacute;s pour les moteurs de recherche, informations sur les droits d'auteur, etc.


<p>&nbsp;</p> <a NAME="pageinfo_forms"></a>
<h2>Formulaires (onglet Infos page)</h2>

<p>Lorsque vous s&eacute;lectionnez Infos page dans le menu Afficher, puis cliquez sur l'onglet Formulaires, vous acc&eacute;dez &agrave; des informations sur tous les formulaires affich&eacute;s par la page affich&eacute;e actuellement par le navigateur.

<p>La partie sup&eacute;rieure de la bo&icirc;te de dialogue affiche des informations de base sur la mani&egrave;re dont chaque formulaire est sp&eacute;cifi&eacute; dans la source HTML:

<ul>
	<li><b>Nom&nbsp;:</b>&nbsp; Nom du formulaire, le cas &eacute;ch&eacute;ant.
	<li><b>M&eacute;thode&nbsp;:</b>&nbsp; M&eacute;thode HTML utilis&eacute;e pour renvoyer au serveur Web les informations captur&eacute;es par le formulaire. La commande <tt>GET</tt> ajoute les valeurs que vous avez renseign&eacute;es &agrave; l'adresse du site Web auquel elle envoie le formulaire. La commande <tt>POST</tt> envoie les valeurs au site Web sous la forme de param&egrave;tres lisibles par un programme.
	<li><b>Action&nbsp;:</b>&nbsp; URL du programme &agrave; appeler lors de l'envoi du formulaire.
</ul>

<p>Lorsque vous s&eacute;lectionnez un formulaire r&eacute;pertori&eacute; dans la partie sup&eacute;rieure de l'onglet Formulaires, la partie inf&eacute;rieure affiche des informations d&eacute;taill&eacute;es sur la mani&egrave;re dont chaque &eacute;l&eacute;ment du formulaire est sp&eacute;cifi&eacute; dans la source HTML&nbsp;:
<ul>
	<li><b>Libell&eacute;&nbsp;:</b>&nbsp;Libell&eacute; de l'&eacute;l&eacute;ment (s'il est balis&eacute; comme tel dans le code HTML).
 	<li><b>Nom du champ&nbsp;:</b>&nbsp;Nom de l'&eacute;l&eacute;ment.
	<li><b>Type&nbsp;:</b>&nbsp;Type de saisie de l'&eacute;l&eacute;ment, comme <tt>TEXT</tt> (pour l'envoi de texte), <tt>RADIO</tt> (pour une case d'option) ou encore <tt>HIDDEN</tt> (pour le stockage d'informations envoy&eacute;es, mais non visibles &agrave; l'&eacute;cran).
	<li><b>Valeur actuelle&nbsp;:</b>&nbsp;Valeur actuelle de l'&eacute;l&eacute;ment. Par exemple, dans le cas d'un &eacute;l&eacute;ment de texte, la valeur actuelle est le texte qu'il contient actuellement.
</ul>

<p>&nbsp;</p> <a NAME="pageinfo_links"></a>
<h2>Liens (onglet Infos page)</h2>

<p>Lorsque vous s&eacute;lectionnez Infos page dans le menu Afficher, puis cliquez sur l'onglet Liens, la bo&icirc;te de dialogue affiche la liste de tous les liens disponibles sur cette page. Les informations suivantes sont affich&eacute;es pour chaque lien&nbsp;:

<ul>
	<li><b>Nom&nbsp;:</b>&nbsp;Texte affich&eacute; dans le navigateur sous la forme d'un lien.
 	<li><b>Adresse&nbsp;:</b>&nbsp;<a href="glossary.html#Uniform_Resource_Locator_(URL)">URL</a> de la page vers laquelle pointe le lien.
	<li><b>Type&nbsp;:</b>&nbsp; Type de lien, tel que Marqueur (pour un lien pointant vers un endroit pr&eacute;cis dans un document HTML) ou Soumission de formulaire.
</ul>

<p>&nbsp;</p> <a NAME="pageinfo_media"></a>
<h2>M&eacute;dia (onglet Infos page)</h2>

<p>Lorsque vous s&eacute;lectionnez Infos page dans le menu Afficher, puis cliquez sur l'onglet M&eacute;dia, la bo&icirc;te de dialogue r&eacute;pertorie l'ensemble des images et des &eacute;l&eacute;ments multim&eacute;dia affich&eacute;s par la page.

<p>La partie sup&eacute;rieure de la bo&icirc;te de dialogue affiche des informations de base sur chaque &eacute;l&eacute;ment, y compris son adresse (<a href="glossary.html#Uniform_Resource_Locator_(URL)">URL</a>) et son type.

<p>Lorsque vous s&eacute;lectionnez un &eacute;l&eacute;ment multim&eacute;dia dans la partie sup&eacute;rieure de l'onglet M&eacute;dia, la partie inf&eacute;rieure affiche les informations disponibles &agrave; son sujet, telles que sa description, sa taille ou ses dimensions.

<p>L'&eacute;l&eacute;ment s&eacute;lectionn&eacute; s'affiche &eacute;galement au bas de cette bo&icirc;te de dialogue. Pour visualiser des images plus grandes, vous devez cliquer sur l'angle inf&eacute;rieur droit de la bo&icirc;te de dialogue Infos page et faire glisser le pointeur.

<p>Pour enregistrer un &eacute;l&eacute;ment multim&eacute;dia en tant que fichier distinct&nbsp;:
<ul>
	<li><b>Enregistrer sous&nbsp;:</b> S&eacute;lectionnez l'&eacute;l&eacute;ment de votre choix, cliquez sur Enregistrer sous, puis acc&eacute;dez &agrave; l'emplacement o&ugrave; vous souhaitez enregistrer l'&eacute;l&eacute;ment.
	</ul>

<p>&nbsp;</p> <a NAME="pageinfo_security"></a>
<h2>S&eacute;curit&eacute; (onglet Infos page)</h2>

<p>Lorsque vous choisissez Infos page dans le menu Afficher, puis cliquez sur l'onglet S&eacute;curit&eacute;, des informations s'affichent concernant l'<a href="glossary.html#authentication">authentification</a> et du <a href="glossary.html#encryption">chiffrement</a> de la page Web en cours de visualisation. La partie sup&eacute;rieure de la bo&icirc;te de dialogue indique si l'identit&eacute; du site Web a &eacute;t&eacute; v&eacute;rifi&eacute;e, tandis que la partie inf&eacute;rieure signale si la page a &eacute;t&eacute; chiffr&eacute;e lorsqu'elle a &eacute;t&eacute; re&ccedil;ue par le navigateur.

<p>Il est &eacute;galement possible d'acc&eacute;der directement &agrave; l'onglet S&eacute;curit&eacute; en cliquant sur l'ic&ocirc;ne repr&eacute;sentant un cadenas situ&eacute;e dans le coin inf&eacute;rieur droit de toute fen&ecirc;tre du navigateur.

<p>La partie sup&eacute;rieure de l'onglet S&eacute;curit&eacute; peut afficher l'un des messages suivants&nbsp;:

<ul>
	<li><b>Identit&eacute; du site Web non v&eacute;rifi&eacute;e&nbsp;:</b> Le site Web affich&eacute; n'a pas pr&eacute;sent&eacute; de certificat pour s'authentifier. Le Gestionnaire de certificats ne peut donc v&eacute;rifier son identit&eacute;. Il est possible, bien qu'improbable, que le site Web ne soit pas ce qu'il pr&eacute;tend &ecirc;tre.
	<li><b>Identit&eacute; du site Web v&eacute;rifi&eacute;e&nbsp;:</b> Le certificat utilis&eacute; par le Gestionnaire de certificats pour v&eacute;rifier l'identit&eacute; de ce site Web a &eacute;t&eacute; &eacute;mis par une autorit&eacute; de certification marqu&eacute;e comme fiable. Vous pouvez &ecirc;tre assez certain que le site Web est bien ce qu'il pr&eacute;tend &ecirc;tre.
</ul>

<p>La partie inf&eacute;rieure de l'onglet S&eacute;curit&eacute; peut afficher l'un des messages suivants&nbsp;:
<ul>
<LI><B>Connexion non chiffr&eacute;e&nbsp;:</B> Il est possible, bien qu'improbable, que d'autres personnes visualisent les informations envoy&eacute;es par votre ordinateur au site Web, ou inversement. </LI>


<li><b>Connexion chiffr&eacute;e&nbsp;: </b> En r&egrave;gle g&eacute;n&eacute;rale, le niveau d'une connexion chiffr&eacute;e d&eacute;pend de la longueur des cl&eacute;s utilis&eacute;es pour le chiffrement, mesur&eacute;e en bits. Plus la cl&eacute; est longue, plus le chiffrement est fort, c'est-&agrave;-dire plus il est difficile pour une personne non autoris&eacute;e de d&eacute;crypter les informations.
<p>La fen&ecirc;tre Infos page distingue trois niveaux de chiffrement&nbsp;:</p>


<ul>

	<LI><B>Chiffrement de qualit&eacute; haute&nbsp;:</B> Chiffrement le plus &eacute;lev&eacute; disponible, utilisant au moins une cl&eacute; de 128 bits.</LI>
	<LI><B>Chiffrement de qualit&eacute; moyenne&nbsp;:</B> Un peu plus fort que le chiffrement de faible niveau, avec des cl&eacute;s de 56 ou 64 bits.</LI>
	<LI><B>Chiffrement de qualit&eacute; basse&nbsp;:</B> Chiffrement le plus faible disponible, avec des cl&eacute;s de 40 bits.</LI>
</ul>

<p>La plupart des sites Web prennent en charge le chiffrement de haut niveau. Si vous consultez un site Web plus ancien prenant en charge un niveau de chiffrement plus faible, il est possible que d'autres personnes puissent voir les informations &eacute;chang&eacute;es entre votre ordinateur et le site Web. Cependant, il est improbable que cela soit le cas. </ul>

<p>L'absence de tout chiffrement, ou d'un haut niveau de chiffrement, ne doit vous inqui&eacute;ter que si vous envoyez ou affichez des informations confidentielles, comme votre num&eacute;ro de carte de cr&eacute;dit.

<p>Vous pouvez conna&icirc;tre, en un clin d'&oelig;il, l'&eacute;tat de chiffrement d'une page Web gr&acirc;ce &agrave; l'ic&ocirc;ne repr&eacute;sentant un cadenas situ&eacute;e dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre du navigateur. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="using_certs_help.html#using_certs_info">V&eacute;rification de la s&eacute;curit&eacute; d'une page Web</a>.

<p>&nbsp;</p>

<a NAME="privacy:viewing_site_policyIDX"></a> <a NAME="privacy:P3P_standard_andIDX"></a> <a NAME="viewing_P3P_policySDX"></a> <a NAME="pageinfo_privacy"></a>
<h2>Confidentialit&eacute; (onglet Infos page)</h2>

<p>Lorsque vous s&eacute;lectionnez Infos page dans le menu Afficher et cliquez sur l'onglet Confidentialit&eacute;, la bo&icirc;te de dialogue affiche la liste des diff&eacute;rents types de liens que contient la page, tels que les liens pointant vers d'autres pages, images ou scripts.

<p>Vous pouvez utiliser cet onglet pour visualiser les politiques <a href="glossary.html#p3p">P3P (Platform for Privacy Preferences)</a> du site Web dans son ensemble, ou d'autres sites vers lesquels pointent des &eacute;l&eacute;ments de la page. Ces politiques d&eacute;crivent le type d'informations collect&eacute;es par le site, les personnes auxquelles il les communique, ainsi que la fa&ccedil;on dont elles sont utilis&eacute;es.

<p>Les sites Web publient les politiques de confidentialit&eacute; sous une forme lisible par l'homme et sous la forme d'un fichier XML interpr&eacute;table par le navigateur. Pour plus d'informations sur les politiques de confidentialit&eacute;, consultez la rubrique <a href="using_priv_help.html#form_forms">Consultation des politiques de confidentialit&eacute;</a>.

<p>Pour obtenir des informations de confidentialit&eacute; sur n'importe quel site Web sp&eacute;cifi&eacute; par un lien de la page, proc&eacute;dez comme suit&nbsp;:
<ol>
	<li>Double-cliquez sur la cat&eacute;gorie &agrave; laquelle appartiennent les liens sur lesquels vous souhaitez obtenir des informations de confidentialit&eacute;.
	<li>Cliquez sur le lien sur lequel vous souhaitez afficher des informations.
	<li>Cliquez sur l'un des boutons ci-dessous pour afficher des informations sur la politique de confidentialit&eacute; du lien s&eacute;lectionn&eacute;&nbsp;:</li>
	<ul>
		<li><b>Politique&nbsp;:</b> Cliquez sur ce bouton pour afficher la politique de confidentialit&eacute; du site sous une forme lisible.
		<li><b>R&eacute;sum&eacute;&nbsp;:</b> Cliquez sur ce bouton pour afficher une interpr&eacute;tation lisible du fichier de politique XML du site, lequel d&eacute;finit avec force d&eacute;tails les politiques du site.
		<li><b>Options&nbsp;:</b> Cliquez sur ce bouton pour afficher une page Web, fournie par le site, o&ugrave; vous pouvez choisir de donner ou non votre consentement &agrave; la collecte de certains types d'informations.
	</ul>
</ol>

<p>Pour afficher des informations de confidentialit&eacute; sur le site Web dans son ensemble, cliquez sur l'adresse URL situ&eacute;e en haut de la liste, puis cliquez sur l'un des boutons.


<p>&nbsp;</p>

<hr>
<p><i>18 juin 2002</i></p>
<p>Copyright &copy; 1998-2002 Netscape Communications Corporation</p>

</body>
</html>



