<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Param&egrave;tres des mots de passe</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white">

<a NAME="passwords:settings_forIDX"></a> <a NAME="password_settings"></a> <div class="boilerplate">Ce document est fourni par Nestcape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr>
<h1>Param&egrave;tres des mots de passe</h1>

<p>Cette section vous explique comment d&eacute;finir des pr&eacute;f&eacute;rences pour votre mot de passe, d&eacute;finir votre mot de passe principal et contr&ocirc;ler d'autres aspects de la gestion des mots de passe.

<p>Pour une description pas &agrave; pas des diff&eacute;rentes t&acirc;ches li&eacute;es aux mots de passe, voir <a href="using_priv_help.html#using_password">Utilisation du Gestionnaire de mots de passe</a>.

<p>&nbsp;

<table summary="list of sections" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#passwords_first">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; &ndash; Mots de passe</a></p>
<p><a href="#password_mgr">Gestionnaire de mots de passe</a></p>
<p><a href="#Master_Password_Timeout">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; &ndash; Mot de passe principal</a></p>
<p><a href="#Change_Master_Password">Changement de mot de passe principal</a></p>
<p><a href="#Reset_Master_Password">R&eacute;initialisation du mot de passe principal</a>
</td>
</tr>
</table>

<hr> <a NAME="preferences:passwordsIDX"></a> <a NAME="passwords:preferencesIDX"></a> <a NAME="passwords_first"></a>

<h2>Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; &ndash; Mots de passe</h2>
<p>Cette section d&eacute;crit le panneau de pr&eacute;f&eacute;rences Mots de passe. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Mots de passe. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
</ol>

<p>&nbsp; <a NAME="Password_Manager"></a> <a NAME="Password_Manager:preferencesIDX"></a>

<h3>Gestionnaire de mots de passe</h3>

<p>Les pr&eacute;f&eacute;rences du Gestionnaire de mots de passe vous permettent de&nbsp;:
<ul>
<li><b>M&eacute;moriser les mots de passe&nbsp;:</b> Cochez cette case pour activer le Gestionnaire de mots de passe, afin qu'il demande s'il doit enregistrer vos noms d'utilisateur et mots de passe et les saisir automatiquement &agrave; votre place si n&eacute;cessaire. Pour d&eacute;sactiver le Gestionnaire de mots de passe, d&eacute;s&eacute;lectionnez la m&ecirc;me case.
<li><b>G&eacute;rer les mots de passe m&eacute;moris&eacute;s&nbsp;:</b> Cliquez sur ce bouton pour g&eacute;rer les informations relatives aux mots de passe m&eacute;moris&eacute;s et aux sites pour lesquels vous ne souhaitez pas stocker vos noms d'utilisateur et mots de passe.
</ul>

<p>Pour obtenir des informations d&eacute;taill&eacute;es sur l'utilisation du Gestionnaire de mots de passe, y compris pour savoir comment l'ignorer pour des sites sp&eacute;cifiques et comment afficher et g&eacute;rer les mots de passes stock&eacute;s, voir <a href="using_priv_help.html#using_password">Utilisation de Gestionnaire de mots de passe</a>.

<p>&nbsp; <a NAME="Encrypting_Versus_Obscuring"></a>
<h3>Chiffrer ou obscurcir</h3>

<p>Si vous utilisez le gestionnaire de mots de passe ou de formulaires pour enregistrer des mots de passe et des coordonn&eacute;es personnelles, ces informations sont enregistr&eacute;es sur votre ordinateur dans un fichier difficile, mais pas impossible, &agrave; lire par un intrus. Cette m&eacute;thode de stockage d'informations est parfois d&eacute;crite comme "obscurcir". Il s'agit du param&egrave;tre par d&eacute;faut qui est appliqu&eacute; aux informations m&eacute;moris&eacute;es par le Gestionnaire de mots de passe ou le Gestionnaire de formulaires.

<p>Pour une protection accrue, vous pouvez choisir de chiffrer le fichier. Le chiffrement rend plus difficile (mais encore une fois, pas impossible) la consultation de vos informations confidentielles par une personne non autoris&eacute;e.


<ul><li><b>Chiffrer les donn&eacute;es confidentielles m&eacute;moris&eacute;es&nbsp;:</b> S&eacute;lectionnez ou d&eacute;s&eacute;lectionnez cette case &agrave; cocher pour activer ou d&eacute;sactiver le chiffrement.</ul>

<p>Si vous n'avez pas encore d&eacute;fini de <a href="glossary.html#master_password">mot de passe principal</a>, vous serez invit&eacute; &agrave; en cr&eacute;er un. Pour ce faire, respectez les instructions &agrave; mesure qu'elles apparaissent &agrave; l'&eacute;cran.

<p>L'utilisation de la fonction "Chiffrer ou obscurcir" pour les donn&eacute;es confidentielles constitue un bon compromis entre s&eacute;curit&eacute; et confort d'utilisation accru&nbsp;:

<ul>
	<li>Si vous utilisez le chiffrement, vous devrez entrer p&eacute;riodiquement un mot de passe principal, ce qui peut &ecirc;tre g&ecirc;nant. (Pour plus d'informations sur le contr&ocirc;le de la fr&eacute;quence de saisie du mot de passe, consultez la rubrique Expiration de mot de passe principal dans les <a href="#Master_Password_Timeout">Pr&eacute;f&eacute;rences de confidentialit&eacute; et de s&eacute;curit&eacute; &ndash; Mots de passe principaux</a>.)
	<li>Si vous utilisez la fonction Obscurcir, il se peut que vous ne deviez pas d&eacute;finir de mot de passe principal (&agrave; moins que vous utilisiez des certificats &agrave; des fins d'identification), mais il sera alors plus ais&eacute;, pour une tierce personne qui a acc&egrave;s &agrave; votre ordinateur, de "voler" vos mots de passe.
</ul>

<p>Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="using_priv_help.html#using_encrypt">Chiffrement des informations confidentielles m&eacute;moris&eacute;es</a>.

<p>&nbsp;</p>
<hr> <a NAME="password_mgr"></a> <a NAME="Password_Manager:stored_passwordsIDX"></a>

<h2>Gestionnaire de mots de passe</h2>

<p>Cette section d&eacute;crit l'utilisation de la bo&icirc;te de dialogue Gestionnaire de mots de passe dans le but de g&eacute;rer les mots de passe m&eacute;moris&eacute;s. Si cette bo&icirc;te de dialogue n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:
<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
   	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Mots de passe. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Cliquez sur G&eacute;rer les mots de passe m&eacute;moris&eacute;s.
</ol>

<p>La fen&ecirc;tre Gestionnaire de mots de passe se compose de deux onglets&nbsp;:

<ul>
	<li><b>Mots de passe enregistr&eacute;s&nbsp;:</b> Cliquez sur cet onglet pour afficher la liste des sites pour lesquels le Gestionnaire de mots de passe a enregistr&eacute; vos nom d'utilisateur et mot de passe, c'est-&agrave;-dire les sites pour lesquels vous avez r&eacute;pondu "Oui" en r&eacute;ponse &agrave; la demande d'enregistrement des informations de connexion du Gestionnaire de mots de passe.

	<p>La deuxi&egrave;me colonne contient le nom d'utilisateur pour chaque site. Si le mot de passe est m&eacute;moris&eacute; dans sa forme chiffr&eacute;e, le terme "chiffr&eacute;" appara&icirc;t apr&egrave;s le nom d'utilisateur. Les mots de passe m&eacute;moris&eacute;s ne sont pas affich&eacute;s.

	<p>Si vous supprimez une entr&eacute;e de la liste, le nom d'utilisateur et le mot de passe m&eacute;moris&eacute;s seront supprim&eacute;s et vous devrez ouvrir une session manuellement la prochaine fois que vous vous rendrez sur ce site.

	<li><b>Mots de passe jamais enregistr&eacute;s&nbsp;:</b> Cliquez sur cet onglet pour voir la liste des sites pour lesquels vous avez s&eacute;lectionn&eacute; "Jamais pour ce site" en r&eacute;ponse &agrave; la demande d'enregistrement des informations de connexion du Gestionnaire de formulaires.

	<p>Si un site figure dans cette liste, cela signifie que vous devrez toujours saisir manuellement vos nom d'utilisateur et mot de passe pour vous y connecter.

	<p>Si vous supprimez une entr&eacute;e dans cette liste, le Gestionnaire de mots de passe vous demandera de nouveau s'il doit m&eacute;moriser vos nom d'utilisateur et mot de passe la prochaine fois que vous acc&eacute;derez &agrave; ce site.

</ul>

<p>Quel que soit l'onglet affich&eacute;, vous pouvez supprimer des entr&eacute;es de la liste comme suit :

<ul>

	<li><b>Supprimer :</b> S&eacute;lectionnez la ou les entr&eacute;es que vous souhaitez supprimer, puis cliquez sur Supprimer.
	<li><b>Supprimer tous&nbsp;:</b> Cliquez sur ce bouton pour supprimer toutes les entr&eacute;es figurant dans l'onglet affich&eacute;.

</ul>

<p>Pour plus d'informations sur le Gestionnaire de mots de passe, consultez la rubrique <a href="using_priv_help.html#using_password">Utilisation du Gestionnaire de mots de passe</a>.


<p>&nbsp;</p>
<hr> <a NAME="Master_Password_Timeout"></a> <a NAME="passwords:timeout_for_master_passwordIDX"></a> <a NAME="master_password:preferencesIDX"></a>

<h2>Pr&eacute;f&eacute;rences de confidentialit&eacute; et de s&eacute;curit&eacute; - Mots de passe principaux</h2>

<p>Cette section d&eacute;crit le panneau de pr&eacute;f&eacute;rences Mots de passe principaux. Si cette bo&icirc;te de dialogue n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Mots de passe principaux. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
</ol>

<p>&nbsp;

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#change_mp_prefs">Changement de mot de passe principal</a></p>
<p><a href="#Master_Password">Expiration de mot de passe principal</a></p>
<p><a href="#reset_mp_prefs">R&eacute;initialisation du mot de passe principal</a>
</td>
</tr>
</table>
<p>&nbsp;</p>


<a NAME="change_mp_prefs"></a>
<h3>Changement de mot de passe principal</h3>

<p>Un mot de passe principal prot&egrave;ge un dispositif de s&eacute;curit&eacute;, qui est un dispositif logiciel ou mat&eacute;riel qui stocke des informations confidentielles associ&eacute;es &agrave; votre identit&eacute;, telles que des cl&eacute;s ou certificats.

<p>Par exemple, le navigateur int&egrave;gre un dispositif de s&eacute;curit&eacute; logiciel, mais vous pouvez &eacute;galement utiliser les dispositifs de s&eacute;curit&eacute; externes, tels que des cartes &agrave; puce, si votre ordinateur est configur&eacute; pour les utiliser.

<p>Le mot de passe principal du Dispositif de s&eacute;curit&eacute; logiciel int&eacute;gr&eacute; du navigateur prot&egrave;ge &eacute;galement les informations confidentielles m&eacute;moris&eacute;es, telles que les mots de passe de messagerie et de sites Web, ainsi que d'autres donn&eacute;es m&eacute;moris&eacute;es par le Gestionnaire de mots de passe et le Gestionnaire de formulaires.

<ul><li><p><b>Changer le mot de passe :</b> Cliquez sur ce bouton pour d&eacute;finir ou modifier l'un de vos mots de passe principaux. Pour plus d'informations sur l'utilisation de la bo&icirc;te de dialogue Changement du mot de passe principal, consultez la rubrique <a href="#Change_Master_Password">Changement du mot de passe principal</a>.</ul>


<p>&nbsp;</p> <a NAME="Master_Password"></a> <a NAME="master_password:timeout_forIDX"></a>

<h3>Expiration de mot de passe principal</h3>


<p>Apr&egrave;s avoir d&eacute;fini un nouveau mot de passe principal, vous &ecirc;tes invit&eacute; &agrave; le saisir uniquement lorsque votre navigateur doit, pour la premi&egrave;re fois, acc&eacute;der &agrave; des informations, telles que des nom d'utilisateur et mot de passe, des donn&eacute;es de formulaire enregistr&eacute;es ou des certificats personnels.

<p>Vous pouvez contr&ocirc;ler le nombre de fois o&ugrave; vous &ecirc;tes invit&eacute; &agrave; saisir votre mot de passe principal&nbsp;:

<ul>
	<LI><B>La premi&egrave;re fois qu'il est n&eacute;cessaire.</B> De cette mani&egrave;re (param&egrave;tre par d&eacute;faut), le navigateur ne vous demande votre mot de passe principal que la premi&egrave;re fois qu'il doit acc&eacute;der &agrave; la base de donn&eacute;es de cl&eacute;s priv&eacute;es apr&egrave;s le d&eacute;marrage. Le navigateur ne demandera plus le mot de passe principal tant que vous ne l'aurez pas quitt&eacute; et relanc&eacute;. Ce param&egrave;tre assure le niveau de protection le plus faible.

	<LI><B>Chaque fois qu'il est n&eacute;cessaire.</B> De cette mani&egrave;re, le navigateur n'acc&eacute;dera jamais &agrave; vos informations personnelles enregistr&eacute;es sans, au pr&eacute;alable, demander votre mot de passe principal. Ce param&egrave;tre offre le niveau de protection le plus &eacute;lev&eacute;.

	<LI><B>S'il n'a pas &eacute;t&eacute; utilis&eacute; depuis __ minutes ou plus. </B>Ce param&egrave;tre am&egrave;ne le navigateur &agrave; demander votre mot de passe principal s'il doit acc&eacute;der &agrave; vos donn&eacute;es personnelles enregistr&eacute;es et si l'intervalle sp&eacute;cifi&eacute; s'est &eacute;coul&eacute; depuis le dernier acc&egrave;s.

</ul>


<p>&nbsp;</p> <a NAME="reset_mp_prefs"></a>
<h3>R&eacute;initialisation du mot de passe principal</h3>

<p><b>Avertissement&nbsp;:</b> Si vous r&eacute;initialisez votre mot de passe principal, vous effacez de mani&egrave;re permanente tous les mots de passe Web et de messagerie chiffr&eacute;s, ainsi que les donn&eacute;es de formulaires enregistr&eacute;es pour vous par le Gestionnaire de mots de passe et le Gestionnaire de formulaires. Vous perdrez &eacute;galement tous vos certificats personnels associ&eacute;s au <a href="glossary.html#software_security_device">dispositif de s&eacute;curit&eacute; logiciel</a>.

<p>Sachez que les donn&eacute;es de formulaire et mots de passe chiffr&eacute;s ne seront effac&eacute;s que si vous avez activ&eacute; le chiffrement pour ces informations m&eacute;moris&eacute;es. Pour plus d'informations sur l'activation et la d&eacute;sactivation du chiffrement, consultez la rubrique <a href="using_priv_help.html#encrypt_on">Activation et d&eacute;sactivation du chiffrement</a>.

<p>Pour modifier votre mot de passe principal, plut&ocirc;t que le r&eacute;initialiser, cliquez sur le bouton Changer le mot de passe dans le panneau de pr&eacute;f&eacute;rences Mots de passe principaux.

<p>Vous devez vous rappeler de l'ancien mot de passe principal pour le modifier &agrave; l'aide du bouton Changer le mot de passe.

<p>Si vous &ecirc;tes certain de vouloir r&eacute;initialiser votre mot de passe principal et effacer d&eacute;finitivement tous les certificats et informations personnelles chiffr&eacute;es&nbsp;:

<ul><li><p><b>R&eacute;initialiser le mot de passe principal&nbsp;:</b> Cliquez sur ce bouton pour r&eacute;initialiser le mot de passe principal du Dispositif de s&eacute;curit&eacute; logiciel. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="#Reset_Master_Password">R&eacute;initialisation du mot de passe principal</a>.</ul>



<p>&nbsp;</p>
<hr> <a NAME="Change_Master_Password"></a> <a NAME="master_password:changingIDX"></a> <a NAME="master_password:aboutIDX"></a>

<h2>Changement de mot de passe principal</h2>


<p>Cette section s'attache &agrave; d&eacute;crire la bo&icirc;te de dialogue Changement de mot de passe principal. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Mots de passe principaux. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Cliquez sur Changer le mot de passe.
</ol>

<p>Un mot de passe principal prot&egrave;ge un dispositif de s&eacute;curit&eacute;, qui est un dispositif logiciel ou mat&eacute;riel qui stocke des informations confidentielles associ&eacute;es &agrave; votre identit&eacute;, telles que des cl&eacute;s ou certificats.

<p>Par exemple, le navigateur int&egrave;gre un dispositif de s&eacute;curit&eacute; logiciel, mais vous pouvez &eacute;galement utiliser les dispositifs de s&eacute;curit&eacute; externes, tels que des cartes &agrave; puce, si votre ordinateur est configur&eacute; pour les utiliser.

<p>Le mot de passe principal du dispositif de s&eacute;curit&eacute; logiciel int&eacute;gr&eacute; prot&egrave;ge &eacute;galement votre cl&eacute; principale. Cette derni&egrave;re est utilis&eacute;e pour chiffrer des informations confidentielles, telles que des mots de passe de courrier &eacute;lectronique, de sites Web et d'autres donn&eacute;es m&eacute;moris&eacute;es par le Gestionnaire de mots de passe et le Gestionnaire de formulaires.

<p>Vous pouvez utiliser la bo&icirc;te de dialogue Changement de mot de passe principal pour fournir les informations suivantes :

<ul>
<li><b>Dispositif de s&eacute;curit&eacute; :</b> Chaque dispositif de s&eacute;curit&eacute; n&eacute;cessite un mot de passe principal distinct. Par exemple, si vous utilisez une ou plusieurs cartes &agrave; puce pour enregistrer quelques-uns de vos certificats, vous devez d&eacute;finir un mot de passe principal pour chaque. Si plusieurs dispositifs de s&eacute;curit&eacute; sont disponibles, une liste d&eacute;roulante situ&eacute;e dans la partie sup&eacute;rieure de la bo&icirc;te de dialogue D&eacute;finition du mot de passe principal permet de choisir le dispositif dont vous souhaitez changer le mot de passe.</P>

<li><b>Mot de passe actuel&nbsp;:</b> Si vous changez un mot de passe principal existant, vous devez commencer par entrer le mot de passe actuel. Si vous ne saisissez pas correctement le mot de passe actuel, le message "Vous n'avez pas introduit le mot de passe principal actuel correct" s'affiche lorsque vous cliquez sur OK. Dans ce cas, vous devez &agrave; nouveau saisir votre mot de passe actuel.

<li><b>Nouveau mot de passe :</b> Tapez votre nouveau mot de passe dans ce champ.

<li><b>Nouveau mot de passe (encore) :</b> Tapez de nouveau votre mot de passe. Si vous ne le saisissez pas la seconde fois exactement comme la premi&egrave;re, le bouton OK reste inactif. Si cela se produit, essayez de retaper le nouveau mot de passe.

</ul>

<p>Si quelqu'un utilise votre ordinateur et conna&icirc;t ou peut deviner votre mot de passe principal, cette personne peut acc&eacute;der &agrave; des sites Web en usurpant votre identit&eacute;. Cela peut &ecirc;tre dangereux, notamment si vous g&eacute;rez vos comptes financiers sur Internet.

<p>Il est donc important de s&eacute;lectionner un mot de passe principal difficile &agrave; deviner. La <b>mesure de qualit&eacute; du mot de passe</b> donne une indication de la qualit&eacute; de votre mot de passe lors de sa saisie en fonction de facteurs tels que la longueur et l'utilisation de majuscules, de minuscules, de chiffres et de symboles. Toutefois, elle ne garantit pas que personne ne sera &agrave; m&ecirc;me de d&eacute;couvrir votre mot de passe.

<p>Pour d'autres indications, reportez-vous au document en ligne <a href="http://home.netscape.com/security/basics/passwords.html" TARGET="_blank">Choix d'un bon mot de passe</a>.

<p>Il est &eacute;galement important d'enregistrer votre mot de passe principal &agrave; un endroit s&ucirc;r&mdash;et<b> non </b>&agrave; un emplacement facilement accessible &agrave; n'importe qui. Si vous oubliez ce mot de passe, vous ne pourrez pas acc&eacute;der &agrave; des informations importantes, telles que des sites Web qui n&eacute;cessitent des mots de passe ou des certificats enregistr&eacute;s sur votre ordinateur. </P>


<p>&nbsp;</p>
<hr> <a NAME="Reset_Master_Password"></a> <a NAME="master_password:resettingIDX"></a> <a NAME="resetting_master_passwordIDX"></a>

<h2>R&eacute;initialisation du mot de passe principal</h2>


<p>Cette rubrique s'attache &agrave; d&eacute;crire la bo&icirc;te de dialogue R&eacute;initilisation du mot de passe principal. Si ce panneau n'est pas affich&eacute;, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Mots de passe principaux. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Cliquez sur R&eacute;initialiser le mot de passe.
</ol>

<p><b>Avertissement&nbsp;:</b> Si vous r&eacute;initialisez votre mot de passe principal, vous effacez de mani&egrave;re permanente tous les mots de passe Web et de messagerie chiffr&eacute;s, ainsi que les donn&eacute;es de formulaires enregistr&eacute;es pour vous par le Gestionnaire de mots de passe et le Gestionnaire de formulaires. Vous perdrez &eacute;galement tous vos certificats personnels associ&eacute;s au <a href="glossary.html#software_security_device">dispositif de s&eacute;curit&eacute; logiciel</a>.

<p>Les donn&eacute;es de formulaire et mots de passe chiffr&eacute;s ne seront effac&eacute;s que si vous avez activ&eacute; le chiffrement pour ces informations m&eacute;moris&eacute;es. Pour plus d'informations sur l'activation et la d&eacute;sactivation du chiffrement, consultez la rubrique <a href="using_priv_help.html#encrypt_on">Activation et d&eacute;sactivation du chiffrement</a>.

<p>Si vous vous souvenez de votre mot de passe principal et d&eacute;cidez de le modifier, vous pouvez le faire sans risquer de perdre aucune information personnelle. Si l'alerte de r&eacute;initialisation du mot de passe principal s'affiche et si vous d&eacute;cidez de changer votre mot de passe plut&ocirc;t que de le r&eacute;initialiser, cliquez sur Annuler pour retourner au panneau de pr&eacute;f&eacute;rences Mots de passe principaux, puis cliquez sur Changer le mot de passe. Pour plus de d&eacute;tails, voir <a href="#Change_Master_Password">Changement du mot de passe principal</a>.

<p>La r&eacute;initialisation de votre mot de passe principal est une solution de dernier recours &agrave; n'adopter qu'en cas de certitude absolue que vous l'avez oubli&eacute;. La gravit&eacute; de la situation d&eacute;pend de la quantit&eacute; de donn&eacute;es personnelles que prot&egrave;ge votre mot de passe principal.

<p>La r&eacute;initialisation du mot de passe principal n'en g&eacute;n&egrave;re pas un nouveau. Cette op&eacute;ration supprime toutes les donn&eacute;es prot&eacute;g&eacute;es par votre ancien mot de passe principal. Vous serez invit&eacute; &agrave; sp&eacute;cifier un nouveau mot de passe principal la prochaine fois que le navigateur devra stocker des informations personnelles.

<p>Apr&egrave;s avoir r&eacute;initialis&eacute; votre mot de passe principal, il se peut que vous souhaitiez r&eacute;enregistrer des informations personnelles en vue de les saisir automatiquement &agrave; l'avenir. Ainsi, en naviguant, vous souhaiterez peut-&ecirc;tre que votre Gestionnaire de mots de passe enregistre &agrave; nouveau des mots de passe de messagerie et de sites Web.

<p>Vous devrez &eacute;galement entrer des donn&eacute;es manuellement jusqu'&agrave; ce que le Gestionnaire de formulaires accumule suffisamment de donn&eacute;es pour compl&eacute;ter automatiquement les formulaires. En outre, tous les certificats personnels associ&eacute;s au dispositif de s&eacute;curit&eacute; logiciel seront effac&eacute;s de mani&egrave;re permanente et vous devrez en demander de nouveaux.

<p><b>Remarque pour les utilisateurs de cartes &agrave; puce :</b> Chaque carte &agrave; puce a son propre mot de passe principal. Le mot de passe principal d'une carte &agrave; puce ne prot&egrave;ge que les donn&eacute;es de celle-ci (telles que des certificats personnels). Vous pouvez normalement changer le mot de passe principal d'une carte &agrave; puce (pour autant que vous vous en souveniez), mais vous ne pouvez pas le r&eacute;initialiser.


<hr>
<p><i>18 juin 2002</i></p>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>



