<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute;</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white">

<div class="boilerplate">Ce document est fourni par Nestcape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr> <a NAME="preferences:privacyIDX"></a> <a NAME="preferences:securityIDX"></a> <a NAME="privsec_help_first"></a> <a NAME="security:preferencesIDX"></a> <a NAME="privacy:preferencesIDX"></a>
<h1>Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute;</h1>

<p>Les sections suivantes d&eacute;crivent les pr&eacute;f&eacute;rences en mati&egrave;re de confidentialit&eacute; et de s&eacute;curit&eacute;. Pour afficher ces panneaux de pr&eacute;f&eacute;rences, proc&eacute;dez comme suit :
<ol>
   <li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<p>(Mac OS X) Dans le menu Netscape, choisissez Pr&eacute;f&eacute;rences.</p>
   <li>Cliquez sur la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste, puis cliquez sur le nom des pr&eacute;f&eacute;rences &agrave; afficher ou modifier.
</ol>

<p>Pour obtenir de l'aide sur les param&egrave;tres d'un panneau, cliquez sur le lien appropri&eacute; ci-dessous.</p>



<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Rubriques connexes&nbsp;:</p>
<p><a href="using_priv_help.html#cookie_prefs">Cookies</a></p>
<p><a href="using_priv_help.html#using_images">Images</a></p>
<p><a href="using_priv_help.html#forms_mgr">Formulaires</a></p>
<p><a href="passwords_help.html">Mots de passe</a></p>
<p><a href="passwords_help.html#Master_Password_Timeout">Mots de passe principaux</a></p>
<p><a href="ssl_help.html">SSL</a></p>
<p><a href="certs_prefs_help.html">Certificats</a></p>
<p><a href="validation_help.html">Validation</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>



<hr>
<p><i>18 juin 2002</i></p>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>
