<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Confidentialit&eacute; sur Internet</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white">


<div class="boilerplate">Ce document est fourni par Nestcape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<a NAME="privacy:protectingIDX"></a>
<hr><a NAME="using_maintain"></a>
<h1>Utilisation des fonctions de confidentialit&eacute;</h1>

<p>Votre navigateur s'accompagne de fonctions que vous pouvez utiliser pour optimiser la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles. Les sections suivantes vous expliquent comment utiliser votre navigateur afin de contr&ocirc;ler les cookies, mots de passe, formulaires et images lorsque vous surfez sur Internet.

<p>Certains sites Web publient leurs politiques de confidentialit&eacute; conform&eacute;ment &agrave; la norme P3P (Platform for Privacy Preferences). Pour plus d'informations sur la mani&egrave;re de personnaliser votre navigateur en fonction de cette norme, consultez la rubrique <a href="using_priv_help.html#privacy_levels">D&eacute;finition des niveaux de confidentialit&eacute;</a>.

<p>Pour plus d'informations sur les fonctions de s&eacute;curit&eacute; associ&eacute;es &agrave; Netscape, consultez les rubriques <a href="mail_sec_help.html">Signature et chiffrement de messages</a> et <a href="using_certs_help.html">Utilisation de certificats</a>.

<p>Pour obtenir des informations plus g&eacute;n&eacute;rales sur la confidentialit&eacute; et la s&eacute;curit&eacute;, y compris la description des virus, les op&eacute;rations bancaires et les achats s&eacute;curis&eacute;s en ligne et la limitation de la navigation pour les enfants, consultez le document intitul&eacute;<a href="http://home.netscape.com/security/basics/index.html?cp=sciln" target="_blank">Understanding Security</a>.</p>


<table cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Rubriques relatives &agrave; la confidentialit&eacute; :</p>
<p><a href="#sec_maintain">Confidentialit&eacute; sur Internet</a></p>
<p><a href="using_priv_help.html#using_cookies">Utilisation du Gestionnaire de cookies</a></p>
<p><a href="using_priv_help.html#using_password">Utilisation du Gestionnaire de mots de passe</a></p>
<p><a href="using_priv_help.html#using_forms">Utilisation du Gestionnaire de formulaires</a></p>
<p><a href="using_priv_help.html#using_encrypt">Chiffrement d'informations sensibles enregistr&eacute;es</a>
<p><a href="using_priv_help.html#managing_images">Gestion des images</a></p>
<p><a href="privsec_help.html">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute;</a> </p>

</td>
</tr>
</table>

<p>&nbsp;</p> <a NAME="privacy:aboutIDX"></a>
<hr><a NAME="sec_maintain"></a>
<h1>Confidentialit&eacute; sur Internet</h1>

<p>Cette section r&eacute;sume des informations g&eacute;n&eacute;rales sur la confidentialit&eacute; sur Internet. Elle donne &eacute;galement quelques indications sur ce que vous pouvez faire pour prot&eacute;ger votre confidentialit&eacute;. Elle n'a pas pour objectif de fournir une description compl&egrave;te de la confidentialit&eacute; sur Internet.</p>

<table cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#privacy_visit">Quelles informations fournit mon navigateur &agrave; un site Web&nbsp;?</a></p>
<p><a href="#privacy_cookies">Que sont les cookies et comment fonctionnent-ils&nbsp;?</a></p>
<p><a href="#privacy_email">Comment puis-je contr&ocirc;ler des pages Web dans des messages &eacute;lectroniques ?</a></p>
<p><a href="#privacy_unauth">Comment m'assurer que des personnes non autoris&eacute;es n'utilisent pas les informations me concernant&nbsp;?</a></p></td>
</tr>
</table>

<p>&nbsp;</p> <a NAME="privacy_visit"></a> <a NAME="privacy_&amp;_IP_addressSDX"></a>
<h2>Quelles informations fournit mon navigateur &agrave; un site Web&nbsp;?</h2>

<p>Lorsque votre navigateur affiche une page Web (c'est le cas, par exemple, lorsque vous cliquez sur un lien ou entrez une URL, ou encore quand une page Web s'affiche dans un message &eacute;lectronique), il communique certains types d'informations au site, dont&nbsp;: votre environnement d'exploitation, votre adresse Internet et la page visit&eacute;e pr&eacute;c&eacute;demment.

<p>&nbsp;</p>
<h3>Environnement d'exploitation</h3>

<p>Le site re&ccedil;oit des informations sur votre environnement d'exploitation, telles que le type de navigateur et le syst&egrave;me d'exploitation. Cela permet au site de pr&eacute;senter la page d'une mani&egrave;re optimale pour votre &eacute;cran. Par exemple, le site peut apprendre que vous utilisez la version fran&ccedil;aise du navigateur Netscape 6.2.3 sous Windows 2000.

<p>&nbsp;</p> <a name="ip"></a>
<h3>Adresse Internet</h3>

<p>Votre navigateur doit donner au site votre adresse Internet (&eacute;galement appel&eacute;e adresse IP) pour savoir o&ugrave; envoyer la page demand&eacute;e. Le site ne peut pas fournir la page s'il ne conna&icirc;t pas votre adresse IP.

<p>L'adresse IP peut &ecirc;tre temporaire ou fixe (statique).

<p>Si vous vous connectez &agrave; Internet par le biais d'un modem standard raccord&eacute; &agrave; votre ligne t&eacute;l&eacute;phonique, il se peut que votre fournisseur de services Internet vous attribue une adresse&nbsp;IP temporaire &agrave; chaque connexion. Cette adresse IP temporaire s'utilise le temps d'une session Internet&nbsp;; par exemple, jusqu'&agrave; ce que vous fermiez la session ou mettiez fin &agrave; votre connexion &agrave; distance, ou encore lorsque vous interrompez la connexion entre votre ordinateur et Internet. Chaque fournisseur d'acc&egrave;s Internet (FAI) compte de nombreuses adresses IP et les attribuent de mani&egrave;re al&eacute;atoire aux utilisateurs.

<p>Si vous poss&eacute;dez un modem DSL ou c&acirc;ble ou une connexion &agrave; fibre de verre, vous pouvez avoir une adresse IP fixe utilis&eacute;e &agrave; chaque connexion.

<p>Il ne faut pas confondre adresse&nbsp;IP et courrier &eacute;lectronique.

<p>&nbsp;</p>
<h3>Page de r&eacute;f&eacute;rence</h3>

<p>Le site est &eacute;galement inform&eacute; de la page que vous &eacute;tiez en train de consulter avant de cliquer sur un lien pour afficher l'une des pages du site. Cela lui permet de savoir quel site vous a dirig&eacute; vers lui. S'il s'agit d'une page du m&ecirc;me site, cela lui permet de conna&icirc;tre les pages que vous avez consult&eacute;es.


<p>&nbsp;</p> <a NAME="privacy_cookies"></a> <a NAME="privacy:cookies_andIDX"></a> <a NAME="cookies:aboutIDX"></a>
<h2>Que sont les cookies et comment fonctionnent-ils&nbsp;?</h2>

<p>Un cookie est un petit ensemble d'informations utilis&eacute; par certains sites Web. Lorsque vous visitez le site utilisant des cookies, ce dernier peut demander &agrave; votre navigateur de placer un ou plusieurs cookies sur votre disque dur.

<p>Lorsque vous visitez &agrave; nouveau le site, le navigateur renvoie les cookies appartenant au site.

<p>Par d&eacute;faut, cette activit&eacute; est transparente et vous ignorez &agrave; quel moment un site place un cookie ou quand le navigateur renvoie un cookie au site. Toutefois, vous pouvez d&eacute;finir vos pr&eacute;f&eacute;rences de fa&ccedil;on &agrave; &ecirc;tre invit&eacute; &agrave; autoriser le placement d'un cookie. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="using_priv_help.html#privacy_levels">D&eacute;finition des niveaux de confidentialit&eacute;</a>.


<p>&nbsp;</p> <a name="privacy_how"></a>
<h3>Comment les sites utilisent-ils les informations des cookies&nbsp;?</h3>


<p>Les cookies permettent au site d'obtenir des informations sur vos pr&eacute;c&eacute;dentes visites. Ainsi, si vous utilisez g&eacute;n&eacute;ralement un site Web pour consulter les pr&eacute;visions m&eacute;t&eacute;orologiques r&eacute;gionales ou acheter des livres, le site pourra utiliser des cookies pour se souvenir de la ville o&ugrave; vous r&eacute;sidez ou de vos auteurs favoris, de telle sorte que votre prochaine visite soit plus simple et plus pratique.

<p>De nombreux sites Web ont des politiques de confidentialit&eacute; qui d&eacute;crivent la fa&ccedil;on dont ils utilisent les informations re&ccedil;ues.

<p>Vous pouvez consulter la politique de confidentialit&eacute; d'un site Web afin de savoir ce qu'il advient des informations collect&eacute;es, comment ces informations sont utilis&eacute;es, ou encore les options dont vous disposez concernant l'usage de ces informations. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="using_priv_help.html#form_forms">Consultation des politiques de confidentialit&eacute;</a>.

<p>Pour plus d'informations sur la gestion des cookies &agrave; l'aide des politiques de confidentialit&eacute; publi&eacute;es, consultez la rubrique <a href="using_priv_help.html#privacy_levels">D&eacute;finition des niveaux de confidentialit&eacute;</a>.
</p>

<p>&nbsp;</p> <a name="privacy_foreign"></a> <a NAME="third-party_cookiesSDX"></a> <a NAME="cookies:foreignIDX"></a>
<h3>Que sont les cookies de tiers&nbsp;?</h3>

<p>Si votre navigateur enregistre le cookie d'un site, il ne le renvoie qu'&agrave; ce site. Le navigateur ne peut fournir &agrave; un site des cookies plac&eacute;s par un autre. Un site Web ne pouvant recevoir que ses propres cookies, il peut op&eacute;rer le suivi de vos activit&eacute;s sur ce site, mais pas de l'ensemble de vos activit&eacute;s de navigation sur le Web.

<p>Il arrive cependant qu'un site Web affiche du contenu h&eacute;berg&eacute; sur un autre site.  Il peut s'agir d'une image, d'un texte ou encore d'une publicit&eacute;. L'autre site Web qui h&eacute;berge ces &eacute;l&eacute;ments a &eacute;galement la possibilit&eacute; de stocker un cookie dans votre navigateur, m&ecirc;me si vous ne le visitez pas directement.

<p>Les cookies stock&eacute;s par un site autre que celui en cours de consultation sont appel&eacute;s <b>cookies de tiers</b> ou <b>cookies &eacute;trangers</b>. Il arrive que des sites Web utilisent des cookies de tiers avec des <b>GIF transparents</b>. Ces GIF sont des images sp&eacute;ciales qui aident les sites Web &agrave; compter le nombre d'internautes, &agrave; assurer le suivi des r&eacute;ponses par courrier &eacute;lectronique, &agrave; en apprendre davantage sur les visiteurs du site ou encore &agrave; personnaliser votre mode de navigation. Les GIF transparents sont &eacute;galement connus sous le nom de balises Web ou de bogues Web.

<p>Vous pouvez, si vous le souhaitez, configurer vos pr&eacute;f&eacute;rences en mati&egrave;re de cookies, de telle sorte que les sites puissent stocker des cookies ordinaires, mais pas de cookies de tiers.

<p>&nbsp;</p> <a name="privacy_email"></a> <a NAME="Mail &amp; Newsgroups:privacy_optionsIDX"></a> <a NAME="cookies:email_andIDX"></a> <a NAME="images:email_andIDX"></a>
<h2>Comment puis-je contr&ocirc;ler des pages Web dans des messages &eacute;lectroniques ?</h2>

<p>Vous pouvez d&eacute;sactiver compl&egrave;tement les cookies, les images, JavaScript et les modules externes pour les pages Web re&ccedil;ues dans le cadre de messages &eacute;lectroniques.

<p>Bien que pratiques lorsque vous naviguez sur le Web, ces fonctionnalit&eacute;s peuvent se r&eacute;v&eacute;ler inutiles dans les pages Web re&ccedil;ues sous la forme de pi&egrave;ces jointes.

<p>Pour plus d'informations sur l'activation ou la d&eacute;sactivation des cookies, des images, de JavaScript et des modules externes dans les messages &eacute;lectroniques, reportez-vous aux section suivantes&nbsp;:


<ul>
	<li><a href = "using_priv_help.html#cookie_prefs">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; - Cookies</a>
	<li><a href = "using_priv_help.html#using_images">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; &ndash; Images</a>
	<li><a href = "cs_nav_prefs_advanced.html#Scripts">Pr&eacute;f&eacute;rences avanc&eacute;es &ndash; Scripts et plugins</a>
</ul>


<p>&nbsp;</p> <a NAME="privacy_unauth"></a>
<h2>Comment m'assurer que des personnes non autoris&eacute;es n'utilisent pas les informations me concernant&nbsp;?</h2>

<p>La meilleure mani&egrave;re de pr&eacute;server la confidentialit&eacute; de vos informations consiste &agrave; lire les politiques de confidentialit&eacute; des sites Web visit&eacute;s et des services Internet utilis&eacute;s, ainsi qu'&agrave; faire preuve de prudence lorsque vous les communiquez &agrave; d'autres utilisateurs en ligne.

<p>Internet est un r&eacute;seau public. Aussi, lorsque vous envoyez vos nom, num&eacute;ro de t&eacute;l&eacute;phone, adresse et autres informations sur le r&eacute;seau (via une page Web, un courrier &eacute;lectronique ou toute autre m&eacute;thode), il est possible qu'une autre personne puisse les intercepter.</p>

<p>Voici quelques questions &agrave; poser sur la politique de confidentialit&eacute; d'un site Web :

<ul>
<li>Quels types d'informations confidentielles sont rassembl&eacute;es par ce site ?
<li>Comment le site utilisera-t-il ces informations ?
<li>Le site partagera-t-il ces informations avec des tiers et quelles sont les possibilit&eacute;s dont je dispose en ce qui concerne l'usage des informations &eacute;ventuellement partag&eacute;es&nbsp;?
<li>Puis-je acc&eacute;der &agrave; tout ou partie des informations me concernant rassembl&eacute;es par un site, afin de les contr&ocirc;ler ou de les actualiser ?
<li>Comment le site prot&egrave;ge-t-il ces informations&nbsp;?
<li>Comment puis-je contacter le site Web en cas de question ou de probl&egrave;me ?
</ul>

<p>Pour plus d'informations sur la consultation de la politique de confidentialit&eacute; d'un site Web, reportez-vous &agrave; <a href="using_priv_help.html#form_forms">Consultation des politiques de confidentialit&eacute;</a>.


<p>&nbsp;</p>

<a NAME="privacy_anon"></a> <a NAME="browsing_anonymouslyIDX"></a> <a NAME="privacy:IP_addressIDX"></a> <a NAME="protecting_your_IP_addressSDX"></a>

<p> [&nbsp;<A HREF="#using_maintain">Retour au d&eacute;but de la section</A>&nbsp;]
</p>




<hr>

<p><i>18 juin 2002</i></p>

<hr>
<p>Copyright &copy; 1998-2002 Netscape Communications Corporation.</p>

</body>
</html>
