<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Gestion des profils</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white">


<a NAME="managing_profiles"></a> <a NAME="profiles:managingIDX"></a>
<hr><h1>Gestion des profils</h1>

<p>Si vous utilisez Internet chez vous et au travail, vous souhaiterez peut-&ecirc;tre acc&eacute;der &agrave; diff&eacute;rents jeux de signets, pr&eacute;f&eacute;rences, carnets d'adresses, comptes de messagerie, configuration de barre lat&eacute;rale, etc. De m&ecirc;me, les diff&eacute;rents membres de votre famille peuvent vouloir partager une copie du m&ecirc;me navigateur mais conserver leurs identit&eacute;s Internet s&eacute;par&eacute;es.

<p>Le Gestionnaire de profils permet de cr&eacute;er diff&eacute;rents profils, chacun avec ses propres signets, pr&eacute;f&eacute;rences, param&egrave;tres de messagerie, etc. Un profil par d&eacute;faut est cr&eacute;&eacute; automatiquement lors de la premi&egrave;re installation de votre logiciel de navigation. Apr&egrave;s avoir cr&eacute;e un ou plusieurs profils suppl&eacute;mentaires, vous serez invit&eacute; &agrave; pr&eacute;ciser celui que vous souhaitez utiliser &agrave; chaque d&eacute;marrage du navigateur.</P>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#creating_profiles">Cr&eacute;ation d'un profil</a></p>
<p><a href="#deleting_profiles">Suppression ou changement de nom d'un profil</a></p>
</td>
</tr>
</table>


<p>&nbsp;</p> <a NAME="creating_profiles"></a> <a NAME="profiles:creatingIDX"></a>
<h2>Cr&eacute;ation d'un profil</h2>

<p>Pour cr&eacute;er un profil :

<ol>
	<li>Quittez le navigateur. Il est impossible de cr&eacute;er un profil tant que Navigator, Mail ou un autre composant de votre logiciel de navigation est actif.
	<li>Ouvrez le Gestionnaire de profils&nbsp;:</li>
	<ul>
		<li>Sous Windows, ouvrez le menu D&eacute;marrer et choisissez Programmes, Netscape 7,0, puis Gestionnaire de profils.
		<li>Sous Mac OS, ouvrez le dossier de Netscape, puis double-cliquez sur le Gestionnaire de profils.
		<li>Sous Linux, tapez ce qui suit sur la ligne de commande : <tt> ./netscape -profilemanager</tt>
	</ul>
	<li>Cliquez sur Cr&eacute;er profil, lisez la description du profil, puis cliquez sur Suivant.
	<li>Entrez un nom de profil. Vous pouvez entrer ce que vous souhaitez : votre v&eacute;ritable nom ou un nom associ&eacute; &agrave; l'usage du profil, comme "Ecole".
	<li>Acceptez le r&eacute;pertoire par d&eacute;faut pour le nouveau profil ou cliquez sur le bouton Choisir un dossier et s&eacute;lectionnez l'emplacement de votre choix.
	<li>Si des modules linguistiques ou de contenu r&eacute;gional sont install&eacute;s, cliquez sur S&eacute;lection de la r&eacute;gion et choisissez la langue et/ou le contenu d&eacute;sir&eacute;.
	<li>Cliquez sur Termin&eacute;.
</ol>

<p>L'&eacute;cran d'ouverture du Gestionnaire de profil r&eacute;appara&icirc;t, avec le nouveau profil en surbrillance dans la liste.

<p>Pour configurer votre navigateur pour le nouveau profil, cliquez sur D&eacute;marrer Netscape 7,0. Le syst&egrave;me vous invite &agrave; enregistrer un pseudonyme (si vous en avez d&eacute;j&agrave; un) que vous utiliserez avec Netscape Webmail, Netscape Instant Messenger, ainsi que pour personnaliser votre page My Netscape. Si vous ne disposez pas d'un pseudonyme, cliquez sur Enregistrer maintenant pour en obtenir un.

<p>Si vous ne souhaitez pas enregistrer de pseudonyme pour l'instant, cliquez sur Annuler et le programme s'ouvrira. Pour enregistrer un pseudonyme alors qu'une session Netscape est ouverte, ouvrez le menu Aide et s&eacute;lectionnez Enregistrement Netscape.

<p>Lorsque vous commencerez &agrave; utiliser le nouveau profil, vous serez invit&eacute; &agrave; fournir des informations suppl&eacute;mentaires &agrave; mesure que vous ex&eacute;cuterez des t&acirc;ches qui les exigent, par exemple v&eacute;rifier vos messages.


<p>&nbsp;</p> <a NAME="deleting_profiles"></a> <a NAME="profiles:deletingIDX"></a> <a NAME="profiles:renamingIDX"></a>
<h2>Suppression ou changement de nom d'un profil</h2>

<p>Vous souhaiterez peut-&ecirc;tre supprimer les profils que vous n'utilisez normalement pas. Pour supprimer ou renommer un profil existant :

<ol>
	<li>Quittez le navigateur. Il est impossible de cr&eacute;er, supprimer ou renommer un profil tant que Navigator, Mail ou un autre composant de votre logiciel de navigation est actif.

	<li>Ouvrez le Gestionnaire de profils&nbsp;:</li>
	<ul>
		<li>Sous Windows, ouvrez le menu D&eacute;marrer et choisissez Programmes, Netscape 7,0, puis Gestionnaire de profils.
		<li>Sous Mac OS, ouvrez le dossier de Netscape, puis double-cliquez sur le Gestionnaire de profils.
		<li>Sous Linux, tapez ce qui suit sur la ligne de commande : <tt>./netscape -profile</tt>
	</ul>
	<li>Pour supprimer un profil, s&eacute;lectionnez son nom et cliquez sur Supprimer un profil.
	<li>Pour renommer un profil, s&eacute;lectionnez son nom, cliquez sur Renommer le profil et suivez les instructions.
</ol>

<hr>

<p><i>18 juin 2002</i></p>

<hr>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>
