<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Param&egrave;tres SSL</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white"> <div class="boilerplate">Ce document est fourni par Netscape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr> <a NAME="settings:SSLIDX"></a> <a NAME="ssl_settings"></a>
<h1>Param&egrave;tres SSL</h1>
<p>Cette section d&eacute;crit la configuration des pr&eacute;f&eacute;rences et des codes SSL.</p>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#ssl_prefs">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; - SSL</a></p>
<p><a href="#cipher_help">Modification des codes SSL</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p>





<hr><a NAME="preferences:SSLIDX"></a> <a NAME="ssl_prefs"></a> <a NAME="SSL:preferencesIDX"></a>
<h2>Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; - SSL</h2>
<p>Cette section d&eacute;crit l'utilisation du panneau de pr&eacute;f&eacute;rences SSL. Si vous n'avez pas encore affich&eacute; le panneau, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur SSL. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.</li>
</ol>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissections">
<p>Dans cette section&nbsp;:</p>
<p><a href="#SSL_Protocol_Versions">Versions du protocole SSL</a></p>
<p><a href="#SSL_Warnings">Avertissements SSL</a></p>
</td>
</tr>
</table>





<p>&nbsp;</p> <a NAME="SSL_Protocol_Versions"></a>
<h3>Versions du protocole SSL</h3>


<p>Le protocole SSL (Secure Sockets Layer) d&eacute;finit les r&egrave;gles r&eacute;gissant l'authentification mutuelle entre un site Web et le navigateur et le chiffrement des informations qu'ils &eacute;changent. Le protocole TLS (Transport Layer Security) est un standard IETF fond&eacute; sur SSL. TLS 1.0 peut &ecirc;tre consid&eacute;r&eacute; comme SSL 3.1.

<p>Vous devriez normalement laisser ces trois cases coch&eacute;es pour garantir la compatibilit&eacute; du navigateur avec les anciens et les nouveaux serveurs Web :
<ul>
	<li><b>Activer SSL version 2 :</b> Permet aux anciens serveurs Web de fonctionner avec le navigateur.
	<li><b>Activer SSL version 3 :</b> Permet aux nouveaux serveurs Web de fonctionner avec le navigateur.
	<li><b>Activer TLS&nbsp;:</b> Permet aux serveurs Web compatibles TLS d'exploiter ce protocole.</li>
</ul>

<p>Pour activer ou d&eacute;sactiver des codes SSL individuels, cliquez sur Modifier les chiffres :

<ul><li><b>Modifier les chiffres :</b> N'essayez pas de modifier les codes SSL individuellement &agrave; moins de savoir exactement ce que vous faites et d'en avoir discut&eacute; avec votre administrateur syst&egrave;me. Pour plus d'informations, voir <a href="#cipher_help">Modification des codes SSL</a>. </li></ul>

<p><b>Remarque importante concernant TLS :</b> Certains serveurs qui ne mettent pas correctement en &oelig;uvre SSL ne peuvent pas n&eacute;gocier la prise de contact SSL avec le logiciel client (tel que le navigateur) qui prend en charge TLS. Ces serveurs sont dits "TLS intol&eacute;rants".
<p>Lorsque l'option Activer TLS du panneau de pr&eacute;f&eacute;rences SSL est s&eacute;lectionn&eacute;e, le navigateur tente d'utiliser le protocole TLS lorsqu'il &eacute;tablit des connexions prot&eacute;g&eacute;es avec un serveur. Si cette connexion &eacute;choue parce que le serveur est "TLS intol&eacute;rant", le navigateur se replie sur l'utilisation de SSL 3.0.



<p>&nbsp;</p> <a NAME="SSL_Warnings"></a>
<h3>Avertissements SSL</h3>

<p>Il est facile de savoir si le site Web affich&eacute; utilise une connexion chiffr&eacute;e. Dans ce cas, l'ic&ocirc;ne repr&eacute;sentant un cadenas dans l'angle inf&eacute;rieur droit de la fen&ecirc;tre de Navigator est verrouill&eacute;e. Dans le cas contraire, elle est d&eacute;verrouill&eacute;e.</P>

<p>Si vous souhaitez des avertissements suppl&eacute;mentaires, vous pouvez cocher une ou plusieurs des cases d'avertissement dans le panneau de pr&eacute;f&eacute;rences SSL. Certains trouvent ces avertissements g&ecirc;nants.

<p>Pour activer des avertissements de Navigator, cochez les cases correspondantes :
</P>

<ul>
	<LI><b>Chargement d'une page qui prend en charge le chiffrement :</b> S&eacute;lectionnez cet avertissement si vous souhaitez obtenir un rappel chaque fois que vous chargez une page qui prend en charge le chiffrement.
	<LI><b>Chargement d'une page qui utilise un chiffrement de bas niveau :</b> S&eacute;lectionnez cet avertissement si vous souhaitez obtenir un rappel chaque fois que vous chargez une page qui prend en charge un chiffrement de bas niveau. Le chiffrement de bas niveau est le plus faible utilisant une cl&eacute; de 40 bits.
	<LI><b>Sortie d'une page qui prend en charge le chiffrement :</b> S&eacute;lectionnez cet avertissement si vous souhaitez obtenir un rappel chaque fois que vous quittez une page qui prend en charge le chiffrement pour passer &agrave; une autre qui ne le prend pas en charge.
	<LI><b>Envoi des donn&eacute;es de formulaire d'une page non chiffr&eacute;e &agrave; une page non chiffr&eacute;e :</b> S&eacute;lectionnez cet avertissement si vous souhaitez obtenir un rappel lorsque vous envoyez des donn&eacute;es sur une connexion non chiffr&eacute;e. Si vous envoyez des informations non chiffr&eacute;es sur Internet, elles peuvent ais&eacute;ment &ecirc;tre intercept&eacute;es par d'autres personnes.
	<LI><b>Afficher une page semi-chiffr&eacute;e :</b> S&eacute;lectionnez cet avertissement si vous souhaitez &ecirc;tre alert&eacute; chaque fois que vous affichez une page qui comprend des informations qui ne sont pas chiffr&eacute;es.
</ul>

<p>Pour des d&eacute;finitions succinctes, cliquez sur <a href="glossary.html#authentication">authentification</a>, <a href="glossary.html#encryption">chiffrement</a> ou <a href="glossary.html#certificate">certificat</a>.</P>


<hr> <a NAME="cipher_help"></a> <a NAME="SSL:ciphersIDX"></a> <a NAME="encryption:technologiesIDX"></a> <a NAME="encryption_technologiesSDX"></a>
<h2>Modification des codes SSL</h2>
<p>Cette section d&eacute;crit l'utilisation de la bo&icirc;te de dialogue Modifier les chiffres. Si cette bo&icirc;te de dialogue n'est pas affich&eacute;e, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur SSL. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Cliquez sur le bouton Modifier les chiffres.
</ol>

<p>La bo&icirc;te de dialogue Modifier les chiffres permet de s&eacute;lectionner ou d&eacute;selectionner des codes ou <a href="glossary.html#cryptographic_algorithm">algorithmes cryptographiques</a>. Consultez votre administrateur syst&egrave;me avant toute modification de ces param&egrave;tres.

<p>Chaque case correspond &agrave; une suite de codage (un ensemble d'algorithmes cryptographiques).

<p>Pour plus d'informations sur les codes et le chiffrement, consultez les documents en ligne suivants :

<ul>
	<li><a href="http://developer.netscape.com/docs/manuals/security/pkin/index.htm" target="_blank">Introduction to Public-Key Cryptography</a>
	<li><a href="http://developer.netscape.com/docs/manuals/security/sslin/index.htm" target="_blank">Introduction to SSL</a>
	<li><a href="http://www.mozilla.org/projects/security/pki/nss/nss-3.4/nss-3.4-algorithms.html" target="_blank">Encryption Technologies Available in NSS 3.4</a>.
</ul>

<p>&nbsp;

<hr>
<p><i>20 juin 2002</i></body>
<p>Copyright &copy; 1994-2000 Netscape Communications Corporation.</p>

</body>
</html>
