<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Utilisation de certificats</title>

<link rel="stylesheet" href="chrome://help/locale/content_style.css" type="text/css">

</head>

<body bgcolor="white"> <div class="boilerplate">Ce document est fourni par Netscape pour information uniquement. Il peut vous aider &agrave; prendre certaines mesures destin&eacute;es &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations personnelles sur Internet. Ce document ne couvre cependant pas tous les aspects de la confidentialit&eacute; et de la s&eacute;curit&eacute; en ligne, et ne constitue pas une recommandation de la part de Netscape concernant ce qui constitue une protection ad&eacute;quate de la confidentialit&eacute; et de la s&eacute;curit&eacute; sur Internet.</div>

<hr> <a NAME="certificates:usingIDX"></a> <a NAME="using_certs_first"></a> <a NAME="certificates:aboutIDX"></a> <a NAME="identificationSDX"></a> <a NAME="ID_cardSDX"></a> <a NAME="identitySDX"></a> <a NAME="digital_IDSDX"></a>
<h1>Utilisation de certificats</h1>

<p>Le certificat est l'&eacute;quivalent num&eacute;rique d'une carte d'identit&eacute;. Tout comme vous pouvez avoir plusieurs cartes d'identification &agrave; des fins diverses, telles qu'un permis de conduire, une carte d'identification d'employ&eacute; ou une carte de cr&eacute;dit, vous pouvez disposer de plusieurs certificats qui vous identifient pour diff&eacute;rentes raisons.</p>

<P>Cette section explique comment effectuer les op&eacute;rations li&eacute;es aux certificats.</p>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=350>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#using_certs_get">Obtention de votre propre certificat</a></p>
<p><a href="#using_certs_info">V&eacute;rification de la s&eacute;curit&eacute; d'une page Web</a></p>
<p><a href="#using_certs_manage">Gestion des certificats</a></p>
<p><a href="#using_certs_devices">Gestion des cartes &agrave; puce et autres dispositifs de s&eacute;curit&eacute;</a></p>
<p><a href="#using_certs_ssl">Gestion des avertissements et des param&egrave;tres SSL</a></p>
<p><a href="#using_certs_validation">Contr&ocirc;le de la validation</a></p>
<p><a href="#using_certs_settings">Param&egrave;tres de certificat</a></p>
</td>
</tr>
</table>


<p>&nbsp;</p>
<hr> <a NAME="certificates:gettingIDX"></a> <a NAME="using_certs_get"></a>
<h1>Obtention de votre propre certificat</h1>

<P>De m&ecirc;me qu'une carte de cr&eacute;dit ou un permis de conduire, un certificat est une forme d'identification que vous pouvez utiliser pour vous identifier sur Internet et d'autres r&eacute;seaux. A l'instar des autres identifications personnelles utilis&eacute;es couramment, un certificat est g&eacute;n&eacute;ralement &eacute;mis par une organisation jouissant d'une autorit&eacute; reconnue pour &eacute;mettre cette identification. Une organisation qui &eacute;met des certificats est appel&eacute;e une <b>autorit&eacute; de certification.</b>

<p>Vous pouvez obtenir des certificats qui vous identifient aupr&egrave;s d'autorit&eacute;s de certification, d'administrateurs syst&egrave;me ou d'autorit&eacute; de certification sp&eacute;ciales de votre organisation, ou encore de sites Web offrant des services sp&eacute;cialis&eacute;s qui exigent un moyen d'identification plus fiable que vos nom et mot de passe.

<p>De m&ecirc;me que les exigences li&eacute;es &agrave; un permis de conduire varient en fonction du type du v&eacute;hicule que vous souhaitez conduire, les exigences pour l'obtention d'un certificat changent selon son usage. Dans certains cas, pour obtenir un certificat, il peut suffire d'acc&eacute;der &agrave; un site Web, d'introduire quelques informations personnelles et de t&eacute;l&eacute;charger automatiquement le certificat dans votre navigateur. Dans d'autres cas, il peut s'av&eacute;rer n&eacute;cessaire de suivre des proc&eacute;dures plus complexes.

<p>Vous pouvez obtenir un certificat aujourd'hui en visitant l'URL d'une autorit&eacute; de certification et en suivant les instructions pr&eacute;sent&eacute;es &agrave; l'&eacute;cran. Pour obtenir une liste des autorit&eacute;s de certification, voir le document en ligne <a href="https://certs.netscape.com/" TARGET="_blank">Certificats client<a href="https://certs.netscape.com/" TARGET="_blank">. </p>

<p>D&egrave;s que vous obtenez un certificat, il est automatiquement stock&eacute; dans un <a href="glossary.html#security_device">dispositif de s&eacute;curit&eacute;</a>. Votre navigateur int&egrave;gre son propre dispositif de s&eacute;curit&eacute; logiciel. Un dispositif de s&eacute;curit&eacute; peut toutefois &eacute;galement &ecirc;tre mat&eacute;riel, comme une carte &agrave; puce.</p>

<p>Comme un permis de conduire ou une carte de cr&eacute;dit, un certificat est un moyen d'identification important qui peut faire l'objet d'abus s'il tombe en de mauvaises mains. Lorsque vous avez obtenu un certificat qui vous identifie, vous devez le prot&eacute;ger de deux mani&egrave;res : en le sauvegardant et en d&eacute;finissant votre <a href="glossary.html#master_password">mot de passe principal</a>.

<p>Lorsque vous obtenez un certificat pour la premi&egrave;re fois, vous pouvez &ecirc;tre invit&eacute; &agrave; le sauvegarder. Si vous n'avez pas encore d&eacute;fini de mot de passe principal, il vous sera demand&eacute; de le faire.

<p>Pour obtenir des informations d&eacute;taill&eacute;es sur la sauvegarde d'un certificat et la d&eacute;finition de votre mot de passe principal, voir <a href="certs_help.html#My_Certificates">Vos certificats</a>.


<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p>
<hr><a NAME="security:checking_for_a_web_pageIDX"></a> <a NAME="using_certs_info"></a> <a NAME="lock_iconSDX"></a> <a NAME="lock_iconIDX"></a> <a NAME="broken_lock_iconSDX"></a> <a NAME="open_lock_iconSDX"></a> <a NAME="encryption_status_of_web_pageSDX"></a> <a NAME="encryption:status_of_web_pageIDX"></a>
<h1>V&eacute;rification de la s&eacute;curit&eacute; d'une page Web</h1>

<p>Lorsque vous visualisez une page Web, l'ic&ocirc;ne repr&eacute;sentant un cadenas, situ&eacute;e dans le coin inf&eacute;rieur droit de la fen&ecirc;tre, vous indique si le contenu de la page a &eacute;t&eacute; prot&eacute;g&eacute; par <a href="glossary.html#encryption">chiffrement</a> lors de son t&eacute;l&eacute;chargement sur votre ordinateur&nbsp;:</p>


<table summary="lock icons"> <tr><td>&nbsp;</td><td><img alt="ic&ocirc;ne d'un cadenas ferm&eacute;"src="chrome://communicator/skin/icons/lock-secure.gif">&nbsp;</td><td>Un cadenas ferm&eacute; signifie que la page &eacute;tait prot&eacute;g&eacute;e par chiffrement lors de son t&eacute;l&eacute;chargement.</td></tr>
	<tr><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
	<tr><td>&nbsp;</td><td><img alt="ic&ocirc;ne d'un cadenas ouvert" src="chrome://communicator/skin/icons/lock-insecure.gif">&nbsp;</td><td>Un cadenas ouvert signifie que la page n'&eacute;tait pas prot&eacute;g&eacute;e par chiffrement lors de son t&eacute;l&eacute;chargement. </td></tr>
	<tr><td>&nbsp;</td><td>&nbsp;</td><td>&nbsp;</td></tr>
	<tr><td>&nbsp;</td><td><img alt="ic&ocirc;ne d'un cadenas cass&eacute;"src="chrome://communicator/skin/icons/lock-broken.gif">&nbsp;</td><td>Un cadenas cass&eacute; indique que quelques-uns ou tous les &eacute;l&eacute;ments d'une page n'&eacute;taient pas prot&eacute;g&eacute;s par chiffrement lors du t&eacute;l&eacute;chargement, et ce, m&ecirc;me si la structure HTML de la page &eacute;tait chiffr&eacute;e.</td></tr>
</table>

<p>Pour plus d'informations sur l'&eacute;tat de chiffrement d'une page lors de son t&eacute;l&eacute;chargement, vous pouvez cliquer sur l'ic&ocirc;ne du cadenas (ou ouvrir le menu Afficher, s&eacute;lectionner Infos page et cliquer sur l'onglet S&eacute;curit&eacute;).

<p>L'onglet S&eacute;curit&eacute; de la commande Infos page pr&eacute;sente deux types d'informations :
<ul>
	<li>La partie sup&eacute;rieure indique si le site Web d'o&ugrave; provient la page a &eacute;t&eacute; v&eacute;rifi&eacute;. Pour plus d'informations sur la v&eacute;rification des certificats, consultez la rubrique <a href="#using_certs_validation">Contr&ocirc;le de la validation</a>.</li>
	<li>La partie inf&eacute;rieure indique si le contenu de la page en cours de visualisation est prot&eacute;g&eacute; par chiffrement lors de son transfert sur le r&eacute;seau.</li>
</ul>
<p><b>Important&nbsp;:</b> L'ic&ocirc;ne du cadenas d&eacute;crit uniquement l'&eacute;tat du chiffrement de la page au moment o&ugrave; celle-ci est t&eacute;l&eacute;charg&eacute;e sur votre ordinateur. Pour &ecirc;tre inform&eacute; avant d'envoyer ou de recevoir des informations non chiffr&eacute;es, s&eacute;lectionnez les options d'avertissement SSL appropri&eacute;es. Pour plus d'informations &agrave; ce sujet, consultez la rubrique <a href="ssl_help.html">Pr&eacute;f&eacute;rences de confidentialit&eacute; et s&eacute;curit&eacute; - SSL</a>.



<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<p>&nbsp;</p>
<hr> <a NAME="using_certs_manage"></a><a NAME="certificates:managingIDX"></a>
<h1>Gestion des certificats</h1>

<p>Le Gestionnaire de certificats permet de g&eacute;rer les certificats dont vous disposez. Les certificats peuvent &ecirc;tre stock&eacute;s sur le disque dur de votre ordinateur ou sur des <a href="glossary.html#smart_card">cartes &agrave; puce</a> ou d'autres dispositifs de s&eacute;curit&eacute; connect&eacute;s &agrave; votre ordinateur.</p>

<p>Pour ouvrir le Gestionnaire de certificats :

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Dans la section G&eacute;rer les certificats, cliquez sur G&eacute;rer les certificats. Le Gestionnaire de certificats s'affiche.
</ol>

<p><table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=370>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a HREF="#using_certs_my">Gestion des certificats qui vous identifient</a></p>
<p><a HREF="#using_certs_others">Gestion des certificats qui identifient d'autres personnes</a></p>
<p><a HREF="#using_certs_sites">Gestion des certificats qui identifient des sites Web</a></p>
<p><a HREF="#using_certs_cas">Gestion des certificats qui identifient les autorit&eacute;s de certification</a></p>
</td>
</tr>
</table>

<p>&nbsp;</p> <a NAME="using_certs_my"></a><a NAME="certificates:your_ownIDX"></a>
<H2>Gestion des certificats qui vous identifient</H2>


<p>D&egrave;s la premi&egrave;re ouverture du Gestionnaire de certificats, vous noterez les diff&eacute;rents onglets dans la partie sup&eacute;rieure de sa fen&ecirc;tre. Le premier onglet, Vos certificats, pr&eacute;sente les certificats dont votre navigateur dispose pour vous identifier. Vos certificats sont repris sous les noms des organisations qui les ont &eacute;mis.

<p>Pour ex&eacute;cuter une action sur un ou plusieurs certificats, cliquez sur l'entr&eacute;e correspondant &agrave; ce certificat (ou Ctrl-cliquez pour en s&eacute;lectionner plusieurs), puis cliquez sur le bouton Afficher, Sauvegarder ou Supprimer. Chacun de ces boutons fait appara&icirc;tre une autre fen&ecirc;tre qui permet d'ex&eacute;cuter l'action. Cliquez sur le bouton Aide dans n'importe quelle fen&ecirc;tre pour obtenir plus informations sur l'utilisation de cette fen&ecirc;tre.

<p>Les boutons suivants de la zone Vos certificats n'exigent pas qu'un certificat soit s&eacute;lectionn&eacute;. Ces boutons servent &agrave; effectuer les actions suivantes :
<ul>
	<li><b>Importer.</b> Cliquez sur ce bouton pour importer un certificat sauvegard&eacute; ou transf&eacute;r&eacute; pr&eacute;c&eacute;demment d'une machine &agrave; une autre.

	<li><b>Tout sauvegarder.</b> Cliquez sur ce bouton pour sauvegarder tous vos certificats stock&eacute;s dans le <a href="glossary.html#software_security_device">Dispositif de s&eacute;curit&eacute; logiciel</a>.

</ul>

<p><b>Les certificats enregistr&eacute;es sur des cartes &agrave; puce ne peuvent pas &ecirc;tre sauvegard&eacute;s.</b> Que vous s&eacute;lectionniez certains de vos certificats et cliquiez sur Sauvegarder, ou que vous cliquiez sur Tout sauvegarder, le fichier de sauvegarde obtenu n'inclura aucun des certificats stock&eacute;s sur des cartes &agrave; puce ou d'autres dispositifs de s&eacute;curit&eacute; externes. Seuls peuvent &ecirc;tre sauvegard&eacute;s les certificats stock&eacute;s sur le dispositif de s&eacute;curit&eacute; logiciel interne.


<p>Pour plus d'informations sur ces actions, consultez la rubrique <a href="certs_help.html#My_Certificates">Vos certificats</a>.


<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p> <a NAME="using_certs_others"></a><a NAME="certificates:other peopleIDX"></a>
<H2>Gestion des certificats qui identifient d'autres personnes</H2>

<p><p>Lorsque vous composez un message, vous avez la possibilit&eacute; d'y associer votre signature num&eacute;rique. Une <a href="glossary.html#digital_signature">signature num&eacute;rique</a> permet aux destinataires du message de v&eacute;rifier sa provenance et de s'assurer qu'il n'a subi aucune falsification depuis son envoi.

<p>Chaque fois que vous envoyez un message sign&eacute; num&eacute;riquement, votre certificat de chiffrement y est inclus. Ce certificat permet aux destinataires du message de vous envoyer des messages chiffr&eacute;s.

<p>D&egrave;s lors, l'une des mani&egrave;res les plus simples d'obtenir le certificat de chiffrement d'une autre personne consiste &agrave; lui demander de vous envoyer un message sign&eacute; num&eacute;riquement. Le Gestionnaire de certificats enregistre automatiquement les certificats des autres personnes re&ccedil;us de cette mani&egrave;re.

<p>Pour visualiser les certificats identifiant d'autres personnes qui sont disponibles dans le Gestionnaire de certificats, cliquez sur l'onglet Certificats d'autres personnes, en haut de la page du Gestionnaire de certificats. Vous pouvez envoyer des messages chiffr&eacute;s &agrave; toute personne disposant d'un certificat valide dans la liste. Les certificats sont repris sous les noms des organisations qui les ont &eacute;mis.

<p>Pour ex&eacute;cuter une action sur un ou plusieurs certificats, cliquez sur l'entr&eacute;e correspondant &agrave; ce certificat (ou Ctrl-cliquez pour en s&eacute;lectionner plusieurs), puis cliquez sur le bouton Afficher ou Supprimer. Chacun de ces boutons fait appara&icirc;tre une autre fen&ecirc;tre qui permet d'ex&eacute;cuter l'action. Cliquez sur le bouton Aide dans n'importe quelle fen&ecirc;tre pour obtenir plus informations sur l'utilisation de cette fen&ecirc;tre.

<p>Pour plus d'informations, consultez la rubrique <a href="certs_help.html#Other_Peoples_Certificates">Certificats d'autres personnes</a>.


<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>



<p>&nbsp;</p> <a NAME="using_certs_sites"></a><a NAME="certificates:web_siteIDX"></a>
<H2>Gestion des certificats qui identifient des sites Web</H2>

<p>Certains sites Web utilisent des certificats pour s'identifier. Cette identification est n&eacute;cessaire avant que le site Web puisse chiffrer les informations transf&eacute;r&eacute;es entre le site et votre ordinateur (ou vice versa), afin que personne ne puisse lire les donn&eacute;es en transit.

<p>Si l'URL d'un site Web commence par <tt>https://</tt>, le site Web a un certificat. Si vous visitez un site Web de ce type et si son certificat a &eacute;t&eacute; &eacute;mis par une autorit&eacute; de certification que le Gestionnaire de certificats ne conna&icirc;t pas ou &agrave; laquelle il ne fait pas confiance, vous serez invit&eacute; &agrave; confirmer l'acceptation du certificat du site Web. Lorsque vous acceptez le certificat d'un nouveau site Web, le Gestionnaire de certificats l'ajoute &agrave; sa liste de certificats de site Web.

<p>Pour afficher tous les certificats de site Web disponibles dans votre navigateur, cliquez sur l'onglet Sites Web en haut de la fen&ecirc;tre Gestionnaire de certificats.

<p>Pour ex&eacute;cuter une action sur un ou plusieurs certificats de site Web, cliquez sur l'entr&eacute;e correspondant &agrave; ce certificat (ou Maj-cliquez pour en s&eacute;lectionner plusieurs), puis cliquez sur le bouton Afficher, Modifier ou Supprimer. Chacun de ces boutons fait appara&icirc;tre une autre fen&ecirc;tre qui permet d'ex&eacute;cuter l'action correspondante.

<p>Le bouton Modifier permet de pr&eacute;ciser si votre navigateur fera &agrave; l'avenir confiance aux certificats de site Web s&eacute;lectionn&eacute;s.

<p>Pour plus d'informations, consultez la rubrique <a href="certs_help.html#Web_Site_Certificates">Certificats de sites Web</a>.



<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p> <a NAME="using_certs_cas"></a><a NAME="certificates:certificate_authorityIDX"></a>
<H2>Gestion des certificats qui identifient les autorit&eacute;s de certification</H2>

<p>A l'instar des autres formes d'ID utilis&eacute;es couramment, un certificat est &eacute;mis par une organisation jouissant d'une autorit&eacute; reconnue pour &eacute;mettre cette identification. Une organisation qui &eacute;met des certificats est appel&eacute;e une <a href="glossary.html#certificate_authority_(CA)">autorit&eacute; de certification</a>. Un certificat qui identifie une autorit&eacute; de certification est appel&eacute; un certificat d'autorit&eacute; de certification.

<p> Le Gestionnaire de certificat dispose g&eacute;n&eacute;ralement de nombreux certificats d'autorit&eacute; de certification. Ces certificats lui permettent de reconna&icirc;tre et d'utiliser les certificats &eacute;mis par les autorit&eacute;s de certification correspondantes. Toutefois, la pr&eacute;sence d'un certificat d'autorit&eacute; de certification dans cette liste <i>ne</i> garantit <i>pas</i> que les certificats qu'elle utilise sont fiables. C'est &agrave; vous ou &agrave; votre administrateur syst&egrave;me qu'il incombe de d&eacute;cider &agrave; quels types de certificats faire confiance en fonction de vos besoins en mati&egrave;re de s&eacute;curit&eacute;.

<p>Pour afficher tous les certificats d'autorit&eacute; de certification disponibles dans votre navigateur, cliquez sur l'onglet Autorit&eacute;s en haut de la fen&ecirc;tre Gestionnaire de certificats.

<p>Pour ex&eacute;cuter une action sur un ou plusieurs certificats d'autorit&eacute; de certification, cliquez sur l'entr&eacute;e correspondant &agrave; ce certificat (ou Ctrl-cliquez pour en s&eacute;lectionner plusieurs), puis cliquez sur le bouton Afficher, Modifier ou Supprimer. Chacun de ces boutons fait appara&icirc;tre une autre fen&ecirc;tre qui permet d'ex&eacute;cuter l'action. Cliquez sur le bouton Aide dans n'importe quelle fen&ecirc;tre pour obtenir plus informations sur l'utilisation de cette fen&ecirc;tre.

<p>Le bouton Modifier permet d'afficher et de contr&ocirc;ler les param&egrave;tres de confiance de chaque certificat. Les param&egrave;tres de confiance d'un certificat d'autorit&eacute; de certification permettent de sp&eacute;cifier &agrave; quels types de certificats &eacute;mis par cette autorit&eacute; de certification vous souhaitez faire confiance.

<p>Pour plus d'informations, consultez la rubrique <a href="certs_help.html#CA_Certificates">Autorit&eacute;s</a>.

<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<p>&nbsp;</p>
<hr> <a NAME="using_certs_devices"></a> <a NAME="smart_cards:managingIDX"></a> <a NAME="Device_Manager:usingIDX"></a> <a NAME="security_devices:managingIDX"></a> <a NAME="security_modules:managingIDX"></a> <a NAME="tokensSDX"></a>
<h1>Gestion des cartes &agrave; puce et autres dispositifs de s&eacute;curit&eacute;</h1>

<p>Une carte &agrave; puce est un petit p&eacute;riph&eacute;rique, g&eacute;n&eacute;ralement de la taille d'une carte de cr&eacute;dit, contenant un microprocesseur et capable de stocker des informations concernant votre identit&eacute; (telles que vos <a href="glossary.html#private_key">cl&eacute;s priv&eacute;es</a> et <a href="glossary.html#certificate">certificats</a>) et d'effectuer des op&eacute;rations cryptographiques.

<p>Pour utiliser une carte &agrave; puce, il est g&eacute;n&eacute;ralement n&eacute;cessaire de disposer d'un lecteur de carte &agrave; puce (un &eacute;l&eacute;ment mat&eacute;riel) connect&eacute; &agrave; votre ordinateur, ainsi que d'un logiciel sur ce dernier pour commander le lecteur.

<p>Une carte &agrave; puce n'est qu'un exemple de dispositif de s&eacute;curit&eacute;. Un dispositif de s&eacute;curit&eacute; (parfois appel&eacute; jeton) est un dispositif mat&eacute;riel ou logiciel qui assure des services cryptographiques et stocke des informations concernant votre identit&eacute;. Utilisez le Gestionnaire de dispositifs pour employer des cartes &agrave; puce et autres dispositifs de s&eacute;curit&eacute;.
</p>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#using_certs_devices_about">A propos des dispositifs et des modules de s&eacute;curit&eacute;</a></p>
<p><a href="#using_certs_devices_devices">Utilisation de dispositifs de s&eacute;curit&eacute;</a></p>
<p><a href="#using_certs_devices_modules">Utilisation de modules de s&eacute;curit&eacute;</a></p>
<p><a href="#using_certs_devices_fips">Activation du mode FIPS</a></p>
</td>
</tr>
</table>


<p>&nbsp;</p> <a NAME="PKCS#11_and smart_cardsSDX"></a> <a NAME="PKCS_#11_and smart_cardsSDX"></a> <a NAME="PKCS_#11IDX"></a> <a NAME="using_certs_devices_about"></a><a NAME="security_modules:aboutIDX"></a> <a NAME="Device_Manager:aboutIDX"></a> <a NAME="security_devices:aboutIDX"></a>
<h2>A propos des dispositifs et des modules de s&eacute;curit&eacute;</h2>

<p>Le Gestionnaire de dispositifs affiche une fen&ecirc;tre qui pr&eacute;sente la liste des dispositifs de s&eacute;curit&eacute; disponibles. Vous pouvez utiliser le Gestionnaire de dispositifs pour g&eacute;rer tous les dispositifs de s&eacute;curit&eacute;, y compris les cartes &agrave; puce, qui prennent en charge la norme de cryptographie &agrave; cl&eacute; publique (PKCS) #11.

<p>Un <a href="glossary.html#PKCS_11_module">module PKCS #11</a> (parfois appel&eacute; module de s&eacute;curit&eacute;) contr&ocirc;le un ou plusieurs dispositifs de s&eacute;curit&eacute; de la m&ecirc;me mani&egrave;re qu'un programme de gestion de logiciel contr&ocirc;le un p&eacute;riph&eacute;rique externe tel qu'une imprimante ou un modem. Si vous installez une carte &agrave; puce, vous devez installer le module PKCS #11 correspondant &agrave; la carte &agrave; puce sur votre ordinateur ainsi que connecter le lecteur de carte &agrave; puce.

<p>Par d&eacute;faut, le Gestionnaire de dispositifs contr&ocirc;le deux modules PKCS #11 internes qui g&egrave;rent trois dispositifs de s&eacute;curit&eacute; :

<ul>
	<li><b>Netscape Internal PKCS #11&nbsp; Module&nbsp;:</b> contr&ocirc;le deux dispositifs de s&eacute;curit&eacute; :</li>
	<ul>
		<li><b>Services de cryptographie g&eacute;n&eacute;riques&nbsp;:</b> un dispositif de s&eacute;curit&eacute; sp&eacute;cial qui effectue toutes les op&eacute;rations cryptographiques requises par le Netscape Internal PKCS #11 Module.
		<li><b>Dispositif de s&eacute;curit&eacute; logiciel</b> stocke vos certificats et cl&eacute;s qui ne sont pas stock&eacute;s sur des dispositifs de s&eacute;curit&eacute; externes, y compris tous les certificats d'autorit&eacute; de certification que vous avez peut-&ecirc;tre install&eacute;s en plus de ceux fournis avec le navigateur.
	</ul>
	<li><b>Builtin Roots Module&nbsp; (Module racine int&eacute;gr&eacute;)&nbsp;:</b> contr&ocirc;le un dispositif de s&eacute;curit&eacute; sp&eacute;cial appel&eacute; "Builtin Object Token". Ce dispositif de s&eacute;curit&eacute; stocke les <a href="glossary.html#CA_certificate">certificats d'autorit&eacute; de certification</a> par d&eacute;faut fournis avec le navigateur.

</ul>


<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p> <a NAME="using_certs_devices_devices"></a>
<h2>Utilisation de dispositifs de s&eacute;curit&eacute;</h2>

<p>Le Gestionnaire de dispositifs vous permet d'effectuer les op&eacute;rations suivantes sur les dispositifs de s&eacute;curit&eacute;. Pour ouvrir le Gestionnaire de dispositifs, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Dans le panneau Certificats, cliquez sur G&eacute;rer les dispositifs de s&eacute;curit&eacute;.
</ol>


<p>Le Gestionnaire de dispositifs &eacute;num&egrave;re en gras chaque module PKCS #11 disponible, et les dispositifs de s&eacute;curit&eacute; g&eacute;r&eacute;s par chaque module en dessous de son nom.

<p>Lorsque vous s&eacute;lectionnez un dispositif de s&eacute;curit&eacute;, des informations le concernant s'affichent au centre de la fen&ecirc;tre du Gestionnaire de dispositifs et certains boutons sur la droite de la fen&ecirc;tre deviennent disponibles. Par exemple, si vous s&eacute;lectionnez Dispositif de s&eacute;curit&eacute; logiciel, vous pouvez effectuer les actions suivantes :

<ul>
	<li>Cliquez sur Ouverture de session ou Cl&ocirc;ture de session pour vous connecter au dispositif de s&eacute;curit&eacute; logiciel ou vous en d&eacute;connecter. Si vous ouvrez une session, vous serez invit&eacute; &agrave; fournir le mot de passe principal du dispositif. Vous devez &ecirc;tre connect&eacute; &agrave; un dispositif de s&eacute;curit&eacute; avant que votre navigateur puisse l'utiliser pour assurer des services cryptographiques.
	<li>Cliquez sur Changer le mot de passe pour modifier le mot de passe principal du dispositif.
</ul>


<p>Vous pouvez effectuer ces op&eacute;rations sur la plupart des dispositifs. Vous ne pouvez toutefois pas les effectuer sur "Builtin Object Token" ni sur Services de cryptographie g&eacute;n&eacute;riques, qui sont des dispositifs sp&eacute;ciaux devant normalement &ecirc;tre disponibles en permanence.

<p>Pour plus d'informations, consultez la rubrique <a href="certs_help.html#Security_Devices">Gestionnaires de dispositifs</a>.


<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p> <a NAME="using_certs_devices_modules"></a>
<h2>Utilisation de modules de s&eacute;curit&eacute;</h2>


<p>Pour utiliser une carte &agrave; puce ou un autre dispositif de s&eacute;curit&eacute; externe, vous devez au pr&eacute;alable installer le logiciel du module sur votre ordinateur et, au besoin, connecter le mat&eacute;riel associ&eacute;. Suivez les instructions fournies avec le mat&eacute;riel.

<p>Une fois un nouveau module install&eacute; sur votre ordinateur, proc&eacute;dez comme suit pour le charger :

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Dans le panneau Certificats, cliquez sur G&eacute;rer les dispositifs de s&eacute;curit&eacute;.
	<li>Cliquez sur Charger.
	<li>Dans la bo&icirc;te de dialogue Charger module PKCS #11, cliquez sur le bouton Parcourir, recherchez le fichier du module et cliquez sur Ouvrir.
	<li>Indiquez le nom du module dans le champ Nom du module et cliquez sur OK.
</ol>

<p>Le nouveau module appara&icirc;t alors dans la liste de modules avec le nom que vous lui avez attribu&eacute;.

<p>Pour d&eacute;charger un module PKCS #11, s&eacute;lectionnez son nom et cliquez sur D&eacute;charger.


<p>&nbsp;</p> <a NAME="using_certs_devices_fips"></a><a NAME="FIPS_modeIDX"></a>
<h2>Activation du mode FIPS</h2>

<p>Federal Information Processing Standards Publications (FIPS PUBS) 140-1 est une norme du gouvernement am&eacute;ricain relative &agrave; la mise en &oelig;uvre de modules cryptographiques, c'est-&agrave;-dire du mat&eacute;riel ou des logiciels chiffrant et d&eacute;chiffrant des donn&eacute;es ou effectuant d'autres op&eacute;rations cryptographiques (comme la cr&eacute;ation ou la v&eacute;rification de signatures num&eacute;riques). De nombreux produits vendus au gouvernement am&eacute;ricain doivent respecter une ou plusieurs des normes FIPS.

<p>Pour activer le mode FIPS pour le navigateur, vous devez utiliser le Gestionnaire de dispositifs :

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Certificats. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Dans le panneau Certificats, cliquez sur G&eacute;rer les dispositifs de s&eacute;curit&eacute;.
	<li>Cliquez sur le bouton Activer FIPS. Lorsque FIPS est activ&eacute;, le nom NSS Internal PKCS #11 Module devient NSS Internal FIPS PKCS #11 Module et le bouton Activer FIPS devient D&eacute;sactiver FIPS.
</ol>
<p>Pour d&eacute;sactiver le mode FIPS, cliquez sur D&eacute;sactiver FIPS.</P>

<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p>
<hr> <a NAME="using_certs_ssl"></a>
<h1>Gestion des avertissements et des param&egrave;tres SSL</h1>

<p>Le protocole SSL (Secure Sockets Layer) permet &agrave; votre ordinateur d'&eacute;changer des informations avec d'autres sur Internet sous forme chiffr&eacute;e&nbsp;; cela signifie que les informations sont cod&eacute;es pendant leur transit de sorte que personne d'autre ne puisse les comprendre. SSL s'utilise &eacute;galement pour identifier des ordinateurs sur Internet par le biais de <a href="glossary.html#certificate">certificats</a>.

<p>Le protocole TLS (Transport Layer Security) est un nouveau standard fond&eacute; sur SSL. Par d&eacute;faut, le navigateur prend en charge &agrave; la fois SSL et TLS. Cette approche fonctionne pour la plupart des utilisateurs, parce qu'il garantit que le navigateur fonctionnera avec pratiquement tous les autres logiciels existants sur Internet qui prennent en charge une version de SSL ou TLS.

<p>N&eacute;anmoins, dans certaines circonstances, des administrateurs syst&egrave;me ou d'autres responsables peuvent souhaiter ajuster les param&egrave;tres SSL afin de les optimiser pour des besoins de s&eacute;curit&eacute; sp&eacute;cifiques ou pour tenir compte de bogues dans des logiciels plus anciens.

<p>Vous ne devez pas ajuster les param&egrave;tres SSL de votre navigateur, sauf si vous &ecirc;tes certain de ce que vous faites ou si vous &ecirc;tes assist&eacute; de quelqu'un disposant des connaissances requises. Si vous devez les ajuster pour quelque raison que ce soit, proc&eacute;dez comme suit :

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, s&eacute;lectionnez SSL. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
</ol>

<p>Pour plus d'informations, consultez la rubrique <a href="ssl_help.html">Param&egrave;tres SSL</a>.


</p>

<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>

<p>&nbsp;</p>
<hr> <a NAME="using_certs_validation"></a> <a NAME="certificates:validationIDX"></a> <a NAME="validation,_of_certificates:aboutIDX"></a>

<h1>Contr&ocirc;le de la validation</h1>

<p>Comme indiqu&eacute; plus haut dans la section <a href="#using_certs_get">Obtention de votre propre certificat</a>, de m&ecirc;me qu'un un permis de conduire, un certificat est une forme d'identification que vous pouvez utiliser pour vous identifier sur Internet et d'autres r&eacute;seaux. Toutefois, &eacute;galement &agrave; l'instar d'un permis de conduire, un certificat peut avoir expir&eacute; ou &ecirc;tre non valide pour quelque autre raison. Votre navigateur doit donc s'assurer de la validit&eacute; de tout certificat avant de lui faire confiance &agrave; des fins d'identification.

<p>Cette section indique comment le Gestionnaire de certificats valide les certificats et comment contr&ocirc;ler ce processus. Pour comprendre le processus, vous devez avoir certaines connaissances de la <a href="glossary.html#public-key_cryptography">cryptographie de cl&eacute; publique</a>. Si vous n'&ecirc;tes pas familiaris&eacute; avec l'utilisation de certificats, consultez votre administrateur syst&egrave;me avant de tenter de modifier les param&egrave;tres de validation de certificat de votre navigateur.<p>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=324>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#How_Certificate_Validation_Works">Fonctionnement de la validation</a></p>
<p><a href="#Managing_CRLs">Gestion des CRL</a></p>
<p><a href="#Configuring_Certificate_Manager_for_OCSP">Configuration OCSP</a></p>
<p><a href="#validation_help.html">Param&egrave;tres de validation</a></p>
</td>
</tr>
</table>
<p>

<p>&nbsp;</p> <a name="How_Certificate_Validation_Works"></a> <a NAME="OCSP:aboutIDX"></a> <a NAME="CRLs:aboutIDX"></a> <a NAME="validation:aboutIDX"></a>
<h2>Fonctionnement de la validation</h2>

<p>Chaque fois que vous utilisez ou affichez un certificat stock&eacute; par le Gestionnaire de certificats, la validation du certificat implique plusieurs &eacute;tapes. Au minimum, le Gestionnaire de certificats v&eacute;rifie que la signature num&eacute;rique de l'autorit&eacute; de certification sur le certificat a &eacute;t&eacute; cr&eacute;&eacute;e par une autorit&eacute; de certification dont le propre certificat est (1) pr&eacute;sent dans la liste de certificats d'autorit&eacute; de certification du Gestionnaire de certificats et (2) marqu&eacute; comme fiable pour l'&eacute;mission du type de certificat en cours de v&eacute;rification.

<p>Si le certificat de l'autorit&eacute; de certification n'est pas pr&eacute;sent, la <a href="glossary.html#certificate_chain">cha&icirc;ne de certificats</a> correspondant au certificat de l'autorit&eacute; de certification doit inclure un certificat d'une autorit&eacute; de certification de niveau sup&eacute;rieur qui est pr&eacute;sent et avec la fiabilit&eacute; correcte. Le Gestionnaire de certificats s'assure &eacute;galement que le certificat v&eacute;rifi&eacute; est marqu&eacute; comme fiable dans le r&eacute;pertoire de certificats. Si l'une de ces v&eacute;rifications &eacute;choue, le Gestionnaire de certificats marque le certificat comme non v&eacute;rifi&eacute; et ne reconna&icirc;t pas l'identit&eacute; correspondante.

<p>Un certificat peut passer tous ces tests avec succ&egrave;s et &ecirc;tre n&eacute;anmoins compromis ; par exemple, le certificat peut &ecirc;tre r&eacute;voqu&eacute; parce qu'une personne non autoris&eacute;e a eu acc&egrave;s &agrave; sa cl&eacute; priv&eacute;e. Un certificat compromis peut permettre &agrave; une personne non autoris&eacute;e (ou &agrave; site Web) de pr&eacute;tendre &ecirc;tre le propri&eacute;taire du certificat.

<p>Un des moyens de contrer cette menace consiste &agrave; faire en sorte que le Gestionnaire de certificats consulte une liste de r&eacute;vocation de certificats (CRL) dans le cadre du processus de v&eacute;rification (voir <a href="#Managing_CRLs">Gestion des CRL</a>, ci-dessous). En g&eacute;n&eacute;ral, le t&eacute;l&eacute;chargement d'une liste de r&eacute;vocation de certificats (CRL) dans votre navigateur s'effectue en cliquant sur un lien. Si une liste de r&eacute;vocation est pr&eacute;sente, le Gestionnaire de certificats compare chaque certificat &eacute;mis par la m&ecirc;me autorit&eacute; de certification avec la liste dans le cadre du processus de v&eacute;rification.

<p>La fiabilit&eacute; des listes CRL d&eacute;pend de la fr&eacute;quence &agrave; laquelle elles sont, &agrave; la fois, mises &agrave; jour par un serveur et v&eacute;rifi&eacute;es par un client. Vous pouvez configurer vos <a href="validation_help.html#auto_crl_update_prefs">Pr&eacute;f&eacute;rences de mise &agrave; jour automatique de liste CRL</a> de sorte qu'une liste de r&eacute;vocation de certificats soit mise &agrave; jour &agrave; intervalles r&eacute;guliers avec la version disponible sur le serveur.

<p>Un autre moyen de combattre cette menace consiste &agrave; utiliser un serveur sp&eacute;cial qui prend en charge le protocole OCSP (Online Certificate Status Protocol). Un tel serveur peut r&eacute;pondre aux requ&ecirc;tes de clients relatives &agrave; des certificats sp&eacute;cifiques (voir <a href="#Configuring_Certificate_Manager_for_OCSP">Configuration du protocole OCSP</a>, ci-dessous).

<p>Le serveur, appel&eacute; r&eacute;pondeur OCSP, re&ccedil;oit une liste de r&eacute;vocation (CRL) mise &agrave; jour p&eacute;riodiquement d'une autorit&eacute; de certification qui &eacute;met les certificats &agrave; v&eacute;rifier. Il est possible de configurer le Gestionnaire de certificats pour qu'il envoie une requ&ecirc;te d'&eacute;tat au r&eacute;pondeur OCSP qui confirme alors si le certificat est valide.


<p>&nbsp;</p> <a name="Managing_CRLs"></a><h2>Gestion des CRL</h2>

<p>Une liste de r&eacute;vocation de certificats (CRL) reprend des certificats r&eacute;voqu&eacute;s.  Une <a href="glossary.html#certificate_authority (CA)">autorit&eacute; de certification</a> pourrait, par exemple, r&eacute;voquer un certificat s'il a &eacute;t&eacute; compromis de quelque mani&egrave;re&mdash;de m&ecirc;me qu'une une soci&eacute;t&eacute; de carte de cr&eacute;dit r&eacute;voquerait votre carte si vous signalez qu'elle a &eacute;t&eacute; vol&eacute;e.
</p>

<p>Cette section vous explique comment importer et g&eacute;rer des listes de r&eacute;vocation de certificats (CRL). <p>Pour obtenir des informations g&eacute;n&eacute;rales &agrave; ce sujet, consultez la rubrique <a href="#How_Certificate_Validation_Works">Fonctionnement de la validation</a>.

<p>Pour une description des param&egrave;tres CRL que vous pouvez g&eacute;rer, consultez la rubrique <a href="validation_help.html">Param&egrave;tres de validation</a>.</p>

<table summary="list of headings" cellpadding=4 cellspacing=2 bgcolor="#cccccc" Width=380>
<tr>
<td class="inthissection">
<p>Dans cette section&nbsp;:</p>
<p><a href="#next_update">A propos de la date de "Prochaine mise &agrave; jour"</a></p>
<p><a href="#Importing_CRLs">Importation de listes de r&eacute;vocation de certificats (CRL)</a></p>
<p><a href="#view_manage_CRLs">Consultation et gestion de listes de r&eacute;vocation de certificats (CRL)</a></p>
</td>
</tr>
</table>


<p>&nbsp;</p> <a NAME="CRLs:Next_Update_dateIDX"></a> <a name ="next_update"></a><h3>A propos de la date de "Prochaine mise &agrave; jour"</h3>

<p>Le navigateur utilise les CRL dont il dispose pour v&eacute;rifier la validit&eacute; des certificats &eacute;mis par les autorit&eacute;s de certification correspondantes. Si un certificat est repris dans une liste comme r&eacute;voqu&eacute;, le navigateur ne l'accepte pas comme preuve d'identit&eacute;.

<p>Une autorit&eacute; de certification publie g&eacute;n&eacute;ralement une liste actualis&eacute;e des certificats r&eacute;voqu&eacute;s &agrave; intervalles r&eacute;guliers. Chaque liste de r&eacute;vocation de certificats (CRL) comprend un champ pr&eacute;cisant la date &agrave; laquelle l'autorit&eacute; de certification publiera la prochaine mise &agrave; jour de cette liste. En r&egrave;gle g&eacute;n&eacute;rale, si la date figurant dans ce champ est ant&eacute;rieure &agrave; la date en cours, il convient de se procurer la version la plus r&eacute;cente de la liste de r&eacute;vocation de certificats (CRL). Pour consulter les informations relatives aux listes CRL et configurer la fonction de mise &agrave; jour automatique des listes CRL, consultez la rubrique <a href="#view_manage_CRLs">Consultation et gestion des listes de r&eacute;vocation de certificats</a>.

<p>Les autorit&eacute;s de certification doivent produire une nouvelle liste de r&eacute;vocation de certificats pour la date de la Prochaine mise &agrave; jour. Toutefois, l'absence d'une liste de r&eacute;vocation de certificats r&eacute;cente n'invalide pas un certificat. D&egrave;s lors, si aucune liste CRL r&eacute;cente n'est disponible, un certificat peut &ecirc;tre valid&eacute;, et ce, m&ecirc;me si la liste CRL la plus r&eacute;cente l'affiche comme ayant expir&eacute;. La mise &agrave; jour automatique des listes de r&eacute;vocation de certificats peut vous &eacute;viter d'&ecirc;tre confront&eacute; &agrave; cette situation.



<p>&nbsp;</p> <a name="Importing_CRLs"></a><h3>Importation de listes de r&eacute;vocation de certificats (CRL)</h3>

<p> Vous pouvez importer dans votre navigateur la liste de r&eacute;vocation de certificats la plus r&eacute;cente aupr&egrave;s d'une autorit&eacute; de certification. Pour importer une liste CRL, proc&eacute;dez comme suit :
<ol>
	<li>Rendez-vous &agrave; l'adresse URL sp&eacute;cifi&eacute;e par l'autorit&eacute; de certification ou par votre administrateur syst&egrave;me et cliquez sur le lien correspondant &agrave; la CRL que vous souhaitez importer.

	<p>La bo&icirc;te de dialogue Etat d'importation de liste CRL s'affiche.

	<li>Confirmez que la liste CRL a bien &eacute;t&eacute; import&eacute;e et qu'il s'agit bien de celle que vous souhaitiez. Dans la plupart des cas, vous devrez &eacute;galement cliquer sur Oui pour activer la fonction de mise &agrave; jour automatique de la CRL que vous venez d'importer.
	<li>L'&eacute;tape suivante d&eacute;pend du fait que vous cliquiez sur Oui ou sur Non dans la bo&icirc;te de dialogue Etat d'importation de liste CRL&nbsp;:
<ul>
	<p><b>Oui&nbsp;:</b> La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences de mise &agrave; jour automatique de liste CRL s'affiche. Dans ce cas, passez &agrave; l'&eacute;tape&nbsp;4.

	<p><b>Non&nbsp;:</b> La bo&icirc;te de dialogue Etat d'importation de liste CRL se ferme. Si vous changez d'avis et d&eacute;cidez finalement d'activer la fonction de mise &agrave; jour automatique, consultez la rubrique <a href="#view_manage_CRLs">Consultation et gestion des listes de r&eacute;vocation de certificats (CRL)</a>.</p>
</ul>
	<li>S&eacute;lectionnez l'option "Activer la mise &agrave; jour automatique pour cette liste CRL".
	<li>D&eacute;terminez la m&eacute;thode de planification des mises &agrave; jour automatiques&nbsp;:</li>
	<ul>
		<li><b>Mettre &agrave; jour __ jours avant la date de mise &agrave; jour suivante&nbsp;:</b> S&eacute;lectionnez cette option si vous souhaitez baser la fr&eacute;quence de mise &agrave; jour sur la fr&eacute;quence de publication des nouvelles versions de listes CRL.
		<li><b>Mettre &agrave; jour tous les __ jours :</b> S&eacute;lectionnez cette option si vous souhaitez sp&eacute;cifier un intervalle de mise &agrave; jour n'ayant aucun lien avec la date de prochaine mise &agrave; jour de la liste CRL.
	</ul>
	<li>Cliquez sur OK pour confirmer vos choix.
</ol>


<p>&nbsp;</p> <a name="view_manage_CRLs"></a><h3>Consultation et gestion de listes de r&eacute;vocation de certificats (CRL)</h3>

<p>Vous pouvez consulter et g&eacute;rer les CRL disponibles pour le navigateur via les pr&eacute;f&eacute;rences de validation du navigateur&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Validation. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
	<li>Cliquez sur G&eacute;rer les CRL dans le panneau Validation pour afficher une liste des CRL accessibles au Gestionnaire de certificats.
</ol>

<p>Pour supprimer ou mettre &agrave; jour une liste CRL, s&eacute;lectionnez-la et cliquez sur le bouton appropri&eacute;.

<p>Pour d&eacute;finir des mises &agrave; jour automatiques pour une CRL, s&eacute;lectionnez-la et cliquez sur Param&egrave;tres. La bo&icirc;te de dialogue Pr&eacute;f&eacute;rences de mise &agrave; jour automatique de liste CRL s'affiche&nbsp;:
<ol>
	<li>S&eacute;lectionnez l'option "Activer la mise &agrave; jour automatique pour cette liste CRL".</li>
	<li>D&eacute;terminez la m&eacute;thode de planification des mises &agrave; jour automatiques&nbsp;:</li>
	<ul>
		<li><b>Mettre &agrave; jour __ jours avant la date de mise &agrave; jour suivante.</b> S&eacute;lectionnez cette option si vous souhaitez baser la fr&eacute;quence de mise &agrave; jour sur la fr&eacute;quence de publication des nouvelles versions de listes CRL.
		<li><b>Mettre &agrave; jour tous les __ jours.</b> S&eacute;lectionnez cette option si vous souhaitez sp&eacute;cifier un intervalle de mise &agrave; jour n'ayant aucun lien avec la date de prochaine mise &agrave; jour de la liste CRL.</li>
	</ul>
	<li>Cliquez sur OK pour confirmer vos choix.</li>
</ol>


<p>&nbsp;</p> <a name="Configuring_Certificate_Manager_for_OCSP"></a><h2>Configuration OCSP</h2>


<p>Les param&egrave;tres qui contr&ocirc;lent OCSP font partie des pr&eacute;f&eacute;rences de Validation. Pour afficher les pr&eacute;f&eacute;rences de Validation, proc&eacute;dez comme suit&nbsp;:

<ol>
	<li>Ouvrez le menu Edition et choisissez Pr&eacute;f&eacute;rences.
	<li>Dans la cat&eacute;gorie Confidentialit&eacute; et s&eacute;curit&eacute;, cliquez sur Validation. Si aucune sous-cat&eacute;gorie n'est visible, double-cliquez sur Confidentialit&eacute; et s&eacute;curit&eacute; pour d&eacute;velopper la liste.
</ol>

<p>Pour plus d'informations sur les options OCSP disponibles, consultez la rubrique <a href="validation_help.html#OCSP">Validation</a>.

<p> [&nbsp;<A HREF="#using_certs_first">Retour au d&eacute;but de la section</A>&nbsp;]
</p>


<hr>
<p><i>18 juin 2002</i></p>
<p>Copyright &copy; 1994-2002 Netscape Communications Corporation.</p>

</body>
</html>



