## Signature Information strings
SINoneLabel=\u90ae\u4ef6\u6ca1\u6709\u6570\u5b57\u7b7e\u540d
SINone=\u6b64\u90ae\u4ef6\u6ca1\u6709\u53d1\u9001\u4eba\u7684\u6570\u5b57\u7b7e\u540d\u3002\u6ca1\u6709\u6570\u5b57\u7b7e\u540d\u610f\u5473\u7740\u6b64\u90ae\u4ef6\u53ef\u80fd\u662f\u7531\u5047\u88c5\u62e5\u6709\u6b64\u7535\u5b50\u90ae\u4ef6\u5730\u5740\u7684\u67d0\u4e2a\u4eba\u53d1\u9001\u7684\uff0c\u4e5f\u6709\u53ef\u80fd\u6b64\u90ae\u4ef6\u5728\u901a\u8fc7\u7f51\u7edc\u4f20\u9012\u65f6\u66fe\u88ab\u6539\u52a8\u3002\u4e0d\u8fc7\uff0c\u5e76\u4e0d\u8c61\u53d1\u751f\u8fc7\u8fd9\u4e24\u79cd\u60c5\u51b5\u7684\u4efb\u4f55\u4e00\u79cd\u3002

SIValidLabel=\u90ae\u4ef6\u5df2\u7b7e\u540d
SIValid=\u6b64\u90ae\u4ef6\u5305\u62ec\u6709\u6548\u7684\u6570\u5b57\u7b7e\u540d\uff0c\u90ae\u4ef6\u53d1\u51fa\u540e\u672a\u88ab\u6539\u52a8\u8fc7\u3002

SIInvalidLabel=\u6570\u5b57\u7b7e\u540d\u65e0\u6548
SIInvalidHeader=\u6b64\u90ae\u4ef6\u867d\u6709\u6570\u5b57\u7b7e\u540d\uff0c\u4f46\u7b7e\u540d\u662f\u65e0\u6548\u7684\u3002

SIContentAltered=\u7b7e\u540d\u4e0e\u90ae\u4ef6\u5185\u5bb9\u4e0d\u80fd\u6b63\u786e\u5339\u914d\u3002\u90ae\u4ef6\u5728\u53d1\u4ef6\u4eba\u7b7e\u7f72\u540e\uff0c\u597d\u8c61\u88ab\u6539\u52a8\u8fc7\u3002\u5728\u6ca1\u6709\u4e0e\u53d1\u4ef6\u4eba\u6838\u5b9e\u5176\u5185\u5bb9\u524d\uff0c\u60a8\u4e0d\u5e94\u76f8\u4fe1\u6b64\u90ae\u4ef6\u7684\u6709\u6548\u6027\u3002
SIHeaderMismatch=\u7b7e\u540d\u4e0e\u90ae\u4ef6\u5185\u5bb9\u4e0d\u80fd\u6b63\u786e\u5339\u914d\u3002\u90ae\u4ef6\u5728\u53d1\u4ef6\u4eba\u7b7e\u7f72\u540e\uff0c\u597d\u8c61\u88ab\u6539\u52a8\u8fc7\u3002\u5728\u6ca1\u6709\u4e0e\u53d1\u4ef6\u4eba\u6838\u5b9e\u5176\u5185\u5bb9\u524d\uff0c\u60a8\u4e0d\u5e94\u76f8\u4fe1\u6b64\u90ae\u4ef6\u7684\u6709\u6548\u6027\u3002
SIExpired=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u4f3c\u4e4e\u5df2\u8fc7\u671f\u3002\u8bf7\u786e\u8ba4\u8ba1\u7b97\u673a\u4e0a\u7684\u65f6\u949f\u8bbe\u7f6e\u662f\u6b63\u786e\u7684\u3002
SIRevoked=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u5df2\u88ab\u64a4\u9500\u3002\u5728\u6ca1\u6709\u4e0e\u53d1\u4ef6\u4eba\u6838\u5b9e\u5176\u5185\u5bb9\u524d\uff0c\u60a8\u4e0d\u5e94\u76f8\u4fe1\u6b64\u90ae\u4ef6\u7684\u6709\u6548\u6027\u3002
SINotYetValid=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u4f3c\u4e4e\u5c1a\u672a\u6709\u6548\u3002\u8bf7\u786e\u8ba4\u8ba1\u7b97\u673a\u4e0a\u7684\u65f6\u949f\u8bbe\u7f6e\u662f\u6b63\u786e\u7684\u3002
SIUnknownCA=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u662f\u7531\u672a\u77e5\u7684\u8ba4\u8bc1\u4e2d\u5fc3\u9881\u53d1\u7684\u3002
SIUntrustedCA=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u662f\u7531\u60a8\u4e0d\u4fe1\u4efb\u8fdb\u884c\u6b64\u7c7b\u8bc1\u4e66\u9881\u53d1\u7684\u8ba4\u8bc1\u4e2d\u5fc3\u9881\u53d1\u7684\u3002
SIExpiredCA=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u662f\u7531\u5176\u81ea\u8eab\u7684\u8bc1\u4e66\u5df2\u7ecf\u8fc7\u671f\u7684\u8ba4\u8bc1\u4e2d\u5fc3\u9881\u53d1\u7684\u3002\u8bf7\u786e\u8ba4\u8ba1\u7b97\u673a\u4e0a\u7684\u65f6\u949f\u8bbe\u7f6e\u662f\u6b63\u786e\u7684\u3002
SIRevokedCA=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u662f\u7531\u5176\u81ea\u8eab\u7684\u8bc1\u4e66\u5df2\u88ab\u64a4\u9500\u7684\u8ba4\u8bc1\u4e2d\u5fc3\u9881\u53d1\u7684\u3002\u5728\u6ca1\u6709\u4e0e\u53d1\u4ef6\u4eba\u6838\u5b9e\u5176\u5185\u5bb9\u524d\uff0c\u60a8\u4e0d\u5e94\u76f8\u4fe1\u6b64\u90ae\u4ef6\u7684\u6709\u6548\u6027\u3002
SINotYetValidCA=\u7b7e\u7f72\u90ae\u4ef6\u6240\u7528\u7684\u8bc1\u4e66\u662f\u7531\u5176\u81ea\u8eab\u7684\u8bc1\u4e66\u5c1a\u672a\u6709\u6548\u7684\u8ba4\u8bc1\u4e2d\u5fc3\u9881\u53d1\u7684\u3002\u8bf7\u786e\u8ba4\u8ba1\u7b97\u673a\u4e0a\u7684\u65f6\u949f\u8bbe\u7f6e\u662f\u6b63\u786e\u7684\u3002
SIInvalidCipher=\u6b64\u90ae\u4ef6\u662f\u7528\u6b64\u8f6f\u4ef6\u7248\u672c\u4e0d\u652f\u6301\u7684\u5f3a\u5316\u52a0\u5bc6\u7b7e\u7f72\u7684\u3002
SIClueless=\u6b64\u6570\u5b57\u7b7e\u540d\u5b58\u5728\u67d0\u4e9b\u672a\u77e5\u95ee\u9898\u3002\u5728\u6ca1\u6709\u4e0e\u53d1\u4ef6\u4eba\u6838\u5b9e\u5176\u5185\u5bb9\u524d\uff0c\u60a8\u4e0d\u5e94\u76f8\u4fe1\u6b64\u90ae\u4ef6\u7684\u6709\u6548\u6027\u3002


## Encryption Information strings
EINoneLabel=\u672a\u52a0\u5bc6\u90ae\u4ef6
EINone=\u6b64\u90ae\u4ef6\u53d1\u9001\u524d\u672a\u52a0\u5bc6\u3002\u901a\u8fc7\u4e92\u8054\u7f51\u53d1\u9001\u7684\u672a\u7ecf\u52a0\u5bc6\u7684\u4fe1\u606f\u53ef\u5728\u4f20\u9012\u4e2d\u88ab\u5176\u4ed6\u4eba\u770b\u5230\u3002

EIValidLabel=\u52a0\u5bc6\u90ae\u4ef6
EIValid=\u6b64\u90ae\u4ef6\u5728\u53d1\u9001\u7ed9\u60a8\u4e4b\u524d\u5df2\u52a0\u5bc6\u3002\u7ecf\u8fc7\u52a0\u5bc6\u7684\u90ae\u4ef6\u5728\u901a\u8fc7\u7f51\u7edc\u4f20\u9012\u65f6\uff0c\u5176\u4ed6\u4eba\u5f88\u96be\u67e5\u770b\u5176\u4fe1\u606f\u3002

EIInvalidLabel=\u90ae\u4ef6\u65e0\u6cd5\u89e3\u5bc6
EIInvalidHeader=\u6b64\u90ae\u4ef6\u5728\u53d1\u9001\u7ed9\u60a8\u4e4b\u524d\u5df2\u52a0\u5bc6\u3002\u4f46\u73b0\u5728\u65e0\u6cd5\u89e3\u5bc6\u3002

EIContentAltered=\u90ae\u4ef6\u7684\u5185\u5bb9\u5728\u4f20\u8f93\u8fc7\u7a0b\u4e2d\u8c61\u662f\u88ab\u6539\u52a8\u8fc7\u3002
EINoDecryptCert=\u65e0\u6cd5\u627e\u5230\u8be5\u90ae\u4ef6\u52a0\u5bc6\u65f6\u4f7f\u7528\u7684\u8bc1\u4e66\u3002
EIPasswordError=\u60a8\u8f93\u5165\u7684\u201c\u4e3b\u5bc6\u7801\u201d\u4e0d\u6b63\u786e\u3002
EIInvalidCipher=\u6b64\u90ae\u4ef6\u662f\u4f7f\u7528\u6b64\u8f6f\u4ef6\u7248\u672c\u4e0d\u652f\u6301\u7684\u5f3a\u5316\u52a0\u5bc6\u7b7e\u7f72\u7684\u3002
EIClueless=\u6b64\u52a0\u5bc6\u90ae\u4ef6\u5b58\u5728\u67d0\u4e9b\u672a\u77e5\u95ee\u9898\u3002


## Signing Power Information string
SPCanLabel=\u90ae\u4ef6\u53ef\u7b7e\u540d
SPCanHeader=\u60a8\u5df2\u9009\u62e9\u5728\u90ae\u4ef6\u53d1\u9001\u524d\u5bf9\u5176\u8fdb\u884c\u6570\u5b57\u7b7e\u540d\u3002
SPCan=\u5f53\u5176\u4ed6\u4eba\u6536\u5230\u60a8\u7b7e\u7f72\u7684\u90ae\u4ef6\u65f6\uff0c\u4ed6\u4eec\u53ef\u4ee5\u9a8c\u8bc1\u90ae\u4ef6\u662f\u5426\u53d1\u81ea\u4e8e\u60a8\u5e76\u4e14\u5728\u60a8\u7b7e\u7f72\u540e\u662f\u5426\u88ab\u6539\u52a8\u8fc7\u3002

SPCannotLabel=\u90ae\u4ef6\u65e0\u6cd5\u7b7e\u540d
SPCannotHeader=\u60a8\u65e0\u6cd5\u5bf9\u6b64\u90ae\u4ef6\u8fdb\u884c\u6570\u5b57\u7b7e\u540d\u3002

SPNoCert=\u60a8\u8fd8\u6ca1\u6709\u6307\u5b9a\u7528\u4e8e\u521b\u5efa\u6570\u5b57\u7b7e\u540d\u7684\u6709\u6548\u7684\u8bc1\u4e66\u3002
SPNoSigCert=\u60a8\u6307\u5b9a\u7684\u7528\u4e8e\u7b7e\u7f72\u90ae\u4ef6\u7684\u8bc1\u4e66\u4e0d\u80fd\u7528\u4e8e\u8be5\u76ee\u7684\u3002
SPNoValidCert=\u60a8\u6307\u5b9a\u7684\u7528\u4e8e\u7b7e\u7f72\u90ae\u4ef6\u7684\u8bc1\u4e66\u5c1a\u672a\u6709\u6548\uff0c\u8bf7\u786e\u8ba4\u60a8\u8ba1\u7b97\u673a\u7684\u65f6\u949f\u8bbe\u7f6e\u662f\u6b63\u786e\u7684\u3002
SPExpiredCert=\u60a8\u6307\u5b9a\u7684\u7528\u4e8e\u7b7e\u7f72\u90ae\u4ef6\u7684\u8bc1\u4e66\u5df2\u8fc7\u671f\u3002
SPRevokedCert=\u60a8\u6307\u5b9a\u7684\u7528\u4e8e\u7b7e\u7f72\u90ae\u4ef6\u7684\u8bc1\u4e66\u5df2\u64a4\u9500\u3002


## Encryption Power Information string
EPCanLabel=\u90ae\u4ef6\u53ef\u52a0\u5bc6
EPCanHeader=\u60a8\u5df2\u7ecf\u9009\u62e9\u5728\u90ae\u4ef6\u53d1\u9001\u524d\u5bf9\u5176\u8fdb\u884c\u52a0\u5bc6\u3002
EPCan=\u5982\u679c\u60a8\u5df2\u9009\u62e9\u4fdd\u5b58\u5916\u53d1\u90ae\u4ef6\u7684\u526f\u672c\uff0c\u5219\u8be5\u90ae\u4ef6\u5c06\u5728\u4fdd\u5b58\u524d\u52a0\u5bc6\u3002

EPCannotLabel=\u90ae\u4ef6\u4e0d\u80fd\u52a0\u5bc6
EPCannotHeader=\u6b64\u90ae\u4ef6\u4e0d\u80fd\u52a0\u5bc6\u3002

EPRecipientUnknown=\u60a8\u8fd8\u6ca1\u6709\u8f93\u5165\u4efb\u4f55\u6536\u4ef6\u4eba\u3002
EPNoCerts=\u5bf9\u4e8e\u4e0b\u5217\u6536\u4ef6\u4eba\u800c\u8a00\uff0c\u60a8\u4e0d\u5177\u5907\u6709\u6548\u7684\u8bc1\u4e66:
EPClueless=\u6b64\u90ae\u4ef6\u5b58\u5728\u67d0\u4e9b\u672a\u77e5\u7684\u95ee\u9898\u3002
