# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):

malformedURI=\u3053\u306e URL \u306f\u6709\u52b9\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u8aad\u307f\u8fbc\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
fileNotFound=%s \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u5834\u6240\u3092\u78ba\u8a8d\u3057\u3066\u3001\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
dnsNotFound=%s \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u540d\u524d\u3092\u78ba\u8a8d\u3057\u3066\u3001\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
protocolNotFound=%S \u306f\u767b\u9332\u3055\u308c\u3066\u3044\u308b\u30d7\u30ed\u30c8\u30b3\u30eb\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
connectionFailure=%s \u306b\u63a5\u7d9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
netTimeout=%s \u306b\u63a5\u7d9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u64cd\u4f5c\u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f\u3002
redirectLoop=\u3053\u306e URL \u306e\u518d\u63a5\u7d9a\u5236\u9650\u3092\u8d8a\u3048\u307e\u3057\u305f\u3002\u8981\u6c42\u3055\u308c\u305f\u30da\u30fc\u30b8\u3092\u8aad\u307f\u8fbc\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
repost=\u8868\u793a\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u30da\u30fc\u30b8\u306b\u306f\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u306f\u3082\u3046\u306a\u3044\u9001\u4fe1\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u305d\u306e\u30c7\u30fc\u30bf\u3092\u518d\u9001\u4fe1\u3059\u308b\u5834\u5408\u306f\u3001\u30d5\u30a9\u30fc\u30e0\u306b\u3088\u308a\u5b9f\u884c\u3055\u308c\u305f\u30a2\u30af\u30b7\u30e7\u30f3\uff08\u691c\u7d22\u3084\u30aa\u30f3\u30e9\u30a4\u30f3 \u30b7\u30e7\u30c3\u30d4\u30f3\u30b0\u306a\u3069\uff09\u304c\u3059\u3079\u3066\u7e70\u308a\u8fd4\u3055\u308c\u307e\u3059\u3002\u30c7\u30fc\u30bf\u3092\u518d\u9001\u4fe1\u3059\u308b\u306b\u306f\uff3bOK\uff3d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u305d\u308c\u4ee5\u5916\u306e\u5834\u5408\u306f\uff3b\u30ad\u30e3\u30f3\u30bb\u30eb\uff3d\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002
repostConfirm=\u8868\u793a\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u30da\u30fc\u30b8\u306b\u306f\u3001\u9001\u4fe1\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u305d\u306e\u30c7\u30fc\u30bf\u3092\u518d\u9001\u4fe1\u3059\u308b\u5834\u5408\u306f\u3001\u30d5\u30a9\u30fc\u30e0\u306b\u3088\u308a\u5b9f\u884c\u3055\u308c\u305f\u30a2\u30af\u30b7\u30e7\u30f3\uff08\u691c\u7d22\u3084\u30aa\u30f3\u30e9\u30a4\u30f3 \u30b7\u30e7\u30c3\u30d4\u30f3\u30b0\u306a\u3069\uff09\u304c\u3059\u3079\u3066\u7e70\u308a\u8fd4\u3055\u308c\u307e\u3059\u3002\u30c7\u30fc\u30bf\u3092\u518d\u9001\u4fe1\u3059\u308b\u306b\u306f\uff3bOK\uff3d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u305d\u308c\u4ee5\u5916\u306e\u5834\u5408\u306f\uff3b\u30ad\u30e3\u30f3\u30bb\u30eb\uff3d\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002
unknownSocketType=\u30d1\u30fc\u30bd\u30ca\u30eb \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3 \u30de\u30cd\u30fc\u30b8\u30e3\uff08PSM\uff09\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u306a\u3044\u3068\u3001\u3053\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u8868\u793a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002PSM \u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u3066\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3001\u3082\u3046\u4e00\u5ea6\u8a66\u3057\u3066\u307f\u308b\u304b\u3001\u307e\u305f\u306f\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u554f\u3044\u5408\u305b\u3066\u304f\u3060\u3055\u3044\u3002
netReset=\u3053\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306b\u306f\u3001\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
