#
# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
# Sean Cotter <cotter@netscape.com>
#
# Note: Hash characters in the strings will be replaced by
# newlines. These are used to lay out the dialog.

Title=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u306b\u95a2\u3059\u308b\u8b66\u544a
MixedContentMessage=\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u60c5\u5831\u3092\u542b\u3080\u6697\u53f7\u5316\u30da\u30fc\u30b8\u3092\u8981\u6c42\u3057\u307e\u3057\u305f\u3002\u3053\u306e\u30da\u30fc\u30b8\u306b\u8868\u793a\u3055\u308c\u308b\u60c5\u5831\u307e\u305f\u306f\u3053\u306e\u30da\u30fc\u30b8\u3067\u5165\u529b\u3057\u305f\u60c5\u5831\u306f\u3001\u7b2c\u4e09\u8005\u306b\u3088\u3063\u3066\u7c21\u5358\u306b\u8aad\u307f\u53d6\u3089\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
LeaveSecureMessage=\u6697\u53f7\u5316\u3055\u308c\u305f\u30da\u30fc\u30b8\u304b\u3089\u96e2\u308c\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u304b\u3089\u9001\u53d7\u4fe1\u3059\u308b\u60c5\u5831\u306f\u3001\u7b2c\u4e09\u8005\u306b\u3088\u3063\u3066\u7c21\u5358\u306b\u8aad\u307f\u53d6\u3089\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
EnterSecureMessage=\u6697\u53f7\u5316\u3055\u308c\u305f\u30da\u30fc\u30b8\u3092\u8981\u6c42\u3057\u307e\u3057\u305f\u3002\u3053\u306e Web \u30b5\u30a4\u30c8\u306f\u81ea\u8eab\u306e\u5b89\u5168\u6027\u3092\u6b63\u3057\u304f\u8a3c\u660e\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u306e\u30da\u30fc\u30b8\u306b\u8868\u793a\u3055\u308c\u308b\u60c5\u5831\u307e\u305f\u306f\u3053\u306e\u30da\u30fc\u30b8\u3067\u5165\u529b\u3057\u305f\u60c5\u5831\u304c\u7b2c\u4e09\u8005\u306b\u3088\u3063\u3066\u7c21\u5358\u306b\u8aad\u307f\u53d6\u3089\u308c\u308b\u3053\u3068\u306f\u3042\u308a\u307e\u305b\u3093\u3002
WeakSecureMessage=\u8efd\u5ea6\u306e\u6697\u53f7\u5316\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u30da\u30fc\u30b8\u3092\u8981\u6c42\u3057\u307e\u3057\u305f\u3002\u3053\u306e Web \u30b5\u30a4\u30c8\u306f\u81ea\u8eab\u306e\u5b89\u5168\u6027\u3092\u6b63\u3057\u304f\u8a3c\u660e\u3057\u3066\u3044\u307e\u3059\u304c\u3001\u8868\u793a\u3055\u308c\u308b\u60c5\u5831\u307e\u305f\u306f\u3053\u306e\u30da\u30fc\u30b8\u3088\u308a\u5165\u529b\u3057\u305f\u60c5\u5831\u306f\u7b2c\u4e09\u8005\u306b\u3088\u3063\u3066\u8aad\u307f\u53d6\u3089\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
PostToInsecureFromSecureMessage=\u3053\u306e\u30da\u30fc\u30b8\u306f\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u307e\u3059\u304c\u3001\u5165\u529b\u3057\u305f\u60c5\u5831\u306f\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u63a5\u7d9a\u3092\u901a\u3058\u3066\u9001\u4fe1\u3055\u308c\u308b\u305f\u3081\u3001\u7b2c\u4e09\u8005\u306b\u3088\u3063\u3066\u7c21\u5358\u306b\u8aad\u307f\u53d6\u3089\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002##\u3053\u306e\u60c5\u5831\u3092\u9001\u4fe1\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f##
PostToInsecureFromInsecureMessage=\u5165\u529b\u3057\u305f\u60c5\u5831\u306f\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u63a5\u7d9a\u3092\u901a\u3058\u3066\u9001\u4fe1\u3055\u308c\u308b\u305f\u3081\u3001\u7b2c\u4e09\u8005\u306b\u3088\u3063\u3066\u7c21\u5358\u306b\u8aad\u307f\u53d6\u3089\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002##\u3053\u306e\u60c5\u5831\u3092\u9001\u4fe1\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f##
MixedContentShowAgain=\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u60c5\u5831\u3092\u542b\u3080\u6697\u53f7\u5316\u30da\u30fc\u30b8\u3092\u8868\u793a\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u3002
LeaveSecureShowAgain=\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u308b\u30da\u30fc\u30b8\u304b\u3089\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u30da\u30fc\u30b8\u3078\u79fb\u52d5\u3059\u308b\u3068\u304d\u306b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u3002
EnterSecureShowAgain=\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u308b\u30da\u30fc\u30b8\u3092\u8868\u793a\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u3002
WeakSecureShowAgain=\u8efd\u5ea6\u306e\u6697\u53f7\u5316\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u30da\u30fc\u30b8\u3092\u8868\u793a\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u3002
PostToInsecureFromInsecureShowAgain=\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u60c5\u5831\u3092\u9001\u4fe1\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u3002
SecurityButtonTooltipText=\u73fe\u5728\u306e\u30da\u30fc\u30b8\u306b\u95a2\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u60c5\u5831\u3092\u8868\u793a\u3059\u308b
Continue=\u7d9a\u884c
