# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#   Roland Mainz <roland.mainz@informatik.med.uni-giessen.de>
#

# Page number formating
## @page_number The current page number
#LOCALIZATION NOTE (pageofpages): Do not translate %ld in the following line.
# Place the word %ld where the page number and number of pages should be
# The first %ld will receive the the page number
pagenumber=%1$d

# Page number formating
## @page_number The current page number
## @page_total The total number of pages
#LOCALIZATION NOTE (pageofpages): Do not translate %ld in the following line.
# Place the word %ld where the page number and number of pages should be
# The first %ld will receive the the page number
# the second %ld will receive the total number of pages
pageofpages=%1$d\uff0f%2$d

# Print font
# The name of the font to be used to print the headers and footers
fontname=serif

# Print font size
# The size of the font to be used to print the headers and footers
fontsize=10

noPrintFilename.title=\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u3042\u308a\u307e\u305b\u3093
noPrintFilename.alert="\u5370\u5237\u5148:\u30d5\u30a1\u30a4\u30eb" \u3092\u9078\u629e\u3057\u307e\u3057\u305f\u304c\u3001\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u7a7a\u767d\u3067\u3059\uff01

# Print error codes
print_error_dialog_title=\u30d7\u30ea\u30f3\u30bf \u30a8\u30e9\u30fc
printpreview_error_dialog_title=\u5370\u5237\u30d7\u30ec\u30d3\u30e5\u30fc \u30a8\u30e9\u30fc
NS_ERROR_GFX_PRINTER_CMD_NOT_FOUND=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf\u304c\u5370\u5237\u30b3\u30de\u30f3\u30c9\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
NS_ERROR_GFX_PRINTER_CMD_FAILURE=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf\u306b\u9001\u4fe1\u3055\u308c\u305f\u6307\u793a\u304c\u64cd\u4f5c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_NO_PRINTER_AVAILABLE=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_NAME_NOT_FOUND=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_ACCESS_DENIED=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf\u3078\u306e\u30a2\u30af\u30bb\u30b9\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_INVALID_ATTRIBUTE=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u7121\u52b9\u306a\u30d7\u30ea\u30f3\u30bf\u5c5e\u6027\u3092\u8a2d\u5b9a\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_PRINTER_NOT_READY=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf\u306e\u6e96\u5099\u304c\u3067\u304d\u3066\u3044\u307e\u305b\u3093\u3002
NS_ERROR_GFX_PRINTER_OUT_OF_PAPER=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf\u306b\u7528\u7d19\u304c\u3042\u308a\u307e\u305b\u3093\u3002
NS_ERROR_GFX_PRINTER_PRINTER_IO_ERROR=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf I/O \u30a8\u30e9\u30fc\u3002
NS_ERROR_GFX_PRINTER_COULD_NOT_OPEN_FILE=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_FILE_IO_ERROR=\u5370\u5237\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_PRINTPREVIEW=\u5370\u5237\u30d7\u30ec\u30d3\u30e5\u30fc\u3092\u8868\u793a\u3059\u308b\u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u53f0\u306e\u30d7\u30ea\u30f3\u30bf\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u72b6\u614b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
NS_ERROR_UNEXPECTED=\u5370\u5237\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
NS_ERROR_OUT_OF_MEMORY=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u5370\u5237\u3059\u308b\u306e\u306b\u5341\u5206\u306a\u7a7a\u304d\u30e1\u30e2\u30ea\u304c\u3042\u308a\u307e\u305b\u3093\u3002
NS_ERROR_NOT_IMPLEMENTED=\u4e00\u90e8\u306e\u5370\u5237\u6a5f\u80fd\u306f\u307e\u3060\u5b9f\u88c5\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
NS_ERROR_NOT_AVAILABLE=\u4f7f\u7528\u4e0d\u80fd
NS_ERROR_ABORT=\u5370\u5237\u30b8\u30e7\u30d6\u304c\u4e2d\u6b62\u307e\u305f\u306f\u30ad\u30e3\u30f3\u30bb\u30eb\u3055\u308c\u307e\u3057\u305f\u3002
NS_ERROR_FAILURE=\u4f55\u3089\u304b\u306e\u7406\u7531\u3067\u5370\u5237\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_STARTDOC=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u958b\u59cb\u3059\u308b\u3068\u304d\u306b\u5370\u5237\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_ENDDOC=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u5b8c\u4e86\u3059\u308b\u3068\u304d\u306b\u5370\u5237\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_STARTPAGE=\u30da\u30fc\u30b8\u3092\u958b\u59cb\u3059\u308b\u3068\u304d\u306b\u5370\u5237\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_ENDPAGE=\u30da\u30fc\u30b8\u3092\u5b8c\u4e86\u3059\u308b\u3068\u304d\u306b\u5370\u5237\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_PRINT_WHILE_PREVIEW=\u5370\u5237\u30d7\u30ec\u30d3\u30e5\u30fc\u306e\u9593\u306f\u5370\u5237\u3067\u304d\u307e\u305b\u3093\u3002
NS_ERROR_GFX_PRINTER_PAPER_SIZE_NOT_SUPPORTED=\u6307\u5b9a\u3057\u305f\u7528\u7d19\u30b5\u30a4\u30ba\u304c\u30d7\u30ea\u30f3\u30bf\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_ORIENTATION_NOT_SUPPORTED=\u6307\u5b9a\u3057\u305f\u7528\u7d19\u306e\u5411\u304d\u304c\u30d7\u30ea\u30f3\u30bf\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_COLORSPACE_NOT_SUPPORTED=\u3053\u306e\u5370\u5237\u30b8\u30e7\u30d6\u306b\u306f\u30d7\u30ea\u30f3\u30bf\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u8272\u304c\u5fc5\u8981\u3067\u3042\u308b\u305f\u3081\u3001\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_TOO_MANY_COPIES=\u8981\u6c42\u3057\u305f\u90e8\u6570\u304c\u591a\u3059\u304e\u305f\u305f\u3081\u3001\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002
NS_ERROR_GFX_PRINTER_DRIVER_CONFIGURATION_ERROR=\u5370\u5237\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002\u30d7\u30ea\u30f3\u30bf \u30c9\u30e9\u30a4\u30d0\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
NS_ERROR_GFX_PRINTER_XPRINT_BROKEN_XPRT=\u58ca\u308c\u305f\u30d0\u30fc\u30b8\u30e7\u30f3\u306e X \u30d7\u30ea\u30f3\u30c8 \u30b5\u30fc\u30d0\uff08Xprt\uff09\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u6ce8\u610f:Xprt \u3092\u4f7f\u3063\u305f\u5370\u5237\u306f\u6b63\u3057\u304f\u6a5f\u80fd\u3057\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u4fee\u6b63\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u3064\u3044\u3066\u306f\u30b5\u30fc\u30d0\u306e\u30d9\u30f3\u30c0\u30fc\u306b\u554f\u3044\u5408\u308f\u305b\u304f\u3060\u3055\u3044\u3002
NS_ERROR_GFX_PRINTER_DOC_IS_BUSY_PP=\u30d6\u30e9\u30a6\u30b6\u306f\u4eca\u3001\u30d7\u30ec\u30d3\u30e5\u30fc\u3092\u5370\u5237\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\n\u30da\u30fc\u30b8\u306e\u8aad\u307f\u8fbc\u307f\u304c\u5b8c\u4e86\u3057\u3066\u304b\u3089\u3082\u3046\u4e00\u5ea6\u8a66\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
NS_ERROR_GFX_PRINTER_DOC_WAS_DESTORYED=\u5370\u5237\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u9593\u306b\u30da\u30fc\u30b8\u304c\u7f6e\u304d\u63db\u3048\u3089\u308c\u307e\u3057\u305f\u3002\n\u3082\u3046\u4e00\u5ea6\u8a66\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
NS_ERROR_GFX_PRINTER_NO_XUL=\u3053\u306e\u30da\u30fc\u30b8\u3092\u5370\u5237\u307e\u305f\u306f\u5370\u5237\u30d7\u30ec\u30d3\u30e5\u30fc\u3067\u304d\u307e\u305b\u3093\u3002
# No printers available
noprinter=\u4f7f\u7528\u53ef\u80fd\u306a\u30d7\u30ea\u30f3\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3002
# EOF.

