# LOCALIZATION NOTE: Do not translate <html:br/>
migratebeforestart=Das ausgew\u00e4hlte Profil wurde mit einer fr\u00fcheren Version von Netscape erstellt und muss kopiert und konvertiert werden, damit Sie es mit %brandShortName% verwenden k\u00f6nnen.<html:br/><html:br/> Ihr urspr\u00fcngliches Netscape-Profil wird nicht ver\u00e4ndert. <html:br/><html:br/> M\u00f6chten Sie dieses Profil kopieren und konvertieren?
migratebeforerename=Das ausgew\u00e4hlte Profil wurde mit einer fr\u00fcheren Version von Netscape erstellt und muss kopiert und  in ein %brandShortName%-Profil konvertiert werden, bevor es umbenannt werden kann.<html:br/><html:br/> Ihr urspr\u00fcngliches Netscape-Profil wird nicht ver\u00e4ndert. <html:br/><html:br/> M\u00f6chten Sie dieses Profil konvertieren?<html:br/><html:br/>
migratebeforedelete=Das ausgew\u00e4hlte Profil wurde mit einer fr\u00fcheren Version von Netscape erstellt. %brandShortName% kann dieses Profil aus der Liste der von ihm unterhaltenen Profile entfernen, aber aus Ihrem System m\u00fcssen Sie es mit der Netscape-Version, die sie erstellt hat, oder von Hand entfernen.<html:br/><html:br/> Ihr urspr\u00fcngliches Netscape-Profil wird nicht ver\u00e4ndert. <html:br/><html:br/> M\u00f6chten Sie dieses Profil aus der Liste der Profile entfernen?<html:br/><html:br/>



migratetitle=Profil konvertieren
migrateallprofilestitle=Alle Profile konvertieren
renameProfilePrompt=Umbenennen des Profils  "%oldProfileName%" in:
renameprofiletitle=Profil umbenennen

deletetitle=Profil l\u00f6schen
delete4xprofile=Das ausgew\u00e4hlte Profil wurde mit einer fr\u00fcheren Version von Netscape erstellt. <html:br/><html:br/>M\u00f6chten Sie dieses Profil aus der Profilliste entfernen?<html:br/><html:br/>
deleteprofile=Beim L\u00f6schen wird das Profil aus der Liste der verf\u00fcgbaren Profile entfernt und kann nicht wiederhergestellt werden.<html:br/>Sie k\u00f6nnen auch die Profildatendateien, einschlie\u00dflich Ihrer gespeicherten Mail-Nachrichten, Einstellungen und Zertifikate l\u00f6schen. Diese Option l\u00f6scht den Ordner "%S". Der Vorgang kann nicht r\u00fcckg\u00e4ngig gemacht werden.<html:br/><html:br/>M\u00f6chten Sie die Profildatendateien l\u00f6schen?
deleteFiles=Dateien l\u00f6schen
dontDeleteFiles=Dateien nicht l\u00f6schen

pm_title=Benutzer-Profile verwalten
ps_title=Benutzer-Profil ausw\u00e4hlen

pm_button=Zur\u00fcck...
ps_button=Profile verwalten...

startButton=%brandShortName% starten
exitButton=Beenden

cancel=Abbrechen

invalidCharA=Folgendes Zeichen kann nicht in Profilnamen verwendet werden: "
invalidCharB="<html:br/><html:br/>W\u00e4hlen Sie einen anderen Namen f\u00fcr das Profil.

profileExists=Ein Profil mit diesem Namen existiert bereits. Bitte w\u00e4hlen Sie einen anderen Namen.
profileExistsTitle=Profil existiert bereits
profDirMissing=%S kann das Profil "%S" nicht verwenden, da das Verzeichnis nicht gefunden wurde.<html:br/><html:br/> Bitte w\u00e4hlen Sie ein anderes Profil oder erstellen Sie ein neues.
profDirLocked=%S kann das Profil "%S" nicht verwenden, da es bereits verwendet wird.<html:br/><html:br/> W\u00e4hlen Sie ein anderes Profil aus oder erstellen Sie ein neues.


sourceProfileDirMissing=Das Profil kann nicht \u00fcbertragen werden, da das Verzeichnis mit den Profilinformationen nicht gefunden wurde. Bitte w\u00e4hlen Sie ein anderes Profil oder erstellen Sie ein neues.
sourceProfileDirMissingTitle=Profilverzeichnis nicht vorhanden
