# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):

malformedURI=A URL n\u00e3o \u00e9 v\u00e1lida e n\u00e3o pode ser carregada.
fileNotFound=O arquivo %s n\u00e3o pode ser localizado. Verifique a localiza\u00e7\u00e3o e tente novamente.
dnsNotFound=%s n\u00e3o foi encontrado. Verifique o nome e tente novamente.
protocolNotFound=%S n\u00e3o \u00e9 um protocolo registrado.
connectionFailure=A conex\u00e3o foi recusada ao tentar entrar em contato com %s.
netTimeout=O tempo limite da opera\u00e7\u00e3o foi atingido ao tentar entrar em contato com %s.
redirectLoop=Foi ultrapassado o limite de redirecionamento desta URL.  N\u00e3o foi poss\u00edvel carregar a p\u00e1gina solicitada.
repost=A p\u00e1gina que voc\u00ea est\u00e1 tentando exibir cont\u00e9m POSTDATA que expirou no cache. Se os dados forem reenviados, qualquer a\u00e7\u00e3o que o formul\u00e1rio tenha executado (como uma busca ou compra online) ser\u00e1 repetida. Para reenviar os dados, clique em OK. Caso contr\u00e1rio, clique em Cancel.
repostConfirm=A p\u00e1gina que voc\u00ea est\u00e1 tentando exibir cont\u00e9m POSTDATA. Se os dados forem reenviados, qualquer a\u00e7\u00e3o que o formul\u00e1rio tenha executado (como uma busca ou compra online) ser\u00e1 repetida. Para reenviar os dados, clique em OK. Caso contr\u00e1rio, clique em Cancel.
unknownSocketType=Este documento n\u00e3o poder\u00e1 ser exibido, a n\u00e3o ser que voc\u00ea instale o Gerenciador de Seguran\u00e7a Pessoal (PSM). Fa\u00e7a o download do PSM, instale-o e tente novamente; ou ainda, entre em contato com o administrador do sistema.
netReset=O documento n\u00e3o cont\u00e9m dados.
