# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#   Roland Mainz <roland.mainz@informatik.med.uni-giessen.de>
#

# Page number formating
## @page_number The current page number
#LOCALIZATION NOTE (pageofpages): Do not translate %ld in the following line.
# Place the word %ld where the page number and number of pages should be
# The first %ld will receive the the page number
pagenumber=%1$d

# Page number formating
## @page_number The current page number
## @page_total The total number of pages
#LOCALIZATION NOTE (pageofpages): Do not translate %ld in the following line.
# Place the word %ld where the page number and number of pages should be
# The first %ld will receive the the page number
# the second %ld will receive the total number of pages
pageofpages=%1$d de %2$d

# Print font
# The name of the font to be used to print the headers and footers
fontname=serif

# Print font size
# The size of the font to be used to print the headers and footers
fontsize=10

noPrintFilename.title=Falta um nome de arquivo
noPrintFilename.alert=Voc\u00ea selecionou "Imprimir em: Arquivo", mas o nome de arquivo est\u00e1 em branco.

# Print error codes
print_error_dialog_title=Erro da impressora
printpreview_error_dialog_title=Erro de Pr\u00e9-visualiza\u00e7\u00e3o de Impress\u00e3o
NS_ERROR_GFX_PRINTER_CMD_NOT_FOUND=Houve um problema ao imprimir. A impressora n\u00e3o tem suporte para um comando de impress\u00e3o.
NS_ERROR_GFX_PRINTER_CMD_FAILURE=Houve um problema ao imprimir. Houve falha ao enviar uma instru\u00e7\u00e3o \u00e0 impressora.
NS_ERROR_GFX_PRINTER_NO_PRINTER_AVAILABLE=Houve um problema ao imprimir. N\u00e3o foi encontrada uma impressora.
NS_ERROR_GFX_PRINTER_NAME_NOT_FOUND=Houve um problema ao imprimir. N\u00e3o foi poss\u00edvel encontrar a impressora.
NS_ERROR_GFX_PRINTER_ACCESS_DENIED=Houve um problema ao imprimir. O acesso \u00e0 impressora foi negado.
NS_ERROR_GFX_PRINTER_INVALID_ATTRIBUTE=Houve um problema ao imprimir. Houve uma tentativa de definir um atributo de impressora inv\u00e1lido.
NS_ERROR_GFX_PRINTER_PRINTER_NOT_READY=Houve um problema ao imprimir. A impressora n\u00e3o est\u00e1 pronta.
NS_ERROR_GFX_PRINTER_OUT_OF_PAPER=Houve um problema ao imprimir. Falta papel na impressora.
NS_ERROR_GFX_PRINTER_PRINTER_IO_ERROR=Houve um problema ao imprimir. Erro de entrada/sa\u00edda de impressora.
NS_ERROR_GFX_PRINTER_COULD_NOT_OPEN_FILE=Houve um problema ao imprimir. N\u00e3o foi poss\u00edvel abrir o arquivo de sa\u00edda.
NS_ERROR_GFX_PRINTER_FILE_IO_ERROR=Houve um erro ao gravar o arquivo de sa\u00edda de impress\u00e3o.
NS_ERROR_GFX_PRINTER_PRINTPREVIEW=Pelo menos uma impressora deve estar dispon\u00edvel para que seja poss\u00edvel mostrar a Pr\u00e9-visualiza\u00e7\u00e3o.
NS_ERROR_UNEXPECTED=Houve um problema inesperado ao imprimir.
NS_ERROR_OUT_OF_MEMORY=Houve um problema ao imprimir. Falta mem\u00f3ria livre para imprimir.
NS_ERROR_NOT_IMPLEMENTED=Certas funcionalidades de impress\u00e3o ainda n\u00e3o foram implementadas.
NS_ERROR_NOT_AVAILABLE=N\u00e3o dispon\u00edvel
NS_ERROR_ABORT=A tarefa de impress\u00e3o foi interrompida ou cancelada.
NS_ERROR_FAILURE=A impress\u00e3o falhou por raz\u00e3o n\u00e3o especificada.
NS_ERROR_GFX_PRINTER_STARTDOC=A impress\u00e3o falhou ao iniciar o documento.
NS_ERROR_GFX_PRINTER_ENDDOC=A impress\u00e3o falhou ao finalizar o documento.
NS_ERROR_GFX_PRINTER_STARTPAGE=A impress\u00e3o falhou ao iniciar a p\u00e1gina.
NS_ERROR_GFX_PRINTER_ENDPAGE=A impress\u00e3o falhou ao finalizar a p\u00e1gina.
NS_ERROR_GFX_PRINTER_PRINT_WHILE_PREVIEW=N\u00e3o \u00e9 poss\u00edvel imprimir no modo de pr\u00e9-visualiza\u00e7\u00e3o.
NS_ERROR_GFX_PRINTER_PAPER_SIZE_NOT_SUPPORTED=Houve um problema ao imprimir: o tamanho de papel especificado n\u00e3o \u00e9 compat\u00edvel com a impressora.
NS_ERROR_GFX_PRINTER_ORIENTATION_NOT_SUPPORTED=Houve um problema ao imprimir: a orienta\u00e7\u00e3o de p\u00e1gina especificada n\u00e3o \u00e9 compat\u00edvel com a impressora.
NS_ERROR_GFX_PRINTER_COLORSPACE_NOT_SUPPORTED=Houve um problema ao imprimir: a tarefa de impress\u00e3o requer capacidades de cor n\u00e3o compat\u00edveis com a sua impressora.
NS_ERROR_GFX_PRINTER_TOO_MANY_COPIES=Houve um problema ao imprimir: foi solicitado um n\u00famero excessivo de c\u00f3pias.
NS_ERROR_GFX_PRINTER_DRIVER_CONFIGURATION_ERROR=Houve um problema ao imprimir. O driver da impressora n\u00e3o est\u00e1 configurado adequadamente.
NS_ERROR_GFX_PRINTER_XPRINT_BROKEN_XPRT=Foi detectada uma vers\u00e3o danificada do servidor de impress\u00e3o X (Xprt). A impress\u00e3o com este servidor Xprt pode n\u00e3o funcionar corretamente. Entre em contato com o fornecedor do servidor para obter uma vers\u00e3o corrigida.
NS_ERROR_GFX_PRINTER_DOC_IS_BUSY_PP=O navegador n\u00e3o pode pr\u00e9-visualizar a impress\u00e3o agora.\nTente novamente quando a p\u00e1gina estiver completamente carregada.
NS_ERROR_GFX_PRINTER_DOC_WAS_DESTORYED=A p\u00e1gina foi substitu\u00edda enquanto voc\u00ea tentava imprimi-la.\nTente novamente.
NS_ERROR_GFX_NO_PRINTDIALOG_IN_TOOLKIT=Os di\u00e1logos plug\u00e1veis n\u00e3o foram bem instalados\nOu este Kit de Ferramentas GFX n\u00e3o \u00e9 mais compat\u00edvel com di\u00e1logos de impress\u00e3o nativos
NS_ERROR_GFX_NO_PRINTROMPTSERVICE=O Servi\u00e7o de Solicita\u00e7\u00e3o sobre Impress\u00e3o est\u00e1 faltando.
NS_ERROR_GFX_PRINTER_NO_XUL=N\u00e3o \u00e9 poss\u00edvel Imprimir ou Pr\u00e9-visualizar a Impress\u00e3o desta p\u00e1gina.
# No printers available
noprinter=N\u00e3o h\u00e1 nenhuma impressora dispon\u00edvel.
PrintToFile=Imprimir em Arquivo
# EOF.

