#
# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
# Sean Cotter <cotter@netscape.com>
#
# Note: Hash characters in the strings will be replaced by
# newlines. These are used to lay out the dialog.

Title=Avertissement de s\u00e9curit\u00e9
MixedContentMessage=Vous avez demand\u00e9 une page chiffr\u00e9e qui contient des informations non chiffr\u00e9es. Les informations que vous consultez ou saisissez sur cette page peuvent ais\u00e9ment \u00eatre lues par une tierce partie.
LeaveSecureMessage=Vous \u00eates sur le point de quitter une page chiffr\u00e9e. Les informations que vous enverrez ou recevrez pourront ais\u00e9ment \u00eatre lues par une tierce partie.
EnterSecureMessage=Vous avez demand\u00e9 une page chiffr\u00e9e. Le site Web s'est correctement identifi\u00e9 et les informations que vous consultez ou introduisez sur cette page ne peuvent pas ais\u00e9ment \u00eatre lues par une tierce partie.
WeakSecureMessage=Vous avez demand\u00e9 une page qui utilise un chiffrement de bas niveau. Le site Web s'est correctement identifi\u00e9 mais les informations que vous consultez ou introduisez sur cette page peuvent ais\u00e9ment \u00eatre lues par une tierce partie.
PostToInsecureFromSecureMessage=Bien que cette page soit chiffr\u00e9e, les informations que vous avez introduites sont sur le point d'\u00eatre envoy\u00e9es sur une connexion non chiffr\u00e9e et peuvent ais\u00e9ment \u00eatre lues par une tierce partie.##Etes-vous certain de vouloir continuer l'envoi de ces informations ?##
PostToInsecureFromInsecureMessage=Les informations que vous avez introduites sont sur le point d'\u00eatre envoy\u00e9es sur une connexion non chiffr\u00e9e et peuvent ais\u00e9ment \u00eatre lues par une tierce partie.##Etes-vous certain de vouloir continuer l'envoi de ces informations ?##
MixedContentShowAgain=M'avertir chaque fois que je suis sur le point de consulter une page chiffr\u00e9e qui contient des informations non chiffr\u00e9es.
LeaveSecureShowAgain=M'avertir chaque fois que je quitte une page chiffr\u00e9e pour une page qui ne l'est pas.
EnterSecureShowAgain=M'avertir chaque fois que je suis sur le point de consulter une page chiffr\u00e9e.
WeakSecureShowAgain=M'avertir chaque fois que je suis sur le point de consulter une page qui utilise un chiffrement de bas niveau.
PostToInsecureFromInsecureShowAgain=M'avertir chaque fois j'envoie des informations qui ne sont pas chiffr\u00e9es.
SecurityButtonTooltipText=Montre des informations de s\u00e9curit\u00e9 sur la page courante
Continue=Continuer
