# LOCALIZATION NOTE: Do not translate <html:br/>
migratebeforestart=Le profil s\u00e9lectionn\u00e9 a \u00e9t\u00e9 cr\u00e9\u00e9 avec une version pr\u00e9c\u00e9dente de Netscape et doit \u00eatre copi\u00e9 et converti avant d'\u00eatre utilisable avec %brandShortName%.<html:br/><html:br/> Votre profil Netscape d'origine ne sera pas alt\u00e9r\u00e9. <html:br/><html:br/> Souhaitez-vous copier et convertir ce profil ?
migratebeforerename=Le profil s\u00e9lectionn\u00e9 a \u00e9t\u00e9 cr\u00e9\u00e9 avec une version pr\u00e9c\u00e9dente de Netscape et doit \u00eatre copi\u00e9 et converti en un profil %brandShortName% avant de pouvoir \u00eatre renomm\u00e9.<html:br/><html:br/> Votre profil Netscape d'origine ne sera pas alt\u00e9r\u00e9. <html:br/><html:br/> Souhaitez-vous copier et convertir ce profil ?<html:br/><html:br/>
migratebeforedelete=Le profil s\u00e9lectionn\u00e9 a \u00e9t\u00e9 cr\u00e9\u00e9 avec une version pr\u00e9c\u00e9dente de Netscape. %brandShortName% peut supprimer ce profil de la liste de profils qu'il g\u00e8re, mais vous devez le supprimer de votre syst\u00e8me \u00e0 partir de la version de Netscape qui l'a cr\u00e9\u00e9 ou manuellement.<html:br/><html:br/> Votre profil Netscape d'origine ne sera pas alt\u00e9r\u00e9. <html:br/><html:br/> Souhaitez-vous supprimer ce profil de la liste de profils ?<html:br/><html:br/>



migratetitle=Migrer le profil
migrateallprofilestitle=Migrer tous les profils
renameProfilePrompt=Renommer le profil '%oldProfileName%' en:
renameprofiletitle=Renommer le profil

deletetitle=Supprimer un profil
delete4xprofile=Le profil s\u00e9lectionn\u00e9 a \u00e9t\u00e9 cr\u00e9\u00e9 avec une version pr\u00e9c\u00e9dente de Netscape. %S peut supprimer ce profil de la liste de profils qu'il g\u00e8re mais vous devez le supprimer de votre syst\u00e8me \u00e0 l'aide de la version de Netscape qui l'a cr\u00e9\u00e9 ou manuellement.<html:br/><html:br/> Voulez-vous supprimer ce profil de la liste de profils ?<html:br/><html:br/>
deleteprofile=Supprimer un profil le d\u00e9placera de la liste des profils disponibles et l'op\u00e9ration ne pourra pas \u00eatre annul\u00e9e.<html:br/>Vous pouvez \u00e9galement d\u00e9cider de supprimer les fichiers de donn\u00e9es du profil, y compris vos messages, param\u00e8tres et certificats enregistr\u00e9s. Cette op\u00e9ration supprimera le dossier "%S" et ne pourra pas \u00eatre annul\u00e9e.<html:br/><html:br/>Voulez-vous supprimer les fichiers de donn\u00e9es du profil ?
deleteFiles=Supprimer les fichiers
dontDeleteFiles=Ne pas supprimer les fichiers

pm_title=G\u00e9rer les profils utilisateurs
ps_title=S\u00e9lectionner un profil utilisateur

pm_button=Retour...
ps_button=G\u00e9rer les profils...

startButton=Lancer %brandShortName%
exitButton=Quitter

cancel=Annuler

invalidCharA=Vous ne pouvez pas cr\u00e9er ou renommer un profil en un nom contenant le caract\u00e8re : "
invalidCharB="<html:br/><html:br/>Choisissez un autre nom pour le profil.

profileExists=Un profil de ce nom existe d\u00e9j\u00e0. Choisissez un autre nom.
profileExistsTitle=Ce profil existe
profDirMissing=%S ne peut pas utiliser le profil "%S" parce que le r\u00e9pertoire qui le contient est introuvable.<html:br/><html:br/> Choisissez un autre profil ou cr\u00e9ez-en un.
profDirLocked=%S ne peut pas utiliser le profil "%S" car il est en cours d'utilisation.<html:br/><html:br/> S\u00e9lectionnez un autre profil ou cr\u00e9ez-en un.


sourceProfileDirMissing=Il est impossible de migrer ce profil parce que le r\u00e9pertoire contenant ses information est introuvable. Choisissez un autre profil ou cr\u00e9ez-en un.
sourceProfileDirMissingTitle=R\u00e9pertoire de profil manquant
