#
# The contents of this file are subject to the Mozilla Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#

SignedBy=Sign\u00e9 par %S
CertPassPrompt=Entrez le mot de passe de s\u00e9curit\u00e9 personnel pour le dispositif de s\u00e9curit\u00e9 Cl\u00e9s priv\u00e9es PSMT.

#These are for dialogs
#Download Cert dialog
newCAMessage1=Voulez-vous faire confiance \u00e0 "%S" pour les fonctions suivantes ?
unnamedCA=Autorit\u00e9 de certification (sans nom)

#For editing cert trust
editTrustWindowTitle=Modifier la fiabilit\u00e9 du certificat
editTrustCA=Le certificat "%S" repr\u00e9sente une autorit\u00e9 de certification.
editTrustSSL=Le certificat "%S" a \u00e9t\u00e9 \u00e9mis par :
issuerNotTrusted=Dans la mesure o\u00f9 vous ne faites pas confiance \u00e0 l'autorit\u00e9 de certification qui a \u00e9mis ce certificat, vous n'avez pas confiance en l'authenticit\u00e9 de ce certificat, sauf indication contraire ici.
issuerTrusted=Dans la mesure o\u00f9 vous faites confiance \u00e0 l'autorit\u00e9 de certification qui a \u00e9mis ce certificat, vous avez confiance en l'authenticit\u00e9 de ce certificat, sauf indication contraire ici.
issuerNotKnown=Dans la mesure o\u00f9 vous ne connaissez pas l'autorit\u00e9 de certification qui a \u00e9mis ce certificat, vous n'avez pas confiance en l'authenticit\u00e9 de ce certificat, sauf indication contraire ici.
issuerCertNotFound=Le certificat de cette autorit\u00e9 de certification est introuvable

#For Deleting Certificates
deleteSslCertFlag=
deleteSslCertConfirm=Etes-vous certain de vouloir supprimer ces certificats de sites Web ?
deleteSslCertImpact=Si vous supprimez un certificat de site Web, vous serez de nouveau invit\u00e9 \u00e0 l'accepter lors de votre prochaine visite du site Web.
deleteSslCertTitle=Supprimer les certificats de sites Web

deleteUserCertFlag=
deleteUserCertConfirm=Etes-vous certain de vouloir supprimer ces certificats ?
deleteUserCertImpact=Si vous supprimez un de vos propres certificats, vous ne pourrez plus l'utiliser pour vous identifier.
deleteUserCertTitle=Supprimer vos certificats

deleteCaCertFlag=
deleteCaCertConfirm=Etes-vous certain de vouloir supprimer ces certificats d'autorit\u00e9 de certification ?
deleteCaCertImpact=Si vous supprimez le certificat d'une autorit\u00e9 de certification, votre navigator ne fera plus confiance aux certificats \u00e9mis par cette autorit\u00e9.
deleteCaCertTitle=Supprimer les certificats d'autorit\u00e9 de certification

deleteEmailCertFlag=deleteEmailFlag
deleteEmailCertConfirm=Etes-vous certain de vouloir supprimer les certificats de courrier \u00e9lectronique de ces personnes ?
deleteEmailCertImpact=Si vous supprimez un certificat de courrier \u00e9lectronique, vous ne pourrez plus envoyer de messages chiffr\u00e9s \u00e0 ces personnes.
deleteEmailCertTitle=Supprimer les certificats de courrier \u00e9lectronique


#PKCS#12 file dialogs
chooseP12RestoreFileDialog=Nom de fichier \u00e0 restaurer
chooseP12BackupFileDialog=Nom de fichier \u00e0 sauvegarder

#Mismatch Domain Dialg
mismatchDomainMsg1=Vous avez tent\u00e9 d'\u00e9tablir une connexion avec "%S".  Hors, le certificat de s\u00e9curit\u00e9 pr\u00e9sent\u00e9 appartient \u00e0 "%S".  Il est possible, bien que peu probable, que quelqu'un tente d'intercepter vos communications avec ce site Web.
mismatchDomainMsg2=Si vous pensez que le certificat pr\u00e9sent\u00e9 n'appartient pas \u00e0 "%S", veuillez annuler la connexion et avertir l'administrateur du site.

#Server Cert expired
serverCertExpiredMsg1="%S" est un site qui utilise un certificat de s\u00e9curit\u00e9 pour chiffrer les donn\u00e9es pendant la transmission, mais son certificat a expir\u00e9 le %S.
serverCertExpiredTitle=Certificat de serveur expir\u00e9
serverCertNotYetValedMsg1="%S" est un site qui utilise un certificat de s\u00e9curit\u00e9 pour chiffrer les donn\u00e9es pendant la transmission, mais son certificat ne sera pas valide jusqu'au %S.
serverCertNotYetValidTitle=Certificat de serveur pas encore valide
serverCertExpiredMsg2=Assurez-vous que l'heure de votre ordinateur (actuellement r\u00e9gl\u00e9e sur %S) est correcte.

#Preferences
resetPreferences=Utilisez ce bouton pour restaurer les param\u00e8tres d'usine des pr\u00e9f\u00e9rences de s\u00e9curit\u00e9 de %S.

#Cert verification
certVerified=Ce certificat a \u00e9t\u00e9 v\u00e9rifi\u00e9 pour les utilisations suivantes :
certNotVerified_CertRevoked=Impossible de v\u00e9rifier ce certificat car il a \u00e9t\u00e9 r\u00e9voqu\u00e9.
certNotVerified_CertExpired=Impossible de v\u00e9rifier ce certificat car il a expir\u00e9.
certNotVerified_CertNotTrusted=Impossible de v\u00e9rifier ce certificat car aucune confiance ne lui est accord\u00e9e.
certNotVerified_IssuerNotTrusted=Impossible de v\u00e9rifier ce certificat car aucune confiance n'est accord\u00e9e \u00e0 l'\u00e9metteur.
certNotVerified_IssuerUnknown=Impossible de v\u00e9rifier ce certificat car l'\u00e9metteur est inconnu.
certNotVerified_CAInvalid=Impossible de v\u00e9rifier ce certificat car l'autorit\u00e9 de certification est non valide.
certNotVerified_Unknown=Impossible de v\u00e9rifier ce certificat pour des raisons inconnues.

#Client auth
clientAuthMessage1=Organization : "%S"
clientAuthMessage2=Emis sous : "%S"

#Page Info
pageInfo_SiteNotVerified=Identit\u00e9 du site Web non v\u00e9rifi\u00e9e
pageInfo_WebSiteVerified=Identit\u00e9 du site Web v\u00e9rifi\u00e9e
pageInfo_Identity_Verified=Le site Web %S prend en charge l'authentification pour la page que vous consultez. L'identit\u00e9 de ce site Web a \u00e9t\u00e9 v\u00e9rifi\u00e9e par %S, une autorit\u00e9 de certification \u00e0 laquelle vous faites confiance pour cette fonction.
pageInfo_ViewCertificate=Afficher le certificat de s\u00e9curit\u00e9 qui v\u00e9rifie l'identit\u00e9 de ce site Web.
pageInfo_NoEncryption=Connexion non chiffr\u00e9e
pageInfo_Privacy_None1=Le site Web %S ne prend pas en charge le chiffrement pour la page que vous consultez.
pageInfo_Privacy_None2=Les informations envoy\u00e9es sur Internet sans chiffrement peuvent \u00eatre visualis\u00e9es par d'autres personnes pendant leur transfert.
pageInfo_Privacy_None3=La page que vous visualisez n'est pas chiffr\u00e9e.
pageInfo_StrongEncryption=Connexion chiffr\u00e9e : Chiffrement de haut niveau (%S %S bits)
pageInfo_Privacy_Strong1=La page que vous consultez a \u00e9t\u00e9 chiffr\u00e9e avant d'\u00eatre transmise sur Internet.
pageInfo_Privacy_Strong2=Le chiffrement rend tr\u00e8s difficile la consultation par des personnes non autoris\u00e9es des informations circulant entre ordinateurs. Il est donc fort improbable que qui que ce soit ait lu cette page pendant son cheminement sur le r\u00e9seau.
pageInfo_WeakEncryption=Connexion chiffr\u00e9e : Chiffrement de bas niveau (%S %S bits)
pageInfo_Privacy_Weak1=Le site Web %S utilise un chiffrement de bas niveau pour la page que vous consultez.
pageInfo_Privacy_Weak2=Avec le chiffrement de bas niveau, il est possible que certaines personnes non autoris\u00e9es parviennent \u00e0 visualiser ces informations.

#Cert Viewer
certDetails=Afficheur de certificat :
notPresent=<Non partie du certificat>
unknownIssuer=<Emetteur inconnu>

escrowFinalMessage=Ne cliquez sur OK que si vous faites confiance \u00e0 "%S" pour prot\u00e9ger votre cl\u00e9 priv\u00e9e de chiffrement.

#Token Manager
password_not_set=(non d\u00e9fini)
failed_pw_change=Impossible de changer le mot de passe principal.
incorrect_pw=Vous n'avez pas introduit le mot de passe principal actuel correct. Veuillez r\u00e9essayer.
pw_change_ok=Le mot de passe principal a \u00e9t\u00e9 chang\u00e9 correctement.
pw_erased_ok=Avertissement ! Vous avez supprim\u00e9 votre mot de passe principal.
pw_not_wanted=Avertissement ! Vous avez d\u00e9cid\u00e9 de ne pas utiliser de mot de passe principal.
pw_empty_warning=Vos mots de passe Web et de messagerie, vos donn\u00e9es de formulaire et vos clefs priv\u00e9es ne seront pas prot\u00e9g\u00e9s.
login_failed=Echec de connexion
loadPK11TokenDialog=Choisissez un dispositif PKCS#11 \u00e0 charger
devinfo_modname=Module
devinfo_modpath=Chemin
devinfo_label=Libell\u00e9
devinfo_manID=Fabricant
devinfo_serialnum=Num\u00e9ro de s\u00e9rie
devinfo_hwversion=Version du mat\u00e9riel
devinfo_fwversion=Version du micropr.
devinfo_status=Etat
devinfo_desc=Description
devinfo_stat_disabled=D\u00e9sactiv\u00e9
devinfo_stat_notpresent=Non pr\u00e9sent
devinfo_stat_uninitialized=Non initialis\u00e9
devinfo_stat_notloggedin=Non connect\u00e9
devinfo_stat_loggedin=Connect\u00e9
devinfo_stat_ready=Pr\u00eat
enable_fips=Activer FIPS
disable_fips=D\u00e9sactiver FIPS

#device manager: load device dlg
device.loaddlg.width=300
device.loaddlg.height=200

certmgr.verified=V\u00e9rifi\u00e9
certmgr.verifiedNoOCSP=V\u00e9rifi\u00e9 (pas OCSP)

# CRL next update.
crlNextUpdateMsg1=%S ne parvient pas \u00e0 \u00e9tablir une connexion chiffr\u00e9e avec "%S".
crlNextUpdateMsg2=La liste de r\u00e9vocation de certificats (CRL) de "%S" doit \u00eatre mise \u00e0 jour.
NoUpdateFailure=Aucune
lastFetchUrlLabel=URL r\u00e9cup\u00e9r\u00e9e \u00e0 l'origine de
advertisedUrlLabel=URL recommand\u00e9e par l'autorit\u00e9 de certification
CrlUpdatePrefsSetConfirmation= es pr\u00e9f\u00e9rences de mise \u00e0 jour automatique seront effectives apr\u00e8s le red\u00e9marrage du navigator.
crlAutoUpdateDayCntError=e nombre de jours avant la mise \u00e0 jour suivante doit \u00eatre sup\u00e9rieur \u00e0 z\u00e9ro.
crlAutoUpdtaeFreqCntError=La fr\u00e9quence de mise \u00e0 jour doit \u00eatre une valeur sup\u00e9rieure \u00e0 z\u00e9ro.
disabledStatement=a mise \u00e0 jour automatique n'est pas activ\u00e9e pour cette liste CRL.
enabledStatement=La mise \u00e0 jour automatique est activ\u00e9e pour cette liste CRL.
crlAutoupdateQuestion1=Voulez-vous activer la mise \u00e0 jour automatique ?
crlAutoupdateQuestion2=Voulez-vous afficher les param\u00e8tres de mise \u00e0 jour automatique ?
undefinedValStr=<Non d\u00e9fini>
undefinedURL=L'URL de mise \u00e0 jour automatique n'est pas d\u00e9finie.
yesButton=Oui
noButton=Non
resetPasswordButtonLabel=R\u00e9initialiser
resetPasswordConfirmationTitle=R\u00e9initialiser le mot de passe principal
resetPasswordConfirmationMessage=Votre mot de passe a \u00e9t\u00e9 r\u00e9initialis\u00e9.
crlAutoupdateEnabled=Activ\u00e9e
crlAutoupdateNotEnabled=No activ\u00e9e
crlAutoupdateOk=OK
crlAutoupdateFailed=Echec
