## S/MIME error strings.
## Note to localization: %S is a placeholder
NoSenderSigningCert=Sie haben angegeben, dass diese Nachricht mit einer digitalen Unterschrift versehen werden soll, doch die Anwendung konnte entweder das in Ihren eMail- und Diskussionsforen-Kontoeinstellungen angegebene Zertifikat nicht finden oder das Zertifikat ist abgelaufen.
NoSenderEncryptionCert=Sie haben f\u00fcr diese Nachricht Verschl\u00fcselung festgelegt, dochdoch die Anwendung konnte entweder das in Ihren eMail- und Diskussionsforen-Kontoeinstellungen angegebene Verschl\u00fcsselungszertifikat nicht finden oder das Zertifikat ist abgelaufen.
MissingRecipientEncryptionCert=Sie haben f\u00fcr diese Nachricht Verschl\u00fcselung festgelegt, doch die Anwendung konnte kein Verschl\u00fcsselungszertifikat f\u00fcr %S finden.
SignNoSenderEncryptionCert=Sie haben angegeben, dass diese Nachricht mit einer digitalen Unterschrift versehen werden soll, doch die Anweisung konnte entweder kein Verschl\u00fcsselungszertifikat f\u00fcr die unterzeichnete Nachricht finden oder das Zertifikat ist abgelaufen.
ErrorCanNotEncrypt=Nachricht kann nicht verschl\u00fcsselt werden. . Bitte vergewissern Sie sich, dass Sie ein g\u00fcltiges eMail-Zertifikat f\u00fcr jeden Empf\u00e4nger besitzen. Vergewissern Sie sich, dass die Zertifikate, die in den eMail- und Diskussionsforen-Kontoeinstellungen f\u00fcr dieses eMail-Konto angegeben wurden, g\u00fcltig und vertrauensw\u00fcrdig sind.
ErrorCanNotSign=Nachricht kann nicht unterzeichnet werden. Bitte vergewissern Sie sich, dass die Zertifikate, die in den eMail- und Diskussionsforen-Kontoeinstellungen f\u00fcr dieses eMail-Konto angegeben wurden, g\u00fcltig und vertrauensw\u00fcrdig sind.

## Strings used for in the prefs.
prefPanel-smime=Sicherheit
NoSigningCert=Der Zertifikats-Manager kann kein g\u00fcltiges Zertifikat finden, das zum digitalen Unterzeichnen Ihrer Nachrichten verwendet werden kann.
NoEncryptionCert=Der Zertifikats-Manager kann kein g\u00fcltiges Zertifikat finden, das von anderen Benutzern dazu verwendet werden kann, Ihnen verschl\u00fcsselte eMail-Nachrichten zu senden.

encryption_needCertWantSame=Um Nachrichten mit einer digitalen Unterschrift zu versehen, m\u00fcssen Sie zun\u00e4chst ein Zertifikat angeben, das andere Benutzer verwenden k\u00f6nnen, wenn sie Ihnen verschl\u00fcsselte Nachrichten senden. M\u00f6chten Sie zum Ver- und Entschl\u00fcsseln von an Sie gesendeten Nachrichten dasselbe Zertifikat verwenden?
encryption_wantSame=M\u00f6chten Sie zum Ver- und Entschl\u00fcsseln von an Sie gesendeten Nachrichten dasselbe Zertifikat verwenden?
encryption_needCertWantToSelect=Um Nachrichten mit einer digitalen Unterschrift zu versehen, m\u00fcssen Sie zun\u00e4chst ein Zertifikat angeben, das andere Benutzer verwenden k\u00f6nnen, wenn sie Ihnen verschl\u00fcsselte Nachrichten senden. M\u00f6chten Sie jetzt ein Verschl\u00fcsselungszertifikat konfigurieren?
signing_needCertWantSame=Sie sollten auch ein Zertifikat angeben, das zum digitalen Unterzeichnen Ihrer Nachrichten verwendet wird. M\u00f6chten Sie zum digitalen Unterzeichnen Ihrer Nachrichten dasselbe Zertifikat verwenden?
signing_wantSame=M\u00f6chten Sie zum digitalen Unterzeichnen Ihrer Nachrichten dasselbe Zertifikat verwenden?
signing_needCertWantToSelect=Sie sollten auch ein Zertifikat angeben, das zum digitalen Unterzeichnen Ihrer Nachrichten verwendet wird. M\u00f6chten Sie jetzt ein Zertifikat zum digitalen Unterzeichnen von Nachrichten konfigurieren?
