## Signature Information strings
SINoneLabel=A Mensagem N\u00e3o Tem Assinatura Digital
SINone=Esta mensagem n\u00e3o inclui a assinatura digital do remetente. A aus\u00eancia de assinatura digital significa que a mensagem pode ter sido enviada por algu\u00e9m que fingiu ser o propriet\u00e1rio deste endere\u00e7o de e-mail. Tamb\u00e9m \u00e9 poss\u00edvel que a mensagem tenha sido alterada enquanto transitava pela rede. No entanto, as duas hip\u00f3teses s\u00e3o improv\u00e1veis.

SIValidLabel=A Mensagem Est\u00e1 Assinada
SIValid=A mensagem inclui uma assinatura digital v\u00e1lida. A mensagem n\u00e3o foi alterada desde o seu envio.

SIInvalidLabel=A Assinatura Digital N\u00e3o \u00e9 V\u00e1lida
SIInvalidHeader=A mensagem inclui uma assinatura digital, mas a assinatura \u00e9 inv\u00e1lida.

SIContentAltered=A assinatura n\u00e3o corresponde ao conte\u00fado da mensagem. A mensagem parece ter sido alterada depois de assinada pelo remetente. Voc\u00ea n\u00e3o deve confiar na validade desta mensagem at\u00e9 que verifique o seu conte\u00fado junto ao remetente.
SIHeaderMismatch=A assinatura n\u00e3o corresponde aos cabe\u00e7alhos da mensagem. A mensagem parece ter sido alterada depois de assinada pelo remetente. Voc\u00ea n\u00e3o deve confiar na validade desta mensagem at\u00e9 que verifique o seu conte\u00fado junto ao remetente.
SIExpired=O certificado usado para assinar a mensagem parece ter expirado. Certifique-se de que o rel\u00f3gio do sistema est\u00e1 definido corretamente.
SIRevoked=O certificado usado para assinar a mensagem foi revogado. Voc\u00ea n\u00e3o deve confiar na validade desta mensagem at\u00e9 que verifique o seu conte\u00fado junto ao remetente.
SINotYetValid=O certificado usado para assinar a mensagem parece ainda n\u00e3o ser v\u00e1lido. Certifique-se de que o rel\u00f3gio do sistema est\u00e1 definido corretamente.
SIUnknownCA=O certificado usado para assinar a mensagem foi emitido por uma autoridade de certifica\u00e7\u00e3o desconhecida.
SIUntrustedCA=O certificado usado para assinar a mensagem foi emitido por uma autoridade de certifica\u00e7\u00e3o em que voc\u00ea n\u00e3o confia para emitir este tipo de certificado.
SIExpiredCA=O certificado usado para assinar a mensagem foi emitido por uma autoridade de certifica\u00e7\u00e3o cujo pr\u00f3prio certificado expirou. Certifique-se de que o rel\u00f3gio do sistema est\u00e1 definido corretamente.
SIRevokedCA=O certificado usado para assinar a mensagem foi emitido por uma autoridade de certifica\u00e7\u00e3o cujo pr\u00f3prio certificado foi revogado. Voc\u00ea n\u00e3o deve confiar na validade desta mensagem at\u00e9 que verifique o seu conte\u00fado junto ao remetente.
SINotYetValidCA=O certificado usado para assinar a mensagem foi emitido por uma autoridade de certifica\u00e7\u00e3o cujo pr\u00f3prio certificado ainda n\u00e3o \u00e9 v\u00e1lido. Certifique-se de que o rel\u00f3gio do sistema est\u00e1 definido corretamente.
SIInvalidCipher=A mensagem foi assinada com um n\u00edvel de criptografia para o qual esta vers\u00e3o de software ainda n\u00e3o tem suporte.
SIClueless=H\u00e1 problemas desconhecidos com esta assinatura digital. Voc\u00ea n\u00e3o deve confiar na validade desta mensagem at\u00e9 que verifique o seu conte\u00fado junto ao remetente.


## Encryption Information strings
EINoneLabel=Mensagem N\u00e3o Criptografada
EINone=Esta mensagem n\u00e3o foi criptografada antes de ser enviada. As informa\u00e7\u00f5es que s\u00e3o enviadas sem criptografia pela Internet pode ser vistas por outras pessoas enquanto transitam.

EIValidLabel=A Mensagem Est\u00e1 Criptografada
EIValid=Esta mensagem foi criptografada antes de ser enviada. A criptografia torna muito dif\u00edcil que outras pessoas vejam informa\u00e7\u00f5es enquanto transitam pela rede.

EIInvalidLabel=N\u00e3o \u00c9 Poss\u00edvel Decriptografar a Mensagem
EIInvalidHeader=Esta mensagem foi criptografada antes de ser enviada, mas n\u00e3o pode ser decriptografada.

EIContentAltered=O conte\u00fado da mensagem parece ter sido alterado durante a transmiss\u00e3o.
EINoDecryptCert=N\u00e3o \u00e9 poss\u00edvel encontrar o certificado usado para criptografar a mensagem.
EIPasswordError=A Senha Mestre n\u00e3o foi digitada corretamente.
EIInvalidCipher=A mensagem foi criptografada com um n\u00edvel de criptografia para o qual esta vers\u00e3o de software ainda n\u00e3o tem suporte.
EIClueless=H\u00e1 problemas desconhecidos com esta mensagem criptografada.


## Signing Power Information string
SPCanLabel=\u00c9 Poss\u00edvel Assinar a Mensagem
SPCanHeader=Voc\u00ea optou por assinar digitalmente a mensagem antes de envi\u00e1-la.
SPCan=Quando outras pessoas receberem a sua mensagem assinada, poder\u00e3o verificar que a mensagem vem de voc\u00ea e que n\u00e3o foi alterada desde a assinatura.

SPCannotLabel=N\u00e3o \u00c9 Poss\u00edvel Assinar a Mensagem
SPCannotHeader=N\u00e3o \u00c9 Poss\u00edvel Assinar esta Mensagem Digitalmente.

SPNoCert=Voc\u00ea n\u00e3o especificou um certificado v\u00e1lido para criar assinaturas digitais.
SPNoSigCert=O certificado especificado para assinar mensagens n\u00e3o pode ser usado para essa finalidade.
SPNoValidCert=O certificado especificado para assinar mensagens ainda n\u00e3o \u00e9 v\u00e1lido. Certifique-se de que o rel\u00f3gio do sistema est\u00e1 definido corretamente.
SPExpiredCert=O certificado especificado para assinar mensagens expirou.
SPRevokedCert=O certificado especificado para assinar mensagens foi revogado.


## Encryption Power Information string
EPCanLabel=\u00c9 Poss\u00edvel Criptografar a Mensagem
EPCanHeader=Voc\u00ea optou por criptografar a mensagem antes de envi\u00e1-la.
EPCan=Se voc\u00ea optou por salvar c\u00f3pias de suas mensagens enviadas, esta mensagem ser\u00e1 criptografada antes de ser salva.

EPCannotLabel=N\u00e3o \u00c9 Poss\u00edvel Criptografar a Mensagem
EPCannotHeader=Esta mensagem n\u00e3o pode ser criptografada.

EPRecipientUnknown=Voc\u00ea n\u00e3o incluiu nenhum destinat\u00e1rio.
EPNoCerts=Voc\u00ea n\u00e3o tem certificados v\u00e1lidos para os seguintes destinat\u00e1rios:
EPClueless=H\u00e1 problemas desconhecidos com esta mensagem.
