## Signature Information strings
SINoneLabel=Nachricht tr\u00e4gt keine digitale Unterschrift
SINone=Diese Nachricht enth\u00e4lt nicht die digitale Unterschrift des Senders. Das Fehlen einer digitalen Unterschrift bedeutet, dass die Nachricht von jemanden gesendet worden sein k\u00f6nnte, der vorgibt, diese eMail-Adresse zu haben. Es ist auch m\u00f6glich, dass die Nachricht bei der \u00dcbertagung \u00fcber das Netzwerk ver\u00e4ndert wurde. Es ist jedoch unwahrscheinlich, dass einer diesr beiden F\u00e4lle vorliegt.

SIValidLabel=Nachricht ist unterzeichnet
SIValid=Diese Nachricht enth\u00e4lt eine g\u00fcltige digitale Unterschrift. Die Nachricht wurde seit dem Versenden nicht ver\u00e4ndert.

SIInvalidLabel=Digitale Unterschrift ist nicht g\u00fcltig
SIInvalidHeader=Diese Nachricht enth\u00e4lt eine digitale Unterschrift, die Unterschrift ist jedoch nicht g\u00fcltig.

SIContentAltered=Die Unterschrift stimmt nicht ordnungsgem\u00e4\u00df mit dem Inhalt der Nachricht \u00fcberein. Die Nachricht schein ver\u00e4ndert worden zu sein, nachdem sie vom Sender unterzeichnet wurde. Sie sollten nicht auf die G\u00fcltigkeit dieser Nachricht vertrauen, bis Sie ihren Inhalt beim Sender \u00fcberpr\u00fcft haben.
SIHeaderMismatch=Die Unterschrift stimmt nicht ordnungsgem\u00e4\u00df mit dem ITitel der Nachricht \u00fcberein. Die Nachricht schein ver\u00e4ndert worden zu sein, nachdem sie vom Sender unterzeichnet wurde. Sie sollten nicht auf die G\u00fcltigkeit dieser Nachricht vertrauen, bis Sie ihren Inhalt beim Sender \u00fcberpr\u00fcft haben.
SIExpired=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat scheint abgelaufen zu sein. Vergewissern Sie sich, dass die Uhr Ihres Computers richtig eingestellt ist..
SIRevoked=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat wurde widerrufen. Sie sollten nicht auf die G\u00fcltigkeit dieser Nachricht vertrauen, bis Sie ihren Inhalt beim Sender \u00fcberpr\u00fcft haben.
SINotYetValid=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat scheint noch nicht g\u00fcltig zu sein. Vergewissern Sie sich, dass die Uhr Ihres Computers richtig eingestellt ist..
SIUnknownCA=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat wurde von einem unbekannten Zertifikatsaussteller ausgegeben.
SIUntrustedCA=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat wurde von einem Zertifikatssaussteller ausgegeben, den Sie als nicht vertrauensw\u00fcrdig f\u00fcr die Ausgabe von Zertifikaten dieser Art eingestuft haben..
SIExpiredCA=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat wurde von einem Zertifikatssaussteller ausgegeben, dessen eigenes Zertifikat abgelaufen ist. Vergewissern Sie sich, dass die Uhr Ihres Computers richtig eingestellt ist..
SIRevokedCA=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat wurde von einem Zertifikatssaussteller ausgegeben, dessen eigenes Zertifikat widerrufen wurde. Sie sollten nicht auf die G\u00fcltigkeit dieser Nachricht vertrauen, bis Sie ihren Inhalt beim Sender \u00fcberpr\u00fcft haben.
SINotYetValidCA=Das f\u00fcr die Unterzeichnung der Nachricht verwendete Zertifikat wurde von einem Zertifikatssaussteller ausgegeben, dessen eigenes Zertifikat noch nicht g\u00fcltig ist. Vergewissern Sie sich, dass die Uhr Ihres Computers richtig eingestellt ist..
SIInvalidCipher=Die Nachricht wurde mit einer Veschl\u00fcsselungsst\u00e4rke unterzeichnet, die von dieser Version Ihrer Software nicht unterst\u00fctzt wird.
SIClueless=Bei dieser digitalen Unterschrift sind unbekannte Probleme aufgetreten. Sie sollten nicht auf die G\u00fcltigkeit dieser Nachricht vertrauen, bis Sie ihren Inhalt beim Sender \u00fcberpr\u00fcft haben.


## Encryption Information strings
EINoneLabel=Nachricht nicht verschl\u00fcsselt
EINone=Diese Nachricht wurde vor dem Versenden nicht verschl\u00fcsselt. Ohne Verschl\u00fcsselung \u00fcber das Internet versendete Informationen k\u00f6nnen w\u00e4hrend der \u00dcbertragung von anderen Personen gelesen werden.

EIValidLabel=Nachricht ist verschl\u00fcsselt
EIValid=Diese Nachricht wurde verschl\u00fcsselt, bevor sie an Sie abgeschickt wurde. Durch die Verschl\u00fcsselung ist das Risiko gering, dass andere Personen die Informationen w\u00e4hrend der \u00dcbertragung \u00fcber das Netzwerk einsehen k\u00f6nnen..

EIInvalidLabel=Entschl\u00fcsseln der Nachricht nicht m\u00f6glich
EIInvalidHeader=Diese Nachricht wurde verschl\u00fcsselt, bevor sie ans Sie abgeschickt wurde, sie kann jedoch nicht entschl\u00fcsselt werden.

EIContentAltered=Der Inhalt der Nachricht scheint w\u00e4hrend der \u00dcbertragung ver\u00e4ndert worden zu sein.
EINoDecryptCert=Das f\u00fcr die Verschl\u00fcsselung der Nachricht verwendete Zertifikat kann nicht gefunden werden.
EIPasswordError=Sie haben Ihr Master-Passwort nicht korrekt eingegeben.
EIInvalidCipher=Die Nachricht wurde mit einer Veschl\u00fcsselungsst\u00e4rke verschl\u00fcsselt, die von dieser Version Ihrer Software nicht unterst\u00fctzt wird.
EIClueless=Bei dieser verschl\u00fcsselten Nachricht sind unbekannte Probleme aufgetreten.


## Signing Power Information string
SPCanLabel=Nachricht kann unterzeichnet werden
SPCanHeader=Sie haben sich entschlossen, diese Nachricht vor dem Versenden mit einer digitalen Unterschrift zu versehen.
SPCan=Wenn andere Personen Ihre unterzeichnete Nachricht erhalten, k\u00f6nnen sie sich vergewissern, dass die Nachricht von Ihnen kommt und dass sie seit ihrer Unterzeichnung nicht ver\u00e4ndert wurde.

SPCannotLabel=Unterzeichnen der Nachricht nicht m\u00f6glich
SPCannotHeader=Sie k\u00f6nnen diese Nachricht nicht mit einer digitalen Unterschrift versehen.

SPNoCert=Sie haben kein g\u00fcltiges Zertifikat f\u00fcr das Erstellen von digitalen Unterschriften angegeben.
SPNoSigCert=Das von Ihnen f\u00fcr die Unterzeichnung von Nachrichten angegebene Zertifikat kann nicht f\u00fcr diesen Zweck verwendet werden.
SPNoValidCert=Das von Ihnen f\u00fcr die Unterzeichnung von Nachrichten angegebene Zertifiakt ist noch nicht g\u00fcltig. Vergewissern Sie sich, dass die Uhr Ihres Computers richtig eingestellt ist..
SPExpiredCert=Das von Ihnen f\u00fcr die Unterzeichnung von Nachrichten angegebene Zertifiakt ist abgelaufen.
SPRevokedCert=Das von Ihnen f\u00fcr die Unterzeichnung von Nachrichten angegebene Zertifiakt wurde widerrufen.


## Encryption Power Information string
EPCanLabel=Nachricht kann verschl\u00fcsselt werden
EPCanHeader=Sie haben sich entschlossen, diese Nachricht vor dem Versenden zu verschl\u00fcsseln.
EPCan=Wenn Sie festgelegt haben, Kopien Ihrer Ausgangsnachrichten zu speichern, wird diese Nachricht vor dem Speichern verschl\u00fcsselt.

EPCannotLabel=Verschl\u00fcsseln der Nachricht nicht m\u00f6glich
EPCannotHeader=Diese Nachricht kann nicht verschl\u00fcsselt werden.

EPRecipientUnknown=Sie haben keinen Empf\u00e4nger angegeben.
EPNoCerts=Sie besitzen keine g\u00fcltigen Zertifikate f\u00fcr folgende Empf\u00e4nger:
EPClueless=Bei dieser Nachricht sind unbekannte Probleme aufgetreten.
