## S/MIME error strings.
## Note to localization: %S is a placeholder
NoSenderSigningCert=Voc\u00ea especificou que esta mensagem deve ser assinada digitalmente, mas o aplicativo pode n\u00e3o ter localizado o certificado de assinatura especificado nas Defini\u00e7\u00f5es de Conta de Mail & Newsgroups ou a validade do certificado pode ter expirado.
NoSenderEncryptionCert=Voc\u00ea especificou que esta mensagem deve ser criptografada, mas o aplicativo pode n\u00e3o ter localizado o certificado de criptografia especificado nas Defini\u00e7\u00f5es de Conta de Mail & Newsgroups ou a validade do certificado pode ter expirado.
MissingRecipientEncryptionCert=Voc\u00ea especificou que esta mensagem deve ser criptografada, mas o aplicativo n\u00e3o p\u00f4de localizar um certificado de criptografia para %S.
SignNoSenderEncryptionCert=Voc\u00ea especificou que esta mensagem deve ser assinada digitalmente, mas o aplicativo pode n\u00e3o ter localizado o certificado de criptografia a ser inclu\u00eddo na mensagem assinada, ou a validade do certificado pode ter expirado.
ErrorCanNotEncrypt=N\u00e3o foi poss\u00edvel criptografar a mensagem. Verifique se possui um certificado de e-mail v\u00e1lido para cada destinat\u00e1rio. Verifique se os certificados especificados nas Defini\u00e7\u00f5es de Conta de Mail & Newsgroups s\u00e3o confi\u00e1veis e est\u00e3o v\u00e1lidos.
ErrorCanNotSign=N\u00e3o foi poss\u00edvel assinar a mensagem. Verifique se os certificados especificados nas Defini\u00e7\u00f5es de Conta de Mail & Newsgroups s\u00e3o confi\u00e1veis e est\u00e3o v\u00e1lidos

## Strings used for in the prefs.
prefPanel-smime=Seguran\u00e7a
NoSigningCert=O Gerenciador de Certificados n\u00e3o pode localizar um certificado v\u00e1lido a ser usado para assinar digitalmente as suas mensagens.
NoEncryptionCert=O Gerenciador de Certificados n\u00e3o pode localizar um certificado v\u00e1lido que possa ser usado por outras pessoas para enviar mensagens criptografadas a voc\u00ea.

encryption_needCertWantSame=Antes de assinar mensagens digitalmente, \u00e9 preciso especificar um certificado para uso com as outras pessoas que enviarem mensagens criptografadas a voc\u00ea. Deseja usar o mesmo certificado para criptografar & decriptografar as mensagens enviadas a voc\u00ea?
encryption_wantSame=Deseja usar o mesmo certificado para criptografar & decriptografar as mensagens enviadas a voc\u00ea?
encryption_needCertWantToSelect=Antes de assinar mensagens digitalmente, \u00e9 preciso especificar um certificado para uso com as outras pessoas que enviarem mensagens criptografadas a voc\u00ea. Deseja definir um certificado de criptografia agora?
signing_needCertWantSame=Voc\u00ea deve especificar tamb\u00e9m um certificado a ser usado na assinatura digital das suas mensagens. Deseja usar o mesmo certificado para assinar digitalmente as suas mensagens?
signing_wantSame=Deseja usar o mesmo certificado para assinar digitalmente as suas mensagens?
signing_needCertWantToSelect=Voc\u00ea deve especificar tamb\u00e9m um certificado a ser usado na assinatura digital das suas mensagens. Deseja definir agora um certificado para assinar mensagens digitalmente?
