# The contents of this file are subject to the Netscape Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/NPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation. Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#
IncorrectKey_TryAgain?=Master-Passwort inkorrekt. Wollen Sie es erneut versuchen?
WantToCaptureForm?=Sollen die von Ihnen eingegebenen Werte gespeichert werden?
WantToSavePasswordObscured?=Der Passwort-Manager kann diese Anmeldung speichern und automatisch eingeben, wenn Sie das n\u00e4chste Mal diese Web-Site \u00f6ffnen.##M\u00f6chten Sie, dass Passwort-Manager diese Anmeldung speichert?
WantToSavePasswordEncrypted?=Der Passwort-Manager kann diese Anmeldung speichern und automatisch eingeben, wenn Sie das n\u00e4chste Mal diese Web-Site \u00f6ffnen.##M\u00f6chten Sie, dass Passwort-Manager diese Anmeldung speichert?
xWantToSavePasswordObscured?=M\u00f6chten Sie, dass Ihr Benutzername und Ihr Passwort gespeichert werden?##Die gespeicherten Werte werden nicht Passwortgesch\u00fctzt.
xWantToSavePasswordEncrypted?=M\u00f6chten Sie, dass Ihr Benutzername und Ihr Passwort gespeichert werden?##Die gespeicherten Werte werden Passwortgesch\u00fctzt.
#translator's note: # in following line will be converted to linefeed by program
firstPassword=Um empfindliche Informationen zur einmaligen Anmeldung, die auf Ihrer Festplatte abgespeichert sind, zu sch\u00fctzen, wird ein Master-Passwort verwendet.  Zuk\u00fcnftige Versionen werden diese Daten stark verschl\u00fcsseln, um den gr\u00f6\u00dft-m\u00f6glichen Schutz zu erreichen.##W\u00e4hlen Sie ein Master-Passwort.#(Falls Sie kein Master-Passwort verwenden wollen, lassen Sie die Felder leer.)#
password=Geben Sie Ihr Master-Passwort ein.
#translator's note: # in following line will be converted to linefeed by program
newPassword=W\u00e4hlen Sie ein neues Master-Passwort.#(Falls Sie kein Master-Passwort verwenden wollen, lassen Sie die Felder leer.)#
enterPassword=Geben Sie ein Master-Passwort ein.
confirmPassword=Geben Sie das Master-Passwort erneut ein.
confirmFailed_TryAgain?=Die Master-Passw\u00f6rter waren nicht identisch.  Bitte geben Sie das gleiche Master-Passwort in beide Felder ein.
SelectUser=W\u00e4hlen Sie einen Benutzernamen aus, der in das Formular eingegeben wird.
SelectUserWhosePasswordIsBeingChanged=W\u00e4hlen Sie den Benutzer, dessen Passwort ve\u00e4ndert wird.
PasswordNotification=Um es Ihnen leichter zu machen, kann sich der Browser Ihre Benutzernamen und Passw\u00f6rter merken, damit Sie sie in der Zukunft nicht wieder eingeben m\u00fcssen.  Ihre Passw\u00f6rter werden unkenntlich gemacht bevor sie auf Ihrer Festplatte gespeichert werden.  Wollen Sie dies zulassen?
WalletNotification=Sie k\u00f6nnen Informationen, die Sie in Formulare eingeben, speichern und sp\u00e4ter andere Formulare automatisch vervollst\u00e4ndigen lassen.  Um diese Informationen zu speichern, w\u00e4hlen Sie im Men\u00fc  'Bearbeiten' die Option  'Formulardaten' speichern, w\u00e4hrend das Formular angezeigt wird.
noPrefills=Es gibt keine Felder, die vervollst\u00e4ndigt werden k\u00f6nnten.
Never=Nie von dieser Web-Site
Confirm=Best\u00e4tigen
PromptForPassword=Passwort
PromptForData=Abfrage
SaveTheseValuesObscured=Passwort-Manager zum Speichern dieser Werte verwenden.
SaveTheseValuesEncrypted=Passwort-Manager zum Speichern dieser Werte verwenden.
SaveThisValueObscured=Passwort-Manager zum Speichern dieses Wertes verwenden.
SaveThisValueEncrypted=Passwort-Manager zum Speichern dieses Wertes verwenden.
SaveThisPasswordObscured=Passwort-Manager zum Speichern dieses Passworts verwenden.
SaveThisPasswordEncrypted=Passwort-Manager zum Speichern dieses Passworts verwenden.
xSaveTheseValuesObscured=Diese Werte speichern.  Gespeicherte Werte sind nicht Passwortgesch\u00fctzt.
xSaveTheseValuesEncrypted=Diese Werte speichern.  Gespeicherte Werte sind nicht Passwortgesch\u00fctzt.
xSaveThisValueObscured=Diesen Wert speichern.  Gespeicherte Werte sind nicht Passwortgesch\u00fctzt.
xSaveThisValueEncrypted=Diesen Wert speichern.  Gespeicherte Werte sind nicht Passwortgesch\u00fctzt.
UserName=Benutzername
Password=Passwort
SelectUserTitleLine=Benutzer w\u00e4hlen
NoPasswordsEverSaved=Bis jetzt wurden keine Passw\u00f6rter gespeichert.
Captured=Daten wurden kopiert.
NotCaptured=Es gibt nichts zu kopieren.
UnableToCapture=Daten k\u00f6nnen nicht kopiert werden.
Converted=Gespeicherte Daten wurden konvertiert.
AllDataWillBeCleared=Alle gespeicherten Daten werden gel\u00f6scht.
NotConverted=Gespeicherte Daten k\u00f6nnen nicht konvertiert werden.
PasswordNotChanged=Das Passwort, das Ihre sicherheitsrelevanten Daten sch\u00fctzt, konnte nicht ge\u00e4ndert werden.
PasswordExpired=Ihre sicherheitsrelevanten Daten sind jetzt gesperrt.
PasswordNotExpired=Ihre sicherheitsrelevanten Daten konnten nicht gesperrt werden.
Caveat= Speichern von Passw\u00f6rtern und anderen sicherheitsrelevanten Informationen##Der Passwort-Manager und der Formular-Manager speichern Passw\u00f6rter, Benutzernamen und andere sicherheitsrelevante Informationen und geben sie bei Bedarf automatisch ein.#Diese sicherheitsrelevanten Informationen werden auf Ihrem Computer in einer Datei gespeichert, die zu lesen schwierig, jedoch nicht unm\u00f6glich ist.#Wenn andere Personen Zugriff auf Ihren Computer besitzen, sollten Sie die gespeicherten sicherheitsrelevanten Informationen durch ein Master-Passwort sch\u00fctzen.#Wenn Sie Ihre gespeicherten Informationen durch ein Passwort sch\u00fctzen, werden Sie von Zeit zu Zeit dazu aufgefordert, Ihr Master-Passwort einzugeben.  Diese Vorgehensweise bietet gr\u00f6\u00dfere Sicherheit, ist jedoch etwas weniger bequem.
CaveatTitle=Warnung
