{
    "app": {
        "status": {
            "installing": "Installation en arrière-plan...",
            "installComplete": "Installation terminée"
        },
        "installer": {
            "title": "Installateur de Floorp",
            "description": "Installez le navigateur Floorp et commencez une expérience de navigation rapide, personnalisable et respectueuse de la vie privée.",
            "adminRights": "Installer avec les droits d'administration",
            "adminRightsEnabled": "Installer pour tous les utilisateurs disposant des droits d'administration.",
            "adminRightsDisabled": "Installation pour l'utilisateur actuel uniquement.",
            "customPathRequired": "Personnaliser le répertoire d'installation nécessite les droits administrateur.",
            "installLocation": "Emplacement d'installation",
            "change": "Modifier",
            "installButton": "Démarrer l'installation",
            "retryButton": "Réessayer"
        },
        "progress": {
            "installing": "Installation...",
            "slideCounter": "Diapositive {{current}}/{{total}}"
        },
        "modal": {
            "selectLocation": "Sélectionnez un emplacement d'installation",
            "installPath": "Chemin d'installation",
            "browse": "Parcourir",
            "resetDefault": "Rétablissement des valeurs par défaut",
            "cancel": "Annuler",
            "save": "Sauvegarder les paramètres",
            "close": "Fermer"
        },
        "exitConfirmation": {
            "title": "Annuler l'installation ?",
            "message": "L'annulation du processus d'installation empêchera l'installation de Floorp.",
            "cancelButton": "Annuler",
            "confirmButton": "Annuler l'installation"
        },
        "complete": {
            "success": "Installation réussie",
            "error": "Echec de l'installation",
            "launchCheckbox": "Lancez Floorp après l'installation",
            "closeButton": "Fermer l'installateur",
            "countdownMessage": "L'installateur se fermera dans {{count}} secondes",
            "legacyDownloadMessage": "You can also try the legacy installer.",
            "legacyDownloadButton": "Download"
        }
    },
    "slides": {
        "slide1": {
            "title": "Bienvenue sur Floorp",
            "description": "Bienvenue dans la dernière version de Floorp, un navigateur web développé en mettant l'accent sur le développement et la recherche au Japon. Le contenu présenté ci-après n'est qu'une partie du projet."
        },
        "slide2": {
            "title": "Mises à jour régulières",
            "description": "Floorp est maintenu et mis à jour en permanence, même s'il s'agit d'un projet communautaire. Nous offrons une navigation sûre, en accord avec le principe selon lequel le web doit être accessible gratuitement à tous."
        },
        "slide3": {
            "title": "Dernières fonctionnalités",
            "description": "La dernière version de Floorp tire parti des fonctionnalités web de pointe développées par Firefox de Mozilla. Elle a également été repensée pour faciliter l'accès aux outils souhaités par tous."
        },
        "slide4": {
            "title": "Personnalisation avancée",
            "description": "Équipé de nombreuses options de personnalisation pour préserver la confidentialité mieux que votre navigateur par défaut. Floorp vous permet de réaliser votre configuration préférée."
        },
        "slide5": {
            "title": "Se battre pour vous",
            "description": "Floorp bloque le suivi nuisible. Nous équilibrons le fonctionnement du site et les droits des utilisateurs, en travaillant à améliorer la fonctionnalité et la confidentialité du Web."
        }
    },
    "rust": {
        "success": {
            "downloaded_dev_mode": "L'installateur Floorp a été téléchargé (mode développement)",
            "installation_complete": "L'installation de Floorp s'est achevée avec succès."
        },
        "errors": {
            "installer_not_found": "Échec de la récupération du programme d'installation de Floorp.",
            "download_failed": "Une erreur s'est produite pendant le téléchargement : {{0}}",
            "signature_verification_failed": "La vérification de la signature de l'installateur a échoué. L'exécution a été interrompue pour des raisons de sécurité.",
            "signature_verification_error": "Une erreur s'est produite lors de la vérification de la signature : {{0}}",
            "installer_exit_code": "L'installateur s'est arrêté avec le code {{0}}.",
            "installer_execution": "Une erreur s'est produite lors de l'exécution du programme d'installation : {{0}}",
            "browser_not_found": "Le navigateur Floorp n'a pas été trouvé. L'installation a réussi, mais l'exécutable du navigateur n'a pas été trouvé.",
            "browser_launch_failed": "Échec du lancement du navigateur : {{0}}",
            "file_not_found": "Fichier non trouvé : {{0}}",
            "not_a_file": "Le chemin n'est pas un fichier : {{0}}",
            "admin_rights_denied": "Les droits d'administrateur ont été refusés. Vous avez sélectionné le mode de droits d'administrateur, mais l'autorisation a été refusée.",
            "exit_code_not_found": "Impossible d'obtenir le code de sortie du programme d'installation. Les droits d'administrateur peuvent avoir été refusés.",
            "powershell_script_creation": "Échec de la création du script PowerShell : {{0}}",
            "powershell_process": "Échec du démarrage du processus PowerShell : {{0}}",
            "admin_install_failed": "L'installation avec les droits d'administrateur a échoué. Code de sortie : {{0}}",
            "user_installer_launch": "Échec du lancement du processus d'installation avec les droits de l'utilisateur : {{0}}",
            "user_installer_execution": "Un problème est survenu lors de l'exécution du programme d'installation avec les droits d'utilisateur : {{0}}",
            "cpu_not_supported": "Le processeur de cet appareil ne prend pas en charge le SSE4.1. Floorp nécessite un processeur supportant SSE4.1.",
            "cpu_check_failed": "Échec de la vérification de la configuration requise pour le processeur. Veuillez vérifier la configuration requise."
        }
    }
}