#
# The contents of this file are subject to the Mozilla Public
# License Version 1.1 (the "License"); you may not use this file
# except in compliance with the License. You may obtain a copy of
# the License at http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS
# IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
# implied. See the License for the specific language governing
# rights and limitations under the License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is Netscape
# Communications Corporation.  Portions created by Netscape are
# Copyright (C) 1998 Netscape Communications Corporation. All
# Rights Reserved.
#
# Contributor(s):
#

SignedBy=\u7f72\u540d\u8005:%S
CertPassPrompt=PSM \u79d8\u5bc6\u30ad\u30fc \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3 \u30c7\u30d0\u30a4\u30b9\u306e\u30d1\u30fc\u30bd\u30ca\u30eb \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3 \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

#These are for dialogs
#Download Cert dialog
newCAMessage1=\u4ee5\u4e0b\u306e\u76ee\u7684\u3067\u300c%S\u300d\u3092\u4fe1\u983c\u3057\u307e\u3059\u304b\uff1f
unnamedCA=\u8a3c\u660e\u5c40\uff08\u540d\u79f0\u672a\u8a2d\u5b9a\uff09

#For editing cert trust
editTrustWindowTitle=\u8a3c\u660e\u66f8\u4fe1\u983c\u306e\u7de8\u96c6
editTrustCA=\u8a3c\u660e\u66f8\u300c%S\u300d\u306f\u8a8d\u8a3c\u5c40\u3092\u8868\u3057\u307e\u3059\u3002
editTrustSSL=\u8a3c\u660e\u66f8\u300c%S\u300d\u306e\u767a\u884c\u8005:
issuerNotTrusted=\u3053\u306e\u8a3c\u660e\u66f8\u306e\u767a\u884c\u5143\u8a8d\u8a3c\u5c40\u304c\u4fe1\u983c\u306b\u5024\u3057\u306a\u3044\u305f\u3081\u3001\u3053\u3053\u306b\u793a\u3055\u308c\u306a\u3044\u9650\u308a\u3001\u3053\u306e\u8a3c\u660e\u66f8\u306e\u8a8d\u8a3c\u3092\u4fe1\u983c\u3057\u307e\u305b\u3093\u3002
issuerTrusted=\u3053\u306e\u8a3c\u660e\u66f8\u306e\u767a\u884c\u5143\u8a8d\u8a3c\u5c40\u306f\u5341\u5206\u306b\u4fe1\u983c\u306b\u5024\u3059\u308b\u306e\u3067\u3001\u3053\u3053\u306b\u793a\u3055\u308c\u306a\u3044\u9650\u308a\u3001\u3053\u306e\u8a3c\u660e\u66f8\u306e\u8a8d\u8a3c\u3092\u4fe1\u983c\u3057\u307e\u3059\u3002
issuerNotKnown=\u3053\u306e\u8a3c\u660e\u66f8\u306e\u767a\u884c\u5143\u8a8d\u8a3c\u5c40\u304c\u4e0d\u660e\u306a\u305f\u3081\u3001\u3053\u3053\u306b\u793a\u3055\u308c\u306a\u3044\u9650\u308a\u3001\u3053\u306e\u8a3c\u660e\u66f8\u306e\u8a8d\u8a3c\u3092\u4fe1\u983c\u3057\u307e\u305b\u3093\u3002
issuerCertNotFound=\u3053\u306e\u8a8d\u8a3c\u5c40\u306e\u8a3c\u660e\u66f8\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f

#For Deleting Certificates
deleteSslCertFlag=deleteSslFlag
deleteSslCertConfirm=\u3053\u308c\u3089\u306e Web \u30b5\u30a4\u30c8\u8a3c\u660e\u66f8\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
deleteSslCertImpact=Web \u30b5\u30a4\u30c8\u8a3c\u660e\u66f8\u3092\u524a\u9664\u3059\u308b\u3068\u3001\u6b21\u56de\u3053\u306e Web \u30b5\u30a4\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u3068\u304d\u306b\u518d\u3073\u53d7\u3051\u5165\u308c\u3092\u5c0b\u306d\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002
deleteSslCertTitle=Web \u30b5\u30a4\u30c8\u8a3c\u660e\u66f8\u306e\u524a\u9664

deleteUserCertFlag=deleteUserFlag
deleteUserCertConfirm=\u3053\u308c\u3089\u306e\u30b5\u30a4\u30c8\u8a3c\u660e\u66f8\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
deleteUserCertImpact=\u81ea\u5206\u306e\u8eab\u5143\u8a3c\u660e\u66f8\u306e 1 \u3064\u306e\u524a\u9664\u3059\u308b\u3068\u3001\u305d\u306e\u8a3c\u660e\u66f8\u3092\u4f7f\u3063\u3066\u81ea\u5206\u306e\u8eab\u5143\u3092\u8a3c\u660e\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u306a\u304f\u306a\u308a\u307e\u3059\u3002
deleteUserCertTitle=\u8eab\u5206\u8a3c\u660e\u66f8\u306e\u524a\u9664

deleteCaCertFlag=deleteCaFlag
deleteCaCertConfirm=\u3053\u308c\u3089\u306e\u8a8d\u8a3c\u5c40\u306e\u8a3c\u660e\u66f8\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
deleteCaCertImpact=\u8a8d\u8a3c\u5c40\u306e\u8a3c\u660e\u66f8\u3092\u524a\u9664\u3059\u308b\u3068\u3001\u304a\u4f7f\u3044\u306e\u30d6\u30e9\u30a6\u30b6\u306f\u305d\u306e\u8a8d\u8a3c\u5c40\u304b\u3089\u767a\u884c\u3055\u308c\u305f\u3069\u306e\u8a3c\u660e\u66f8\u3082\u4fe1\u983c\u3057\u306a\u304f\u306a\u308a\u307e\u3059\u3002
deleteCaCertTitle=\u8a8d\u8a3c\u5c40\u306e\u8a3c\u660e\u66f8\u306e\u524a\u9664

deleteEmailCertFlag=deleteEmailFlag
deleteEmailCertConfirm=\u3053\u306e\u4eba\u305f\u3061\u306e\u96fb\u5b50\u30e1\u30fc\u30eb\u8a3c\u660e\u66f8\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
deleteEmailCertImpact=\u96fb\u5b50\u30e1\u30fc\u30eb\u8a3c\u660e\u66f8\u3092\u524a\u9664\u3059\u308b\u3068\u3001\u305d\u306e\u4eba\u305f\u3061\u306b\u6697\u53f7\u5316\u3055\u308c\u305f\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u308b\u3053\u3068\u304c\u3067\u304d\u306a\u304f\u306a\u308a\u307e\u3059\u3002
deleteEmailCertTitle=\u96fb\u5b50\u30e1\u30fc\u30eb\u8a3c\u660e\u66f8\u3092\u524a\u9664


#PKCS#12 file dialogs
chooseP12RestoreFileDialog=\u4fdd\u5b58\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d
chooseP12BackupFileDialog=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d

#Mismatch Domain Dialg
mismatchDomainMsg1=\u300c%S\u300d\u3068\u306e\u63a5\u7d9a\u3092\u78ba\u7acb\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u63d0\u793a\u3055\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a3c\u660e\u66f8\u306f\u300c%S\u300d\u306b\u5c5e\u3057\u307e\u3059\u3002\u53ef\u80fd\u6027\u306f\u304b\u306a\u308a\u4f4e\u3044\u3067\u3059\u304c\u3001\u8ab0\u304b\u304c\u3053\u306e Web \u30b5\u30a4\u30c8\u3068\u306e\u63a5\u7d9a\u3092\u59a8\u5bb3\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u3053\u3068\u3082\u8003\u3048\u3089\u308c\u307e\u3059\u3002
mismatchDomainMsg2=\u63d0\u793a\u3055\u308c\u305f\u8a3c\u660e\u66f8\u304c\u300c%S\u300d\u306b\u5c5e\u3059\u308b\u3053\u3068\u306f\u306a\u3044\u3068\u601d\u308f\u308c\u308b\u5834\u5408\u306f\u3001\u63a5\u7d9a\u3092\u30ad\u30e3\u30f3\u30bb\u30eb\u3057\u3001\u30b5\u30a4\u30c8\u306e\u7ba1\u7406\u8005\u306b\u305d\u306e\u65e8\u3092\u77e5\u3089\u305b\u3066\u304f\u3060\u3055\u3044\u3002

#Server Cert expired
serverCertExpiredMsg1=\u300c%S\u300d\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a3c\u660e\u66f8\u3092\u4f7f\u3063\u3066\u9001\u4fe1\u30c7\u30fc\u30bf\u3092\u6697\u53f7\u5316\u3059\u308b\u30b5\u30a4\u30c8\u3067\u3059\u304c\u3001\u305d\u306e\u8a3c\u660e\u66f8\u306f %S \u306b\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u307e\u3059\u3002
serverCertExpiredTitle=\u30b5\u30fc\u30d0\u8a3c\u660e\u66f8\u306e\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u307e\u3057\u305f
serverCertNotYetValedMsg1=\u300c%S\u300d\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a3c\u660e\u66f8\u3092\u4f7f\u3063\u3066\u9001\u4fe1\u30c7\u30fc\u30bf\u3092\u6697\u53f7\u5316\u3059\u308b\u30b5\u30a4\u30c8\u3067\u3059\u304c\u3001\u305d\u306e\u8a3c\u660e\u66f8\u306f %S \u307e\u3067\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
serverCertNotYetValidTitle=\u30b5\u30fc\u30d0\u8a3c\u660e\u66f8\u306f\u307e\u3060\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
serverCertExpiredMsg2=\u304a\u4f7f\u3044\u306e\u30b3\u30f3\u30d4\u30e5\u30fc\u30bf\u306e\u6642\u9593\uff08\u73fe\u5728 %S \u306b\u8a2d\u5b9a\uff09\u304c\u6b63\u3057\u3044\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

#Preferences
resetPreferences=%S\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a2d\u5b9a\u3092\u5de5\u5834\u51fa\u8377\u6642\u306e\u8a2d\u5b9a\u306b\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30dc\u30bf\u30f3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002

#Cert verification
certVerified=\u3053\u306e\u8a3c\u660e\u66f8\u306f\u3001\u4ee5\u4e0b\u306e\u4f7f\u7528\u306b\u5bfe\u3057\u3066\u78ba\u8a8d\u3055\u308c\u3066\u3044\u307e\u3059\u3002
certNotVerified_CertRevoked=\u3053\u306e\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u306e\u8a3c\u660e\u66f8\u306f\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
certNotVerified_CertExpired=\u3053\u306e\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u306e\u8a3c\u660e\u66f8\u306f\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u307e\u3059\u3002
certNotVerified_CertNotTrusted=\u3053\u306e\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u306e\u8a3c\u660e\u66f8\u306f\u4fe1\u983c\u3067\u304d\u307e\u305b\u3093\u3002
certNotVerified_IssuerNotTrusted=\u3053\u306e\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u306e\u767a\u884c\u8005\u306f\u4fe1\u983c\u3067\u304d\u307e\u305b\u3093\u3002
certNotVerified_IssuerUnknown=\u3053\u306e\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u306e\u767a\u884c\u8005\u306f\u4e0d\u660e\u3067\u3059\u3002
certNotVerified_CAInvalid=\u3053\u306e\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u306e\u8a8d\u8a3c\u5c40\u306e\u8a3c\u660e\u66f8\u306f\u7121\u52b9\u3067\u3059\u3002
certNotVerified_Unknown=\u4f55\u304b\u306e\u7406\u7531\u306b\u3088\u308a\u3001\u3053\u306e\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

#Client auth
clientAuthMessage1=\u7d44\u7e54:\u300c%S\u300d
clientAuthMessage2=\u767a\u884c:\u300c%S\u300d

#Page Info
pageInfo_SiteNotVerified=Web \u30b5\u30a4\u30c8\u306e\u8b58\u5225\u60c5\u5831\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
pageInfo_WebSiteVerified=Web \u30b5\u30a4\u30c8\u306e\u8b58\u5225\u60c5\u5831\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f
pageInfo_Identity_Verified=Web \u30b5\u30a4\u30c8 %S \u306f\u8868\u793a\u4e2d\u306e\u30da\u30fc\u30b8\u306b\u5bfe\u3059\u308b\u8a8d\u8a3c\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u306e Web \u30b5\u30a4\u30c8\u306e\u8b58\u5225\u60c5\u5831\u306f\u3001\u3053\u306e\u76ee\u7684\u306b\u5bfe\u3057\u3066\u4fe1\u983c\u3067\u304d\u308b\u8a8d\u8a3c\u5c40 %S \u306b\u3088\u3063\u3066\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002
pageInfo_ViewCertificate=\u3053\u306e Web \u30b5\u30a4\u30c8\u306e\u8b58\u5225\u60c5\u5831\u3092\u78ba\u8a8d\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a3c\u660e\u66f8\u3092\u8868\u793a\u3002
pageInfo_NoEncryption=\u63a5\u7d9a\u304c\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u307e\u305b\u3093
pageInfo_Privacy_None1=Web \u30b5\u30a4\u30c8 %S \u306f\u8868\u793a\u4e2d\u306e\u30da\u30fc\u30b8\u306b\u5bfe\u3059\u308b\u6697\u53f7\u5316\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
pageInfo_Privacy_None2=\u6697\u53f7\u5316\u3055\u308c\u305a\u306b\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u4e0a\u3067\u9001\u3089\u308c\u308b\u60c5\u5831\u306f\u3001\u305d\u306e\u9001\u4fe1\u4e2d\u306b\u4ed6\u4eba\u306e\u76ee\u306b\u89e6\u308c\u308b\u5371\u967a\u6027\u304c\u3042\u308a\u307e\u3059\u3002
pageInfo_Privacy_None3=\u8868\u793a\u4e2d\u306e\u30da\u30fc\u30b8\u306f\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
pageInfo_StrongEncryption=\u63a5\u7d9a\u304c\u6697\u53f7\u5316\u3055\u308c\u307e\u3057\u305f:\u5f37\u5ea6\u306e\u9ad8\u3044\u6697\u53f7\u5316\uff08%S %S \u30d3\u30c3\u30c8\uff09
pageInfo_Privacy_Strong1=\u8868\u793a\u4e2d\u306e\u30da\u30fc\u30b8\u306f\u3001\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u4e0a\u306b\u9001\u4fe1\u3055\u308c\u308b\u524d\u306b\u6697\u53f7\u5316\u3055\u308c\u307e\u3057\u305f\u3002
pageInfo_Privacy_Strong2=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u4e0a\u3067\u79fb\u52d5\u3059\u308b\u60c5\u5831\u3092\u6697\u53f7\u5316\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u3001\u975e\u8a8d\u53ef\u306e\u30e6\u30fc\u30b6\u306f\u305d\u308c\u3089\u306e\u60c5\u5831\u3092\u8868\u793a\u3057\u306b\u304f\u304f\u306a\u308a\u307e\u3059\u3002\u305d\u306e\u305f\u3081\u3001\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u5185\u3067\u8ab0\u304b\u304c\u3053\u306e\u30da\u30fc\u30b8\u3092\u8aad\u3093\u3060\u53ef\u80fd\u6027\u306f\u307b\u3068\u3093\u3069\u3042\u308a\u307e\u305b\u3093\u3002
pageInfo_WeakEncryption=\u63a5\u7d9a\u304c\u6697\u53f7\u5316\u3055\u308c\u307e\u3057\u305f:\u5f37\u5ea6\u306e\u4f4e\u3044\u6697\u53f7\u5316\uff08%S %S \u30d3\u30c3\u30c8\uff09
pageInfo_Privacy_Weak1=Web \u30b5\u30a4\u30c8 %S \u306f\u8868\u793a\u4e2d\u306e\u30da\u30fc\u30b8\u306b\u5bfe\u3057\u3066\u5f37\u5ea6\u306e\u4f4e\u3044\u6697\u53f7\u5316\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002
pageInfo_Privacy_Weak2=\u5f37\u5ea6\u306e\u4f4e\u3044\u6697\u53f7\u5316\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u3053\u306e\u60c5\u5831\u306f\u975e\u8a8d\u53ef\u306e\u30e6\u30fc\u30b6\u306b\u3088\u3063\u3066\u898b\u3089\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

#Cert Viewer
certDetails=\u8a3c\u660e\u66f8\u30d3\u30e5\u30fc\u30a2:
notPresent=<\u8a3c\u660e\u66f8\u306e\u4e00\u90e8\u3067\u306f\u3042\u308a\u307e\u305b\u3093>
unknownIssuer=<\u767a\u884c\u8005\u304c\u4e0d\u660e\u3067\u3059>

escrowFinalMessage=\u300c%S\u300d\u3092\u4fe1\u983c\u3057\u3066\u6697\u53f7\u5316\u79d8\u5bc6\u30ad\u30fc\u3092\u4fdd\u8b77\u3059\u308b\u5834\u5408\u306b\u306e\u307f\uff3bOK\uff3d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002

#Token Manager
password_not_set=(\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093)
failed_pw_change=\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
incorrect_pw=\u73fe\u5728\u306e\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u6b63\u3057\u304f\u5165\u529b\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3082\u3046\u4e00\u5ea6\u8a66\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
pw_change_ok=\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
pw_erased_ok=\u8b66\u544a\uff01 \u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u524a\u9664\u3057\u307e\u3057\u305f\u3002
pw_not_wanted=\u8b66\u544a\uff01 \u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4f7f\u7528\u3057\u306a\u3044\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
pw_empty_warning=\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b Web \u30d1\u30b9\u30ef\u30fc\u30c9\u3001\u96fb\u5b50\u30e1\u30fc\u30eb \u30d1\u30b9\u30ef\u30fc\u30c9\u3001\u30d5\u30a9\u30fc\u30e0 \u30c7\u30fc\u30bf\u3001\u304a\u3088\u3073\u79d8\u5bc6\u30ad\u30fc\u306f\u4fdd\u8b77\u3055\u308c\u307e\u305b\u3093\u3002
login_failed=\u30ed\u30b0\u30a4\u30f3\u306b\u5931\u6557
loadPK11TokenDialog=\u8aad\u307f\u8fbc\u3080 PKCS#11 \u30c7\u30d0\u30a4\u30b9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044
devinfo_modname=\u30e2\u30b8\u30e5\u30fc\u30eb
devinfo_modpath=\u30d1\u30b9
devinfo_label=\u30e9\u30d9\u30eb
devinfo_manID=\u88fd\u9020\u5143
devinfo_serialnum=\u30b7\u30ea\u30a2\u30eb\u756a\u53f7
devinfo_hwversion=HW \u30d0\u30fc\u30b8\u30e7\u30f3
devinfo_fwversion=FW \u30d0\u30fc\u30b8\u30e7\u30f3
devinfo_status=\u72b6\u614b
devinfo_desc=\u8aac\u660e
devinfo_stat_disabled=\u4f7f\u7528\u3057\u3066\u3044\u307e\u305b\u3093
devinfo_stat_notpresent=\u5b58\u5728\u3057\u307e\u305b\u3093
devinfo_stat_uninitialized=\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u307e\u305b\u3093
devinfo_stat_notloggedin=\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u3044\u307e\u305b\u3093
devinfo_stat_loggedin=\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u3044\u307e\u3059
devinfo_stat_ready=\u6e96\u5099\u5b8c\u4e86
enable_fips=FIPS \u3092\u4f7f\u7528\u3059\u308b
disable_fips=FIPS \u3092\u4f7f\u7528\u3057\u306a\u3044

#device manager: load device dlg
device.loaddlg.width=350
device.loaddlg.height=200

certmgr.verified=\u78ba\u8a8d\u6e08\u307f
certmgr.verifiedNoOCSP=\u78ba\u8a8d\u6e08\u307f\uff08OCSP \u306a\u3057\uff09

# CRL next update.
crlNextUpdateMsg1=%S \u304c\u300c%S\u300d\u3068\u306e\u6697\u53f7\u5316\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3002
crlNextUpdateMsg2=\u300c%S\u300d\u304b\u3089\u306e\u8a3c\u660e\u66f8\u5ec3\u68c4\u30ea\u30b9\u30c8\uff08CRL\uff09\u3092\u66f4\u65b0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
NoUpdateFailure=\u306a\u3057
lastFetchUrlLabel=\u6700\u521d\u306b\u53d6\u308a\u8fbc\u307e\u308c\u305f URL
advertisedUrlLabel=\u8a8d\u8a3c\u5c40\u306b\u3088\u3063\u3066\u516c\u8868\u3055\u308c\u305f URL
CrlUpdatePrefsSetConfirmation = \u81ea\u52d5\u66f4\u65b0\u306e\u8a2d\u5b9a\u306f\u3001\u30d6\u30e9\u30a6\u30b6\u3092\u518d\u8d77\u52d5\u3057\u305f\u3068\u304d\u306b\u53cd\u6620\u3055\u308c\u307e\u3059\u3002
crlAutoUpdateDayCntError=\u6b21\u306e\u66f4\u65b0\u307e\u3067\u306e\u65e5\u6570\u306f\u30bc\u30ed\u3088\u308a\u5927\u304d\u3044\u6570\u5024\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
crlAutoUpdtaeFreqCntError=\u66f4\u65b0\u306e\u983b\u5ea6\u306f\u30bc\u30ed\u3088\u308a\u5927\u304d\u3044\u6570\u5024\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
disabledStatement=\u81ea\u52d5\u66f4\u65b0\u306f\u3053\u306e CRL \u306b\u5bfe\u3057\u3066\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093\u3002
enabledStatement=\u81ea\u52d5\u66f4\u65b0\u306f\u3053\u306e CRL \u306b\u5bfe\u3057\u3066\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
crlAutoupdateQuestion1=\u81ea\u52d5\u66f4\u65b0\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u304b\uff1f
crlAutoupdateQuestion2=\u81ea\u52d5\u66f4\u65b0\u306e\u8a2d\u5b9a\u3092\u8868\u793a\u3057\u307e\u3059\u304b\uff1f
undefinedValStr=<\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093>
undefinedURL=\u81ea\u52d5\u66f4\u65b0\u306e URL \u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
yesButton=\u306f\u3044
noButton=\u3044\u3044\u3048
resetPasswordButtonLabel=\u30ea\u30bb\u30c3\u30c8
resetPasswordConfirmationTitle=\u30de\u30b9\u30bf\u30fc \u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u30ea\u30bb\u30c3\u30c8
resetPasswordConfirmationMessage=\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u30ea\u30bb\u30c3\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
crlAutoupdateEnabled= \u6709\u52b9\u3067\u3059
crlAutoupdateNotEnabled=\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
crlAutoupdateOk= OK
crlAutoupdateFailed=\u5931\u6557\u3057\u307e\u3057\u305f
