> foo
analyze(foo) =  st:foo id:1
analyze(foo) =  st:foo id:3
stem(foo) = foo
> bar
analyze(bar) =  st:bar
stem(bar) = bar
> foobar
analyze(foobar) =  pa:foo st:foo id:3 pa:bar
stem(foobar) = foo
> barfoo
analyze(barfoo) =  pa:bar st:bar pa:foo st:foo id:3
stem(barfoo) = barfoo
