<?xml version='1.0' encoding='utf-8'?>
<resources>
  <string name="action_cancel">रद्द करें</string>
  <string name="action_ok">ठीक है</string>
  <string name="urlbar_hint">खोजें या पता दर्ज करें</string>
  <string name="teaser">स्वचालित निजी ब्राउज़िंग. ब्राउज़ करें. मिटाएँ. दोहराएँ.</string>
  <string name="feedback_erase">आपका ब्राउज़िंग इतिहास मिटा दिया गया है.</string>
  <string name="search_hint">%1$s लिए खोजें</string>
  <string name="menu_share">साझा करें…</string>
  <string name="menu_open_with_default_browser">%1$s के साथ खोलें</string>
  <string name="menu_open_with_a_browser">इसके साथ खोलें…</string>
  <string name="menu_settings">सेटिंग्स</string>
  <string name="menu_about">के बारे में</string>
  <string name="menu_help">सहायता</string>
  <string name="menu_rights">आपके अधिकार</string>
  <string name="about_content"><![CDATA[<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">%1$s &#2310;&#2346;&#2325;&#2379; &#2344;&#2367;&#2351;&#2306;&#2340;&#2381;&#2352;&#2339; &#2350;&#2375;&#2306; &#2352;&#2326;&#2340;&#2366; &#2361;&#2376;.</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"&#2311;&#2360;&#2375; &#2319;&#2325; &#2344;&#2367;&#2332;&#2368; &#2348;&#2381;&#2352;&#2366;&#2313;&#2332;&#2364;&#2352; &#2325;&#2375; &#2352;&#2370;&#2346; &#2350;&#2375;&#2306; &#2346;&#2381;&#2352;&#2351;&#2379;&#2327; &#2325;&#2352;&#2375;&#2306;:\n  "<ul>"\n    "<li>&#2320;&#2346; &#2350;&#2375;&#2306; &#2342;&#2366;&#2361;&#2367;&#2344;&#2368; &#2323;&#2352; &#2326;&#2379;&#2332;&#2375;&#2306; &#2324;&#2352; &#2348;&#2381;&#2352;&#2366;&#2313;&#2332; &#2325;&#2352;&#2375;&#2306;</li>"\n    "<li>&#2335;&#2381;&#2352;&#2376;&#2325;&#2352;&#2381;&#2360; &#2309;&#2357;&#2352;&#2369;&#2342;&#2381;&#2343; &#2325;&#2352;&#2375;&#2306; (&#2351;&#2366; &#2335;&#2381;&#2352;&#2376;&#2325;&#2352;&#2381;&#2360; &#2325;&#2379; &#2309;&#2344;&#2369;&#2350;&#2340;&#2367; &#2342;&#2375;&#2344;&#2375; &#2325;&#2375; &#2354;&#2367;&#2319; &#2360;&#2375;&#2335;&#2367;&#2306;&#2327;&#2381;&#2360; &#2309;&#2346;&#2337;&#2375;&#2335; &#2325;&#2352;&#2375;&#2306;)</li>"\n    "<li>&#2325;&#2369;&#2325;&#2368;&#2332;&#2364; &#2325;&#2375; &#2360;&#2366;&#2341; &#2326;&#2379;&#2332; &#2324;&#2352; &#2348;&#2381;&#2352;&#2366;&#2313;&#2332;&#2364;&#2367;&#2306;&#2327; &#2311;&#2340;&#2367;&#2361;&#2366;&#2360; &#2361;&#2335;&#2366;&#2344;&#2375; &#2325;&#2375; &#2354;&#2367;&#2319; &#2350;&#2367;&#2335;&#2366;&#2319;&#2305;</li>"\n  "</ul>\n</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">%1$s &#2350;&#2379;&#2332;&#2364;&#2367;&#2354;&#2366; &#2342;&#2381;&#2357;&#2366;&#2352;&#2366; &#2344;&#2367;&#2352;&#2381;&#2350;&#2367;&#2340; &#2361;&#2376;. &#2361;&#2350;&#2366;&#2352;&#2366; &#2350;&#2367;&#2358;&#2344; &#2319;&#2325; &#2360;&#2381;&#2357;&#2360;&#2381;&#2341;, &#2313;&#2344;&#2381;&#2350;&#2369;&#2325;&#2381;&#2340; &#2311;&#2306;&#2335;&#2352;&#2344;&#2375;&#2335; &#2325;&#2379; &#2348;&#2338;&#2364;&#2366;&#2357;&#2366; &#2342;&#2375;&#2344;&#2366; &#2361;&#2376;.<br/>\n<a href="%2$s">&#2324;&#2352; &#2332;&#2366;&#2344;&#2375;&#2306;</a></p>]]></string>
  <string name="preference_category_search">खोजें</string>
  <string name="preference_search_engine_default">मूलभूत</string>
  <string name="preference_dialog_title_search_engine">तयशुदा खोज़</string>
  <string name="preference_category_privacy">गोपनीयता</string>
  <string name="preference_privacy_block_ads">विज्ञापन ट्रैकर्स को अवरुद्ध करें</string>
  <string name="preference_privacy_block_analytics">विश्लेषणात्मक ट्रैकर्स को अवरुद्ध करें</string>
  <string name="preference_privacy_block_social">सामाजिक ट्रैकर्स को अवरुद्ध करें</string>
  <string name="preference_privacy_block_content">अन्य सामग्री ट्रैकर्स को अवरुद्ध करें</string>
  <string name="preference_privacy_block_content_summary">कुछ वीडियो और वेब पृष्ठ भंग हो सकते हैं</string>
  <string name="preference_category_performance">प्रदर्शन</string>
  <string name="preference_performance_block_webfonts">वेब लिपियों को अवरुद्ध करें</string>
  <string name="preference_performance_block_webfonts_summary">अनुपस्थित प्रतीकों या छवियों के रूप में परिणाम हो सकता है</string>
  <string name="preference_performance_block_images">चित्रों को बाधित करें</string>
  <string name="preference_default_browser">तयशुदा ब्राउज़र बनाएँ</string>
  <string name="preference_category_mozilla">Mozilla</string>
  <string name="preference_mozilla_telemetry">अज्ञात उपयोग आंकड़ा भेजें</string>
  <string name="preference_mozilla_telemetry_summary">और अधिक जानें</string>
  <string name="preference_about">%1$s के बारे में</string>
  <string name="content_description_clear_input">इनपुट मिटाएँ</string>
  <string name="content_description_dismiss_input">निरस्त करें</string>
  <string name="content_description_erase">ब्राउज़िंग इतिहास मिटाएँ</string>
  <string name="content_description_lock">सुरक्षित संपर्क</string>
  <string name="accessibility_announcement_loading">लोड हो रहा है</string>
  <string name="accessibility_announcement_loading_finished">वेबसाइट लोड हो गया</string>
  <string name="content_description_menu">अधिक विकल्प</string>
  <string name="content_description_forward">आगे मार्गनिर्देशित करें</string>
  <string name="content_description_reload">वेबसाइट फिर से लोड करें</string>
  <string name="content_description_back">पीछे मार्गनिर्देशित करें</string>
  <string name="content_description_stop">वेबसाइट लोड करना रोकें</string>
  <string name="context_menu_paste_go">पेस्ट करें व जाएँ</string>
  <string name="your_rights">आपके अधिकार</string>
  <string name="external_app_prompt_title">किसी अन्य अनुप्रयोग में लिंक खोलें</string>
  <string name="external_app_prompt">आप इस लिंक को %2$s में खोलने के लिए %1$s को छोड़ सकते हैं.</string>
  <string name="external_app_prompt_no_app_title">एक ऐप ढूंढें जो लिंक खोल सकता है</string>
  <string name="external_app_prompt_no_app">आपके डिवाइस पर मौजूद कोई ऐप इस लिंक को खोलने में सक्षम नहीं है. आप एक एप के लिए %2$s की खोज हेतु %1$s को छोड़ सकते हैं जो कर सकता है.</string>
  <string name="external_multiple_apps_matched_exit">निजी ब्राउज़िंग से बाहर निकलें?</string>
  <string name="errorpage_title">पृष्ठ की लोडिंग में समस्या</string>
  <string name="errorpage_refresh">पुन: प्रयास करें</string>
  <string name="error_connectionfailure_title">संपर्क करने में असमर्थ</string>
  <string name="error_connectionfailure_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li>&#2351;&#2361; &#2360;&#2366;&#2311;&#2335; &#2309;&#2360;&#2381;&#2341;&#2366;&#2312; &#2352;&#2370;&#2346; &#2360;&#2375; &#2309;&#2344;&#2369;&#2346;&#2354;&#2348;&#2381;&#2343; &#2351;&#2366; &#2348;&#2361;&#2369;&#2340; &#2357;&#2381;&#2351;&#2360;&#2381;&#2340; &#2361;&#2379; &#2360;&#2325;&#2340;&#2366; &#2361;&#2376;. &#2325;&#2369;&#2331; &#2361;&#2368; &#2325;&#2381;&#2359;&#2339;&#2379;&#2306; &#2350;&#2375;&#2306; &#2347;&#2367;&#2352; &#2360;&#2375; &#2346;&#2381;&#2352;&#2351;&#2366;&#2360; &#2325;&#2352;&#2375;&#2306;.</li>"\n        "<li>&#2351;&#2342;&#2367; &#2310;&#2346; &#2325;&#2379;&#2312; &#2346;&#2371;&#2359;&#2381;&#2336; &#2354;&#2379;&#2337; &#2325;&#2352;&#2344;&#2375; &#2350;&#2375;&#2306; &#2309;&#2360;&#2350;&#2352;&#2381;&#2341; &#2361;&#2376;&#2306;, &#2340;&#2379; &#2309;&#2346;&#2344;&#2375; &#2350;&#2379;&#2348;&#2366;&#2311;&#2354; &#2313;&#2346;&#2325;&#2352;&#2339; &#2325;&#2375; &#2337;&#2375;&#2335;&#2366; &#2351;&#2366; &#2357;&#2366;&#2312;-&#2347;&#2366;&#2312; &#2325;&#2344;&#2375;&#2325;&#2381;&#2358;&#2344; &#2325;&#2368; &#2332;&#2366;&#2305;&#2330; &#2325;&#2352;&#2375;&#2306;.</li>"\n      "</ul>]]></string>
  <string name="error_timeout_title">संपर्क समयबाह्य हो गया</string>
  <string name="error_hostLookup_title">सर्वर नहीं मिला</string>
  <string name="error_hostLookup_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li><strong>ww</strong>"&#2332;&#2376;&#2360;&#2368; &#2354;&#2367;&#2326;&#2367;&#2340; &#2340;&#2381;&#2352;&#2369;&#2335;&#2367;&#2351;&#2379;&#2306; &#2325;&#2375; &#2354;&#2367;&#2319; &#2346;&#2340;&#2375; &#2325;&#2368; &#2332;&#2366;&#2305;&#2330; &#2325;&#2352;&#2375;&#2306;. "<strong>www</strong>&#2325;&#2375; &#2348;&#2332;&#2366;&#2351; example.com. example.com</li>"\n        "<li>&#2351;&#2342;&#2367; &#2310;&#2346; &#2325;&#2367;&#2360;&#2368; &#2349;&#2368; &#2346;&#2371;&#2359;&#2381;&#2336; &#2354;&#2379;&#2337; &#2325;&#2352;&#2344;&#2375; &#2350;&#2375;&#2306; &#2309;&#2360;&#2350;&#2352;&#2381;&#2341; &#2361;&#2376;&#2306;, &#2340;&#2379; &#2309;&#2346;&#2344;&#2375; &#2313;&#2346;&#2325;&#2352;&#2339; &#2325;&#2375; &#2337;&#2375;&#2335;&#2366; &#2351;&#2366; &#2357;&#2366;&#2312;-&#2347;&#2366;&#2312; &#2325;&#2344;&#2375;&#2325;&#2381;&#2358;&#2344; &#2325;&#2368; &#2332;&#2366;&#2305;&#2330; &#2325;&#2352;&#2375;&#2306;&#2404;</li>"\n      "</ul>]]></string>
  <string name="error_malformedURI_title">पता वैध नहीं है</string>
  <string name="error_malformedURI_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>"&#2357;&#2375;&#2348; &#2346;&#2340;&#2375; &#2310;&#2350;&#2340;&#2380;&#2352; &#2346;&#2352; "<strong>http://www.example.com/</strong>" &#2325;&#2368; &#2340;&#2352;&#2361; &#2354;&#2367;&#2326;&#2375; &#2361;&#2379;&#2340;&#2375; &#2361;&#2376;&#2306;"</li>"\n  "<li>"&#2360;&#2369;&#2344;&#2367;&#2358;&#2381;&#2330;&#2367;&#2340; &#2325;&#2352;&#2375;&#2306; &#2325;&#2367; &#2310;&#2346; &#2309;&#2327;&#2381;&#2352;&#2340;&#2367;&#2351;&#2325; &#2360;&#2381;&#2354;&#2376;&#2358; &#2325;&#2366; &#2313;&#2346;&#2351;&#2379;&#2327; &#2325;&#2352; &#2352;&#2361;&#2375; &#2361;&#2376;&#2306; (&#2351;&#2366;&#2344;&#2368; "<strong>/</strong>).</li>\n</ul>]]></string>
  <string name="error_redirectLoop_title">पृष्ठ ठीक से पुनर्निर्देशित नहीं हो रहा है</string>
  <string name="error_redirectLoop_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#2325;&#2349;&#2368;-&#2325;&#2349;&#2368; &#2311;&#2360; &#2360;&#2350;&#2360;&#2381;&#2351;&#2366; &#2325;&#2366; &#2325;&#2366;&#2352;&#2339; &#2325;&#2369;&#2325;&#2368;&#2332;&#2364; &#2325;&#2379; &#2360;&#2381;&#2357;&#2368;&#2325;&#2366;&#2352; &#2325;&#2352;&#2344;&#2375; &#2360;&#2375; &#2350;&#2344;&#2366; &#2325;&#2352;&#2344;&#2366; &#2351;&#2366; &#2309;&#2325;&#2381;&#2359;&#2350; &#2325;&#2352;&#2344;&#2366; &#2361;&#2379; &#2360;&#2325;&#2340;&#2366; &#2361;&#2376;.</li>\n</ul>]]></string>
  <string name="error_unsupportedprotocol_title">पता समझा नहीं गया था</string>
  <string name="error_unsupportedprotocol_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#2310;&#2346;&#2325;&#2379; &#2311;&#2360; &#2346;&#2340;&#2375; &#2325;&#2379; &#2326;&#2379;&#2354;&#2344;&#2375; &#2325;&#2375; &#2354;&#2367;&#2319; &#2309;&#2344;&#2381;&#2351; &#2360;&#2377;&#2347;&#2364;&#2381;&#2335;&#2357;&#2375;&#2351;&#2352; &#2360;&#2306;&#2360;&#2381;&#2341;&#2366;&#2346;&#2367;&#2340; &#2325;&#2352;&#2344;&#2375; &#2325;&#2368; &#2310;&#2357;&#2358;&#2381;&#2351;&#2325;&#2340;&#2366; &#2361;&#2379; &#2360;&#2325;&#2340;&#2368; &#2361;&#2376;.</li>\n</ul>]]></string>
  <string name="error_sslhandshake_title">सुरक्षित संपर्क विफ़ल</string>
  <string name="error_sslhandshake_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#2351;&#2361; &#2360;&#2352;&#2381;&#2357;&#2352; &#2325;&#2375; &#2325;&#2377;&#2344;&#2381;&#2347;&#2364;&#2367;&#2327;&#2352;&#2375;&#2358;&#2344; &#2350;&#2375;&#2306; &#2319;&#2325; &#2360;&#2350;&#2360;&#2381;&#2351;&#2366; &#2361;&#2379; &#2360;&#2325;&#2340;&#2368; &#2361;&#2376;, &#2351;&#2366; &#2351;&#2361; &#2361;&#2379; &#2360;&#2325;&#2340;&#2366; &#2361;&#2376;\n&#2325;&#2379;&#2312; &#2360;&#2352;&#2381;&#2357;&#2352; &#2325;&#2366; &#2346;&#2381;&#2352;&#2340;&#2367;&#2352;&#2370;&#2346;&#2339; &#2325;&#2352;&#2344;&#2375; &#2325;&#2366; &#2346;&#2381;&#2352;&#2351;&#2366;&#2360; &#2325;&#2352; &#2352;&#2361;&#2366; &#2361;&#2376;.</li>"\n  "<li>&#2309;&#2327;&#2352; &#2310;&#2346; &#2346;&#2370;&#2352;&#2381;&#2357; &#2350;&#2375;&#2306; &#2311;&#2360; &#2360;&#2352;&#2381;&#2357;&#2352; &#2360;&#2375; &#2360;&#2347;&#2354;&#2340;&#2366;&#2346;&#2370;&#2352;&#2381;&#2357;&#2325; &#2332;&#2369;&#2396; &#2330;&#2369;&#2325;&#2375; &#2361;&#2376;, &#2340;&#2379; &#2340;&#2381;&#2352;&#2369;&#2335;&#2367; &#2309;&#2360;&#2381;&#2341;&#2366;&#2351;&#2368; &#2361;&#2379; &#2360;&#2325;&#2340;&#2368; &#2361;&#2376;, &#2324;&#2352; &#2310;&#2346; &#2348;&#2366;&#2342; &#2350;&#2375;&#2306; &#2346;&#2369;&#2344;&#2307; &#2346;&#2381;&#2352;&#2351;&#2366;&#2360; &#2325;&#2352; &#2360;&#2325;&#2340;&#2375; &#2361;&#2376;&#2306;.</li>\n</ul>]]></string>
  <string name="error_generic_title">ओह</string>
  <string name="error_generic_message">हम किसी कारण से इस पृष्ठ लोड को नहीं कर सकते.</string>
</resources>
