<?xml version='1.0' encoding='utf-8'?>
<resources>
  <string name="action_cancel">ยกเลิก</string>
  <string name="action_ok">ตกลง</string>
  <string name="urlbar_hint">ค้นหาหรือป้อนที่อยู่</string>
  <string name="teaser">การท่องเว็บแบบส่วนตัวอัตโนมัติ\nท่องเว็บ ล้าง ทำซ้ำ</string>
  <string name="feedback_erase">ล้างประวัติการท่องเว็บของคุณแล้ว</string>
  <string name="search_hint">ค้นหาสำหรับ %1$s</string>
  <string name="menu_share">แบ่งปัน…</string>
  <string name="menu_open_with_default_browser">เปิดด้วย %1$s</string>
  <string name="menu_open_with_a_browser">เปิดด้วย…</string>
  <string name="menu_settings">การตั้งค่า</string>
  <string name="menu_about">เกี่ยวกับ</string>
  <string name="menu_help">ช่วยเหลือ</string>
  <string name="menu_rights">สิทธิของคุณ</string>
  <string name="menu_trackers_blocked_title">ตัวติดตามที่ถูกปิดกั้น</string>
  <string name="share_dialog_title">แบ่งปันผ่าน</string>
  <string name="notification_erase_text">ล้างประวัติการท่องเว็บ</string>
  <string name="shortcut_erase_short_label">ล้าง</string>
  <string name="shortcut_erase_long_label">ล้างประวัติการท่องเว็บ</string>
  <string name="text_selection_search_action">การค้นหาแบบส่วนตัว</string>
  <string name="about_content"><![CDATA[<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">%1$s &#3651;&#3627;&#3657;&#3588;&#3640;&#3603;&#3652;&#3604;&#3657;&#3588;&#3623;&#3610;&#3588;&#3640;&#3617;</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"&#3651;&#3594;&#3657;&#3648;&#3611;&#3655;&#3609;&#3648;&#3610;&#3619;&#3634;&#3623;&#3660;&#3648;&#3595;&#3629;&#3619;&#3660;&#3626;&#3656;&#3623;&#3609;&#3605;&#3633;&#3623;:\n  "<ul>"\n    "<li>&#3588;&#3657;&#3609;&#3627;&#3634;&#3649;&#3621;&#3632;&#3607;&#3656;&#3629;&#3591;&#3648;&#3623;&#3655;&#3610;&#3592;&#3634;&#3585;&#3651;&#3609;&#3649;&#3629;&#3611;</li>"\n    "<li>&#3611;&#3636;&#3604;&#3585;&#3633;&#3657;&#3609;&#3605;&#3633;&#3623;&#3605;&#3636;&#3604;&#3605;&#3634;&#3617; (&#3627;&#3619;&#3639;&#3629;&#3629;&#3633;&#3611;&#3648;&#3604;&#3605;&#3585;&#3634;&#3619;&#3605;&#3633;&#3657;&#3591;&#3588;&#3656;&#3634;&#3648;&#3614;&#3639;&#3656;&#3629;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;&#3605;&#3633;&#3623;&#3605;&#3636;&#3604;&#3605;&#3634;&#3617;)</li>"\n    "<li>&#3621;&#3657;&#3634;&#3591;&#3648;&#3614;&#3639;&#3656;&#3629;&#3621;&#3610;&#3588;&#3640;&#3585;&#3585;&#3637;&#3657;&#3619;&#3623;&#3617;&#3607;&#3633;&#3657;&#3591;&#3611;&#3619;&#3632;&#3623;&#3633;&#3605;&#3636;&#3585;&#3634;&#3619;&#3588;&#3657;&#3609;&#3627;&#3634;&#3649;&#3621;&#3632;&#3585;&#3634;&#3619;&#3607;&#3656;&#3629;&#3591;&#3648;&#3623;&#3655;&#3610;</li>"\n  "</ul>\n</p>\n<p xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">%1$s &#3606;&#3641;&#3585;&#3626;&#3619;&#3657;&#3634;&#3591;&#3586;&#3638;&#3657;&#3609;&#3650;&#3604;&#3618; Mozilla &#3616;&#3634;&#3619;&#3585;&#3636;&#3592;&#3586;&#3629;&#3591;&#3648;&#3619;&#3634;&#3588;&#3639;&#3629;&#3626;&#3656;&#3591;&#3648;&#3626;&#3619;&#3636;&#3617;&#3629;&#3636;&#3609;&#3648;&#3607;&#3629;&#3619;&#3660;&#3648;&#3609;&#3655;&#3605;&#3607;&#3637;&#3656;&#3626;&#3617;&#3610;&#3641;&#3619;&#3603;&#3660;&#3649;&#3621;&#3632;&#3648;&#3611;&#3636;&#3604;&#3585;&#3623;&#3657;&#3634;&#3591;<br/>\n<a href="%2$s">&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3648;&#3614;&#3636;&#3656;&#3617;&#3648;&#3605;&#3636;&#3617;</a></p>]]></string>
  <string name="preference_category_search">ค้นหา</string>
  <string name="preference_search_engine_default">ค่าเริ่มต้น</string>
  <string name="preference_language">ภาษา</string>
  <string name="preference_language_systemdefault">ค่าเริ่มต้นของระบบ</string>
  <string name="preference_dialog_title_search_engine">การค้นหาเริ่มต้น</string>
  <string name="preference_category_privacy">ความเป็นส่วนตัว</string>
  <string name="preference_privacy_block_ads">ปิดกั้นตัวติดตามของโฆษณา</string>
  <string name="preference_privacy_block_analytics">ปิดกั้นตัวติดตามของการวิเคราะห์</string>
  <string name="preference_privacy_block_social">ปิดกั้นตัวติดตามทางสังคม</string>
  <string name="preference_privacy_block_content">ปิดกั้นตัวติดตามของเนื้อหาอื่น ๆ</string>
  <string name="preference_privacy_block_content_summary">อาจทำให้วิดีโอและหน้าเว็บบางส่วนไม่สมบูรณ์</string>
  <string name="preference_category_performance">ประสิทธิภาพ</string>
  <string name="preference_performance_block_webfonts">ปิดกั้นแบบอักษรเว็บ</string>
  <string name="preference_performance_block_webfonts_summary">อาจส่งผลให้ไอคอนหรือภาพขาดหายไป</string>
  <string name="preference_performance_block_images">ปิดกั้นภาพ</string>
  <string name="preference_default_browser">ทำให้เป็นเบราว์เซอร์เริ่มต้น</string>
  <string name="preference_category_mozilla">Mozilla</string>
  <string name="preference_mozilla_telemetry">ส่งข้อมูลการใช้งานแบบไม่ระบุตัวตน</string>
  <string name="preference_mozilla_telemetry_summary">เรียนรู้เพิ่มเติม</string>
  <string name="preference_about">เกี่ยวกับ %1$s</string>
  <string name="content_description_clear_input">ล้างข้อมูลที่ป้อน</string>
  <string name="content_description_dismiss_input">ยกเลิก</string>
  <string name="content_description_erase">ล้างประวัติการท่องเว็บ</string>
  <string name="content_description_lock">การเชื่อมต่อปลอดภัย</string>
  <string name="accessibility_announcement_loading">กำลังโหลด</string>
  <string name="accessibility_announcement_loading_finished">โหลดเว็บไซต์แล้ว</string>
  <string name="content_description_menu">ตัวเลือกเพิ่มเติม</string>
  <string name="content_description_forward">นำทางเดินหน้า</string>
  <string name="content_description_reload">โหลดเว็บไซต์ใหม่</string>
  <string name="content_description_back">นำทางย้อนกลับ</string>
  <string name="content_description_stop">หยุดการโหลดเว็บไซต์</string>
  <string name="content_description_customtab_exit">กลับไปที่แอปก่อนหน้า</string>
  <string name="context_menu_paste_go">วางแล้วไป</string>
  <string name="firstrun_title">ท่องเว็บเหมือนไม่มีใครเฝ้ามองอยู่</string>
  <string name="firstrun_description">ปิดกั้นตัวติดตามออนไลน์โดยอัตโนมัติขณะที่คุณท่องเว็บ จากนั้นแตะเพื่อล้างหน้าที่เยี่ยมชม, การค้นหา, คุกกี้ และรหัสผ่านจากอุปกรณ์ของคุณ</string>
  <string name="firstrun_button">ตกลง เข้าใจแล้ว!</string>
  <string name="firstrun_footer">เพื่อให้ชัดเจน ไซต์และบริการที่คุณใช้ยังคงสามารถทราบว่าคุณอยู่ที่ไหน</string>
  <string name="your_rights">สิทธิของคุณ</string>
  <string name="external_app_prompt_title">เปิดลิงก์ในแอปอื่น</string>
  <string name="external_app_prompt">คุณสามารถออกจาก %1$s เพื่อเปิดลิงก์นี้ใน %2$s</string>
  <string name="external_app_prompt_no_app_title">ค้นหาแอปที่สามารถเปิดลิงก์</string>
  <string name="external_app_prompt_no_app">ไม่มีแอปบนอุปกรณ์ของคุณที่สามารถเปิดลิงก์นี้ คุณสามารถออกจาก %1$s เพื่อค้นหา %2$s สำหรับแอปที่สามารถ</string>
  <string name="external_multiple_apps_matched_exit">ออกจากการท่องเว็บแบบส่วนตัว?</string>
  <string name="errorpage_title">เกิดปัญหาในการโหลดหน้า</string>
  <string name="errorpage_refresh">ลองอีกครั้ง</string>
  <string name="error_connectionfailure_title">ไม่สามารถเชื่อมต่อ</string>
  <string name="error_connectionfailure_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li>&#3652;&#3595;&#3605;&#3660;&#3629;&#3634;&#3592;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3652;&#3617;&#3656;&#3652;&#3604;&#3657;&#3594;&#3633;&#3656;&#3623;&#3588;&#3619;&#3634;&#3623;&#3627;&#3619;&#3639;&#3629;&#3585;&#3635;&#3621;&#3633;&#3591;&#3607;&#3635;&#3591;&#3634;&#3609;&#3627;&#3609;&#3633;&#3585;&#3648;&#3585;&#3636;&#3609;&#3652;&#3611; &#3621;&#3629;&#3591;&#3629;&#3637;&#3585;&#3588;&#3619;&#3633;&#3657;&#3591;&#3651;&#3609;&#3629;&#3637;&#3585;&#3626;&#3633;&#3585;&#3588;&#3619;&#3641;&#3656;</li>"\n        "<li>&#3627;&#3634;&#3585;&#3588;&#3640;&#3603;&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3650;&#3627;&#3621;&#3604;&#3627;&#3609;&#3657;&#3634;&#3651;&#3604; &#3654; &#3652;&#3604;&#3657; &#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3585;&#3634;&#3619;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3605;&#3656;&#3629;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3627;&#3619;&#3639;&#3629; Wi-Fi &#3586;&#3629;&#3591;&#3629;&#3640;&#3611;&#3585;&#3619;&#3603;&#3660;&#3617;&#3639;&#3629;&#3606;&#3639;&#3629;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603;</li>"\n      "</ul>]]></string>
  <string name="error_timeout_title">การเชื่อมต่อหมดเวลา</string>
  <string name="error_hostLookup_title">ไม่พบเซิร์ฟเวอร์</string>
  <string name="error_hostLookup_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n        "<li>"&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3651;&#3609;&#3585;&#3634;&#3619;&#3614;&#3636;&#3617;&#3614;&#3660;&#3607;&#3637;&#3656;&#3629;&#3618;&#3641;&#3656; &#3629;&#3618;&#3656;&#3634;&#3591;&#3648;&#3594;&#3656;&#3609; "<strong>ww</strong>".example.com &#3649;&#3607;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3648;&#3611;&#3655;&#3609; "<strong>www</strong>.example.com</li>"\n        "<li>&#3627;&#3634;&#3585;&#3588;&#3640;&#3603;&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3650;&#3627;&#3621;&#3604;&#3627;&#3609;&#3657;&#3634;&#3651;&#3604; &#3654; &#3652;&#3604;&#3657; &#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3585;&#3634;&#3619;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3605;&#3656;&#3629;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3627;&#3619;&#3639;&#3629; Wi-Fi &#3586;&#3629;&#3591;&#3629;&#3640;&#3611;&#3585;&#3619;&#3603;&#3660;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603;</li>"\n      "</ul>]]></string>
  <string name="error_malformedURI_title">ที่อยู่ไม่ถูกต้อง</string>
  <string name="error_malformedURI_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>"&#3607;&#3637;&#3656;&#3629;&#3618;&#3641;&#3656;&#3648;&#3623;&#3655;&#3610;&#3617;&#3633;&#3585;&#3592;&#3632;&#3648;&#3586;&#3637;&#3618;&#3609;&#3648;&#3611;&#3655;&#3609; "<strong>http://www.example.com/</strong></li>"\n  "<li>"&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3651;&#3627;&#3657;&#3649;&#3609;&#3656;&#3651;&#3592;&#3623;&#3656;&#3634;&#3588;&#3640;&#3603;&#3651;&#3594;&#3657;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3607;&#3633;&#3610;&#3652;&#3611;&#3586;&#3657;&#3634;&#3591;&#3627;&#3609;&#3657;&#3634; (&#3585;&#3621;&#3656;&#3634;&#3623;&#3588;&#3639;&#3629; "<strong>/</strong>)</li>\n</ul>]]></string>
  <string name="error_redirectLoop_title">หน้าไม่ได้เปลี่ยนเส้นทางอย่างถูกต้อง</string>
  <string name="error_redirectLoop_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#3611;&#3633;&#3597;&#3627;&#3634;&#3609;&#3637;&#3657;&#3610;&#3634;&#3591;&#3588;&#3619;&#3633;&#3657;&#3591;&#3629;&#3634;&#3592;&#3617;&#3637;&#3626;&#3634;&#3648;&#3627;&#3605;&#3640;&#3617;&#3634;&#3592;&#3634;&#3585;&#3585;&#3634;&#3619;&#3611;&#3636;&#3604;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3627;&#3619;&#3639;&#3629;&#3611;&#3599;&#3636;&#3648;&#3626;&#3608;&#3585;&#3634;&#3619;&#3618;&#3629;&#3617;&#3619;&#3633;&#3610;&#3588;&#3640;&#3585;&#3585;&#3637;&#3657;</li>\n</ul>]]></string>
  <string name="error_unsupportedprotocol_title">ไม่เข้าใจที่อยู่</string>
  <string name="error_unsupportedprotocol_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#3588;&#3640;&#3603;&#3629;&#3634;&#3592;&#3592;&#3635;&#3648;&#3611;&#3655;&#3609;&#3605;&#3657;&#3629;&#3591;&#3605;&#3636;&#3604;&#3605;&#3633;&#3657;&#3591;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3629;&#3639;&#3656;&#3609;&#3648;&#3614;&#3639;&#3656;&#3629;&#3648;&#3611;&#3636;&#3604;&#3607;&#3637;&#3656;&#3629;&#3618;&#3641;&#3656;&#3609;&#3637;&#3657;</li>\n</ul>]]></string>
  <string name="error_sslhandshake_title">การเชื่อมต่อปลอดภัยล้มเหลว</string>
  <string name="error_sslhandshake_message"><![CDATA[<ul xmlns:xliff="urn:oasis:names:tc:xliff:document:1.2">"\n  "<li>&#3626;&#3636;&#3656;&#3591;&#3609;&#3637;&#3657;&#3629;&#3634;&#3592;&#3648;&#3611;&#3655;&#3609;&#3611;&#3633;&#3597;&#3627;&#3634;&#3592;&#3634;&#3585;&#3585;&#3634;&#3619;&#3585;&#3635;&#3627;&#3609;&#3604;&#3588;&#3656;&#3634;&#3586;&#3629;&#3591;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660; &#3627;&#3619;&#3639;&#3629;&#3629;&#3634;&#3592;&#3617;&#3637;&#3651;&#3588;&#3619;&#3610;&#3634;&#3591;&#3588;&#3609;&#3585;&#3635;&#3621;&#3633;&#3591;&#3614;&#3618;&#3634;&#3618;&#3634;&#3617;&#3611;&#3621;&#3629;&#3617;&#3649;&#3611;&#3621;&#3591;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;</li>"\n  "<li>&#3627;&#3634;&#3585;&#3588;&#3640;&#3603;&#3648;&#3588;&#3618;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3605;&#3656;&#3629;&#3585;&#3633;&#3610;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&#3609;&#3637;&#3657;&#3626;&#3635;&#3648;&#3619;&#3655;&#3592;&#3651;&#3609;&#3629;&#3604;&#3637;&#3605; &#3586;&#3657;&#3629;&#3612;&#3636;&#3604;&#3614;&#3621;&#3634;&#3604;&#3629;&#3634;&#3592;&#3648;&#3585;&#3636;&#3604;&#3586;&#3638;&#3657;&#3609;&#3648;&#3614;&#3637;&#3618;&#3591;&#3594;&#3633;&#3656;&#3623;&#3588;&#3619;&#3634;&#3623; &#3649;&#3621;&#3632;&#3588;&#3640;&#3603;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3621;&#3629;&#3591;&#3629;&#3637;&#3585;&#3588;&#3619;&#3633;&#3657;&#3591;&#3651;&#3609;&#3616;&#3634;&#3618;&#3627;&#3621;&#3633;&#3591;</li>\n</ul>]]></string>
  <string name="error_generic_title">อุปส์</string>
  <string name="error_generic_message">เราไม่สามารถโหลดหน้านี้ได้ด้วยเหตุผลบางอย่าง</string>
  <string name="contextmenu_link_share">แบ่งปันลิงก์</string>
  <string name="contextmenu_link_copy">คัดลอกที่อยู่ลิงก์</string>
  <string name="contextmenu_image_share">แบ่งปันภาพ</string>
  <string name="contextmenu_image_copy">คัดลอกที่อยู่ภาพ</string>
  <string name="contextmenu_image_save">บันทึกภาพ</string>
</resources>
