# LOCALIZATION NOTE: Do not translate <html:br/>
migratebeforestart=O perfil selecionado foi criado com uma vers\u00e3o anterior do Netscape e deve ser copiado e convertido antes de que voc\u00ea possa us\u00e1-lo com o %brandShortName%.<html:br/><html:br/> O seu perfil Netscape original n\u00e3o ser\u00e1 alterado. <html:br/><html:br/> Deseja copiar e converter este perfil?
migratebeforerename=O perfil selecionado foi criado com uma vers\u00e3o anterior do Netscape e deve ser copiado e convertido em um perfil %brandShortName% antes de que voc\u00ea possa renome\u00e1-lo.<html:br/><html:br/> O seu perfil Netscape original n\u00e3o ser\u00e1 alterado. <html:br/><html:br/> Deseja converter este perfil?<html:br/><html:br/>
migratebeforedelete=O perfil selecionado foi criado com uma vers\u00e3o anterior do Netscape. O %brandShortName% pode remover este perfil da lista de perfis nele mantida, por\u00e9m voc\u00ea deve remov\u00ea-lo do seu sistema usando a vers\u00e3o do Netscape com que foi criado, ou utilizando m\u00e9todo manual.<html:br/><html:br/> Seu perfil Netscape original n\u00e3o ser\u00e1 alterado. <html:br/><html:br/> Deseja remover este perfil da lista de perfis?<html:br/><html:br/>



migratetitle=Migrar Perfil
migrateallprofilestitle=Migrar Todos os Perfis
renameProfilePrompt=Renomear o perfil "%oldProfileName%" para:
renameprofiletitle=Renomear Perfil

deletetitle=Excluir Perfil
delete4xprofile=O perfil selecionado foi criado com uma vers\u00e3o anterior do Netscape. %S pode remover este perfil da lista de perfis que ele mant\u00e9m, mas ser\u00e1 necess\u00e1rio remov\u00ea-lo de seu sistema utilizando a vers\u00e3o do Netscape que o criou, ou faz\u00ea-lo manualmente.<html:br/><html:br/>Deseja remover este perfil da lista de perfis?<html:br/><html:br/>
deleteprofile=Ao excluir um perfil, este ser\u00e1 removido da lista de perfis dispon\u00edveis e o comando n\u00e3o poder\u00e1 ser desfeito.<html:br/>Voc\u00ea tamb\u00e9m poder\u00e1 optar por excluir os arquivos de dados de perfil, inclusive seu correio, defini\u00e7\u00f5es e certificados salvos. Esta op\u00e7\u00e3o excluir\u00e1 a pasta "%S" e n\u00e3o poder\u00e1 ser desfeita.<html:br/><html:br/>Gostaria de excluir os arquivos de dados de perfil?
deleteFiles=Excluir Arquivos
dontDeleteFiles=N\u00e3o Excluir Arquivos

pm_title=Gerenciar Perfis de Usu\u00e1rio
ps_title=Selecionar Perfil de Usu\u00e1rio

pm_button=Voltar...
ps_button=Gerenciar Perfis...

startButton=Iniciar o %brandShortName%
exitButton=Sair

cancel=Cancelar

invalidCharA=N\u00e3o \u00e9 poss\u00edvel criar ou renomear um perfil para um nome que cont\u00e9m o caractere: "
invalidCharB="<html:br/><html:br/>Escolha outro nome para o perfil.

profileExists=J\u00e1 existe um perfil com este nome. Escolha outro nome.
profileExistsTitle=Perfil j\u00e1 existe
profDirMissing=%S n\u00e3o pode utilizar o perfil "%S" porque o diret\u00f3rio que cont\u00e9m o perfil n\u00e3o foi encontrado.<html:br/><html:br/> Escolha outro perfil ou crie um novo.
profDirLocked=O %S n\u00e3o pode usar o perfil "%S" porque ele j\u00e1 est\u00e1 em uso.<html:br/><html:br/> Escolha outro perfil ou crie um novo.


sourceProfileDirMissing=Este perfil n\u00e3o pode ser migrado porque o diret\u00f3rio que cont\u00e9m as informa\u00e7\u00f5es do perfil n\u00e3o foi encontrado. Escolha outro perfil ou crie um novo.
sourceProfileDirMissingTitle=Diret\u00f3rio do Perfil Ausente
