## Signature Information strings
SINoneLabel=Le message n'a pas de signature num\u00e9rique
SINone=Ce message n'inclut pas la signature num\u00e9rique de l'exp\u00e9diteur. L'absence d'une signature num\u00e9rique signifie que le message peut avoir \u00e9t\u00e9 envoy\u00e9 par quelqu'un d'autre pr\u00e9tendant avoir cette adresse de messagerie. Il est \u00e9galement possible que le message ait \u00e9t\u00e9 modifi\u00e9 pendant son transit sur le r\u00e9seau. Il est toutefois peut probable qu'un de ces \u00e9v\u00e9nements se soit produit.

SIValidLabel=Le message est sign\u00e9
SIValid=Ce message inclut une signature num\u00e9rique valide. Le message n'a pas \u00e9t\u00e9 modifi\u00e9 depuis son envoi.

SIInvalidLabel=La signature num\u00e9rique n'est pas valide
SIInvalidHeader=Ce message inclut une signature num\u00e9rique, mais elle est non valide.

SIContentAltered=La signature ne correspond pas correctement au contenu du message. Le message semble avoir \u00e9t\u00e9 modifi\u00e9 apr\u00e8s sa signature par l'exp\u00e9diteur. Ne vous fiez pas \u00e0 la validit\u00e9 de ce message tant que vous n'en aurez pas v\u00e9rifi\u00e9 le contenu avec l'exp\u00e9diteur.
SIHeaderMismatch=La signature ne correspond pas correctement aux en-t\u00eates du message. Le message semble avoir \u00e9t\u00e9 modifi\u00e9 apr\u00e8s sa signature par l'exp\u00e9diteur. Ne vous fiez pas \u00e0 la validit\u00e9 de ce message tant que vous n'en aurez pas v\u00e9rifi\u00e9 le contenu avec l'exp\u00e9diteur.
SIExpired=Le certificat utilis\u00e9 pour signer le message semble avoir expir\u00e9. V\u00e9rifiez que l'horloge de votre ordinateur est correctement r\u00e9gl\u00e9e.
SIRevoked=Le certificat utilis\u00e9 pour signer le message a \u00e9t\u00e9 r\u00e9voqu\u00e9. Ne vous fiez pas \u00e0 la validit\u00e9 de ce message tant que vous n'en aurez pas v\u00e9rifi\u00e9 le contenu avec l'exp\u00e9diteur.
SINotYetValid=Le certificat utilis\u00e9 pour signer le message semble ne pas encore \u00eatre valide. V\u00e9rifiez que l'horloge de votre ordinateur est correctement r\u00e9gl\u00e9e.
SIUnknownCA=Le certificat utilis\u00e9 pour signer le message a \u00e9t\u00e9 \u00e9mis par une autorit\u00e9 de certification inconnue.
SIUntrustedCA=Le certificat utilis\u00e9 pour signer le message a \u00e9t\u00e9 \u00e9mis par une autorit\u00e9 de certification en laquelle vous n'avez pas confiance pour l'\u00e9mission de ce type de certificat.
SIExpiredCA=Le certificat utilis\u00e9 pour signer le message a \u00e9t\u00e9 \u00e9mis par une autorit\u00e9 de certification dont le propre certificat a expir\u00e9. V\u00e9rifiez que l'horloge de votre ordinateur est correctement r\u00e9gl\u00e9e.
SIRevokedCA=Le certificat utilis\u00e9 pour signer le message a \u00e9t\u00e9 \u00e9mis par une autorit\u00e9 de certification dont le propre certificat a \u00e9t\u00e9 r\u00e9voqu\u00e9. Ne vous fiez pas \u00e0 la validit\u00e9 de ce message tant que vous n'en aurez pas v\u00e9rifi\u00e9 le contenu avec l'exp\u00e9diteur.
SINotYetValidCA=Le certificat utilis\u00e9 pour signer le message a \u00e9t\u00e9 \u00e9mis par une autorit\u00e9 de certification dont le propre certificat n'est pas encore valide. V\u00e9rifiez que l'horloge de votre ordinateur est correctement r\u00e9gl\u00e9e.
SIInvalidCipher=Le message a \u00e9t\u00e9 sign\u00e9 en utilisant un niveau de chiffrement que cette version de votre logiciel ne prend pas en charge.
SIClueless=Probl\u00e8mes inconnus avec cette signature num\u00e9rique. Ne vous fiez pas \u00e0 la validit\u00e9 de ce message tant que vous n'en aurez pas v\u00e9rifi\u00e9 le contenu avec l'exp\u00e9diteur.


## Encryption Information strings
EINoneLabel=Message non chiffr\u00e9
EINone=Ce message n'a pas \u00e9t\u00e9 chiffr\u00e9 avant d'\u00eatre envoy\u00e9. Les informations transmises sur Internet sans chiffrement peuvent \u00eatre visualis\u00e9es par d'autres personnes pendant leur transit.

EIValidLabel=Message chiffr\u00e9
EIValid=Ce message a \u00e9t\u00e9 chiffr\u00e9 avant de vous \u00eatre envoy\u00e9. Le chiffrement rend tr\u00e8s difficile la visualisation des informations par d'autres personnes pendant le transit du message sur le r\u00e9seau.

EIInvalidLabel=Le message ne peut pas \u00eatre d\u00e9chiffr\u00e9
EIInvalidHeader=Ce message a \u00e9t\u00e9 chiffr\u00e9 avant de vous \u00eatre envoy\u00e9, mais ne peut pas \u00eatre d\u00e9chiffr\u00e9.

EIContentAltered=Le contenu du message semble avoir \u00e9t\u00e9 alt\u00e9r\u00e9 pendant la transmission.
EINoDecryptCert=Le certificat utilis\u00e9 pour chiffrer le message est introuvable.
EIPasswordError=Vous n'avez pas introduit correctement votre mot de passe principal.
EIInvalidCipher=Le message a \u00e9t\u00e9 sign\u00e9 en utilisant un niveau de chiffrement que cette version de votre logiciel ne prend pas en charge.
EIClueless=Probl\u00e8mes inconnus avec ce message chiffr\u00e9.


## Signing Power Information string
SPCanLabel=Le message peut \u00eatre sign\u00e9
SPCanHeader=Vous avez choisi de signer num\u00e9riquement ce message avant de l'envoyer.
SPCan=Lorsque d'autres personnes re\u00e7oivent votre message sign\u00e9, elles peuvent v\u00e9rifier que le message vient de vous et qu'il n'a pas \u00e9t\u00e9 modifi\u00e9 depuis que vous l'avez sign\u00e9.

SPCannotLabel=Le message ne peut pas \u00eatre sign\u00e9
SPCannotHeader=Vous ne pouvez pas signer num\u00e9riquement ce message.

SPNoCert=Vous n'avez pas sp\u00e9cifi\u00e9 de certificat valide pour la cr\u00e9ation de signatures num\u00e9riques.
SPNoSigCert=Le certificat que vous avez sp\u00e9cifi\u00e9 pour la signature de messages ne peut pas \u00eatre utilis\u00e9 \u00e0 cette fin.
SPNoValidCert=Le certificat que vous avez sp\u00e9cifi\u00e9 pour la signature de messages n'est pas encore valide. V\u00e9rifiez que l'horloge de votre ordinateur est correctement r\u00e9gl\u00e9e.
SPExpiredCert=Le certificat que vous avez sp\u00e9cifi\u00e9 pour la signature de messages a expir\u00e9.
SPRevokedCert=Le certificat que vous avez sp\u00e9cifi\u00e9 pour la signature de messages a \u00e9t\u00e9 r\u00e9voqu\u00e9.


## Encryption Power Information string
EPCanLabel=Le message peut \u00eatre chiffr\u00e9
EPCanHeader=Vous avez choisi de chiffrer ce message avant de l'envoyer.
EPCan=Si vous avez choisi d'enregistrer des copies de vos messages sortants, ce message sera chiffr\u00e9 avant d'\u00eatre enregistr\u00e9.

EPCannotLabel=Le message ne peut pas \u00eatre chiffr\u00e9
EPCannotHeader=Ce message ne peut pas \u00eatre chiffr\u00e9.

EPRecipientUnknown=Vous n'avez entr\u00e9 aucun destinataire.
EPNoCerts=Vous n'avez pas de certificats valides pour les destinataires suivants :
EPClueless=Probl\u00e8mes inconnus avec ce message.
