## S/MIME error strings.
## Note to localization: %S is a placeholder
NoSenderSigningCert=\u60a8\u6307\u5b9a\u8be5\u90ae\u4ef6\u5e94\u6709\u6570\u5b57\u7b7e\u540d\uff0c\u4f46\u5e94\u7528\u7a0b\u5e8f\u65e0\u6cd5\u5728\u90ae\u4ef6\u53ca\u65b0\u95fb\u7ec4\u5e10\u6237\u8bbe\u7f6e\u4e2d\u627e\u5230\u60a8\u6307\u5b9a\u7684\u7b7e\u540d\u8bc1\u4e66\uff0c\u6216\u8bc1\u4e66\u5df2\u8fc7\u671f\u3002
NoSenderEncryptionCert=\u60a8\u6307\u5b9a\u5bf9\u672c\u90ae\u4ef6\u8fdb\u884c\u52a0\u5bc6\uff0c\u4f46\u5e94\u7528\u7a0b\u5e8f\u65e0\u6cd5\u5728\u90ae\u4ef6\u53ca\u65b0\u95fb\u7ec4\u5e10\u6237\u8bbe\u7f6e\u4e2d\u627e\u5230\u60a8\u6307\u5b9a\u7684\u52a0\u5bc6\u8bc1\u4e66\uff0c\u6216\u8bc1\u4e66\u5df2\u8fc7\u671f\u3002
MissingRecipientEncryptionCert=\u60a8\u6307\u5b9a\u5bf9\u672c\u90ae\u4ef6\u8fdb\u884c\u52a0\u5bc6\uff0c\u4f46\u5e94\u7528\u7a0b\u5e8f\u627e\u4e0d\u5230 %S \u7684\u52a0\u5bc6\u8bc1\u4e66\u3002
SignNoSenderEncryptionCert=\u60a8\u6307\u5b9a\u8be5\u90ae\u4ef6\u5e94\u6709\u6570\u5b57\u7b7e\u540d\uff0c\u4f46\u5e94\u7528\u7a0b\u5e8f\u627e\u4e0d\u5230\u9700\u5305\u542b\u5728\u7b7e\u540d\u90ae\u4ef6\u7684\u52a0\u5bc6\u8bc1\u4e66\uff0c\u6216\u8be5\u8bc1\u4e66\u5df2\u8fc7\u671f\u3002
ErrorCanNotEncrypt=\u65e0\u6cd5\u5bf9\u90ae\u4ef6\u8fdb\u884c\u52a0\u5bc6\u5904\u7406\u3002\u8bf7\u68c0\u67e5\u60a8\u662f\u5426\u6709\u9488\u5bf9\u6bcf\u4e00\u6536\u4ef6\u4eba\u7684\u6709\u6548\u7535\u5b50\u90ae\u4ef6\u8bc1\u4e66\uff0c\u5e76\u8bf7\u68c0\u67e5\u5728\u90ae\u4ef6\u53ca\u65b0\u95fb\u7ec4\u5e10\u6237\u8bbe\u7f6e\u4e2d\u4e3a\u6b64\u90ae\u4ef6\u5e10\u6237\u6307\u5b9a\u7684\u8bc1\u4e66\u662f\u5426\u6709\u6548\u4e14\u53ef\u4fe1\u3002
ErrorCanNotSign=\u65e0\u6cd5\u7b7e\u7f72\u90ae\u4ef6\u3002\u5e76\u8bf7\u68c0\u67e5\u5728\u90ae\u4ef6\u53ca\u65b0\u95fb\u7ec4\u5e10\u6237\u8bbe\u7f6e\u4e2d\u4e3a\u6b64\u90ae\u4ef6\u5e10\u6237\u6307\u5b9a\u7684\u8bc1\u4e66\u662f\u5426\u6709\u6548\u4e14\u53ef\u4fe1

## Strings used for in the prefs.
prefPanel-smime=\u5b89\u5168\u6027
NoSigningCert=\u8bc1\u4e66\u7ba1\u7406\u5668\u627e\u4e0d\u5230\u60a8\u53ef\u7528\u4e4b\u5bf9\u90ae\u4ef6\u8fdb\u884c\u6570\u5b57\u7b7e\u540d\u7684\u6709\u6548\u8bc1\u4e66\u3002
NoEncryptionCert=\u8bc1\u4e66\u7ba1\u7406\u5668\u627e\u4e0d\u5230\u5176\u4ed6\u4eba\u53ef\u7528\u6765\u5411\u60a8\u53d1\u9001\u52a0\u5bc6\u7535\u5b50\u90ae\u4ef6\u7684\u6709\u6548\u8bc1\u4e66\u3002

encryption_needCertWantSame=\u5728\u5bf9\u90ae\u4ef6\u8fdb\u884c\u6570\u5b57\u7b7e\u540d\u524d\uff0c\u60a8\u8fd8\u987b\u6307\u5b9a\u4e00\u4e2a\u5176\u4ed6\u4eba\u53ef\u7528\u4e4b\u5411\u60a8\u53d1\u9001\u52a0\u5bc6\u90ae\u4ef6\u7684\u8bc1\u4e66\u3002\u60a8\u662f\u5426\u60f3\u7528\u540c\u4e00\u8bc1\u4e66\u5bf9\u53d1\u9001\u7ed9\u60a8\u7684\u90ae\u4ef6\u8fdb\u884c\u52a0\u5bc6\u548c\u89e3\u5bc6\uff1f
encryption_wantSame=\u60a8\u662f\u5426\u60f3\u7528\u540c\u4e00\u8bc1\u4e66\u5bf9\u53d1\u9001\u7ed9\u60a8\u7684\u90ae\u4ef6\u8fdb\u52a0\u5bc6\u548c\u89e3\u5bc6\uff1f
encryption_needCertWantToSelect=\u5728\u5bf9\u90ae\u4ef6\u8fdb\u884c\u6570\u5b57\u7b7e\u540d\u524d\uff0c\u60a8\u8fd8\u987b\u6307\u5b9a\u4e00\u4e2a\u5176\u4ed6\u4eba\u53ef\u7528\u4e4b\u5411\u60a8\u53d1\u9001\u52a0\u5bc6\u90ae\u4ef6\u7684\u8bc1\u4e66\u3002\u60a8\u662f\u5426\u60f3\u73b0\u5728\u5c31\u914d\u7f6e\u4e00\u4e2a\u52a0\u5bc6\u7528\u7684\u8bc1\u4e66\uff1f
signing_needCertWantSame=\u60a8\u8fd8\u5e94\u4e3a\u60a8\u81ea\u5df1\u7684\u90ae\u4ef6\u6307\u5b9a\u4e00\u4e2a\u6570\u5b57\u7b7e\u540d\u7528\u7684\u8bc1\u4e66\u3002\u60a8\u662f\u5426\u60f3\u7528\u540c\u4e00\u8bc1\u4e66\u5bf9\u60a8\u7684\u90ae\u4ef6\u8fdb\u884c\u6570\u5b57\u7b7e\u540d\uff1f
signing_wantSame=\u60a8\u662f\u5426\u60f3\u7528\u540c\u4e00\u8bc1\u4e66\u5bf9\u60a8\u7684\u90ae\u4ef6\u8fdb\u884c\u6570\u5b57\u7b7e\u540d\uff1f
signing_needCertWantToSelect=\u60a8\u8fd8\u5e94\u4e3a\u60a8\u81ea\u5df1\u7684\u90ae\u4ef6\u6307\u5b9a\u4e00\u4e2a\u6570\u5b57\u7b7e\u540d\u7528\u7684\u8bc1\u4e66\u3002\u60a8\u662f\u5426\u60f3\u73b0\u5728\u5c31\u914d\u7f6e\u4e00\u4e2a\u90ae\u4ef6\u6570\u5b57\u7b7e\u540d\u7528\u7684\u8bc1\u4e66\uff1f
